Rhino.DocObjects.Tables.ObjectTable.BoundingBox
Gets the boundingbox for all objects (normal, locked and hidden) in this
document that exist in "model" space. This bounding box does not include
objects that exist in layout space

Rhino.DocObjects.Tables.ObjectTable.BoundingBoxVisible
Gets the boundingbox for all visible objects (normal and locked) in this
document that exist in "model" space. This bounding box does not include
hidden objects or any objects that exist in layout space

Rhino.DocObjects.Tables.ObjectTable.Find(System.Guid)
Use the object guid to find a rhino object. Deleted objects cannot be found by id.
The guid is the value that is stored on RhinoObject.Id
In a single document, no two active objects have the same guid. If an object is
replaced with a new object, then the guid  persists. For example, if the Move command
moves an object, then the moved object inherits it's guid from the starting object.
If the Copy command copies an object, then the copy gets a new guid. This guid persists
through file saving/openning operations. This function will not find grip objects.
objectId: ID of object to search for.
Returns: Reference to the rhino object with the objectId or null if no such object could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByGroup(System.Int32)
Find all RhinoObjects that are in a given group.
groupIndex: Index of group to search for.
Returns: An array of objects that belong to the specified group or null if no objects could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByLayer(Rhino.DocObjects.Layer)
Find all RhinoObjects that are in a given layer.
layer: Layer to search.
Returns:
Array of objects that belong to the specified group or null if no objects could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByLayer(System.String)
Find all RhinoObjects that are in a given layer.
layerName: Name of layer to search.
Returns:
Array of objects that belong to the specified group or null if no objects could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByFilter(Rhino.DocObjects.ObjectEnumeratorSettings)
Same as GetObjectList but converts the result to an array
filter:
Returns:

Rhino.DocObjects.Tables.ObjectTable.AddPoint(System.Double,System.Double,System.Double)
Add a point object to the document.
x: X component of point coordinate.
y: Y component of point coordinate.
z: Z component of point coordinate.
Returns: id of new Rhino object.

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3d)
Add a point object to the document.
point: location of point
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Add a point object to the document
point: location of point
attributes: attributes to apply to point
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3f)
Add a point object to the document.
point: location of point
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3f,Rhino.DocObjects.ObjectAttributes)
Add a point object to the document
point: location of point
attributes: attributes to apply to point
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Add multiple points to the document.
points: Points to add.
Returns: List of object ids.

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Add multiple points to the document.
points: Points to add.
attributes: Attributes to apply to point objects.
Returns: List of object ids.

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f})
Add multiple points to the document.
points: Points to add.
Returns: List of object ids.

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f},Rhino.DocObjects.ObjectAttributes)
Add multiple points to the document.
points: Points to add.
attributes: Attributes to apply to point objects.
Returns: List of object ids.

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(Rhino.Geometry.PointCloud)
Add a point cloud object to the document
cloud: PointCloud to add.
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes)
Add a point cloud object to the document
cloud: PointCloud to add.
attributes: attributes to apply to point cloud
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Add a point cloud object to the document
points:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Add a point cloud object to the document
points:
attributes: attributes to apply to point cloud
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Guid)
Add a clipping plane object to Rhino
plane:
uMagnitude:
vMagnitude:
clippedViewportId: viewport id that the new clipping plane will clip
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid})
Add a clipping plane object to Rhino
plane:
uMagnitude:
vMagnitude:
clippedViewportIds: list of viewport ids that the new clipping plane will clip
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid},Rhino.DocObjects.ObjectAttributes)
Add a clipping plane object to Rhino
plane:
uMagnitude:
vMagnitude:
clippedViewportIds: list of viewport ids that the new clipping plane will clip
attributes:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Add a line object to Rhino
from:
to:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Add a line object to Rhino
from:
to:
attributes: attributes to apply to line
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Line)
Add a line object to Rhino
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Line,Rhino.DocObjects.ObjectAttributes)
Add a line object to Rhino
line:
attributes: attributes to apply to line
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Add a polyline object to Rhino
points:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Add a polyline object to Rhino
points:
attributes: attributes to apply to line
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddArc(Rhino.Geometry.Arc)
Add a curve object to the document representing an arc
arc:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddArc(Rhino.Geometry.Arc,Rhino.DocObjects.ObjectAttributes)
Add a curve object to the document representing an arc
arc:
attributes: attributes to apply to arc
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddCircle(Rhino.Geometry.Circle)
Add a curve object to the document representing a circle
circle:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddCircle(Rhino.Geometry.Circle,Rhino.DocObjects.ObjectAttributes)
Add a curve object to the document representing a circle
circle:
attributes: attributes to apply to circle
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddEllipse(Rhino.Geometry.Ellipse)
Add a curve object to the document representing an ellipse
ellipse:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddEllipse(Rhino.Geometry.Ellipse,Rhino.DocObjects.ObjectAttributes)
Add a curve object to the document representing an ellipse
ellipse:
attributes: attributes to apply to ellipse
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddCurve(Rhino.Geometry.Curve)
Add a curve object to Rhino
curve:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)
Add a curve object to Rhino
curve: A duplicate of this curve is added to Rhino
attributes: attributes to apply to curve
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(System.String,Rhino.Geometry.Point3d)
Add a text dot object to Rhino
text:
location:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(System.String,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Add a text dot object to Rhino
text:
location:
attributes:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(Rhino.Geometry.TextDot)
Add a text dot object to Rhino
dot:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)
Add a text dot object to Rhino
dot:
attributes:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Display.Text3d)
Add an annotation text object to the document.
text3d: The text object to add.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Display.Text3d,Rhino.DocObjects.ObjectAttributes)
Add an annotation text object to the document.
text3d: The text object to add.
attributes: Object Attributes.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)
Add an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.ObjectAttributes)
Add an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
attributes: Object Attributes.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddSurface(Rhino.Geometry.Surface)
Add a surface object to Rhino
surface: A duplicate of this surface is added to Rhino
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddSurface(Rhino.Geometry.Surface,Rhino.DocObjects.ObjectAttributes)
Add a surface object to Rhino
surface: A duplicate of this surface is added to Rhino
attributes:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddMesh(Rhino.Geometry.Mesh)
Add a mesh object to Rhino
mesh: A duplicate of this mesh is added to Rhino
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)
Add a mesh object to Rhino
mesh: A duplicate of this mesh is added to Rhino
attributes:
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep)
Add a brep object to Rhino
brep: A duplicate of this brep is added to Rhino
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes)
Add a brep object to Rhino
brep: A duplicate of this brep is added to Rhino
attributes: attributes to apply to brep
Returns: id of new rhino object

Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.ObjRef,System.Boolean)
Deletes objref.Object().  The deletion can be undone by calling UndeleteObject().
objref: objref.Object() will be deleted
quiet: if false, a message box will appear when an object cannot be deleted
Returns:

Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.RhinoObject,System.Boolean)
Deletes object from document.  The deletion can be undone by calling UndeleteObject().
obj: the object to delete
quiet: if false, a message box will appear when an object cannot be deleted
Returns:

Rhino.DocObjects.Tables.ObjectTable.Delete(System.Guid,System.Boolean)
Deletes object from document.  The deletion can be undone by calling UndeleteObject().
objectId: Id of the object to delete
quiet: if false, a message box will appear when an object cannot be deleted
Returns:

Rhino.DocObjects.Tables.ObjectTable.ModifyAttributes(Rhino.DocObjects.ObjRef,Rhino.DocObjects.ObjectAttributes,System.Boolean)
Modifies an object's attributes.  Cannot be used to change object id
objref: reference to object to modify
newAttributes: new attributes
quiet: if true, then warning message boxes are disabled
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.ModifyAttributes(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.ObjectAttributes,System.Boolean)
Modifies an object's attributes.  Cannot be used to change object id
obj: object to modify
newAttributes: new attributes
quiet: if true, then warning message boxes are disabled
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.ModifyAttributes(System.Guid,Rhino.DocObjects.ObjectAttributes,System.Boolean)
Modifies an object's attributes.  Cannot be used to change object id
objectId: Id of object to modify
newAttributes: new attributes
quiet: if true, then warning message boxes are disabled
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Point3d)
Replace one object with new point object
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
point: new point to be added.  The point is copied
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.TextDot)
Replace one object with new textdot object
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
dot: new textdot to be added.  The textdot is copied
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Line)
Replace one object with new line curve object
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
line: new line to be added.  The line is copied
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Circle)
Replace one object with new curve object
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
circle: new circle to be added.  The circle is copied
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Arc)
Replace one object with new curve object
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
arc: new arc to be added.  The arc is copied
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Polyline)
Replace one object with new curve object
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
polyline: new polyline to be added.  The polyline is copied
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Curve)
Replace one object with new curve object
objref: reference to old object to be replaced. The objref.Object() will be deleted
curve:
New curve to be added. A duplicate of the curve is added to the Rhino model.
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Surface)
Replace one object with new surface object
objref: reference to old object to be replaced. The objref.Object() will be deleted
surface:
new surface to be added
A duplicate of the surface is added to the Rhino model
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Brep)
Replace one object with new brep object
objref: reference to old object to be replaced. The objref.Object() will be deleted
brep:
new brep to be added
A duplicate of the brep is added to the Rhino model
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Mesh)
Replace one object with new mesh object
objref: reference to old object to be replaced. The objref.Object() will be deleted
mesh:
new mesh to be added
A duplicate of the mesh is added to the Rhino model
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.TextEntity)
Replace one object with new text object
objref: reference to old object to be replaced. The objref.Object() will be deleted
text:
new text to be added
A duplicate of the text is added to the Rhino model
Returns: true if successful

Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsNormal() is true, then the object will be hidden.
objref: reference to object to hide
ignoreLayerMode:
if true, the object will be hidden even if it is on a layer that is locked or off
Returns: true if the object was successfully hidden

Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsNormal() is true, then the object will be hidden.
obj: object to hide
ignoreLayerMode:
if true, the object will be hidden even if it is on a layer that is locked or off
Returns: true if the object was successfully hidden

Rhino.DocObjects.Tables.ObjectTable.Hide(System.Guid,System.Boolean)
If Object().IsNormal() is true, then the object will be hidden.
objectId: Id of object to hide
ignoreLayerMode:
if true, the object will be hidden even if it is on a layer that is locked or off
Returns: true if the object was successfully hidden

Rhino.DocObjects.Tables.ObjectTable.Show(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
objref: reference to normal object to show
ignoreLayerMode:
if true, the object will be shown even if it is on a layer that is locked or off
Returns: true if the object was successfully shown

Rhino.DocObjects.Tables.ObjectTable.Show(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
obj: the normal object to show
ignoreLayerMode:
if true, the object will be shown even if it is on a layer that is locked or off
Returns: true if the object was successfully shown

Rhino.DocObjects.Tables.ObjectTable.Show(System.Guid,System.Boolean)
If Object().IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
objectId: Id of the normal object to show
ignoreLayerMode:
if true, the object will be shown even if it is on a layer that is locked or off
Returns: true if the object was successfully shown

Rhino.DocObjects.Tables.ObjectTable.Lock(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsNormal() is true, then the object will be locked.
objref: reference to normal object to lock
ignoreLayerMode:
if true, the object will be locked even if it is on a layer that is locked or off
Returns: true if the object was successfully locked

Rhino.DocObjects.Tables.ObjectTable.Lock(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsNormal() is true, then the object will be locked.
obj: normal object to lock
ignoreLayerMode:
if true, the object will be locked even if it is on a layer that is locked or off
Returns: true if the object was successfully locked

Rhino.DocObjects.Tables.ObjectTable.Lock(System.Guid,System.Boolean)
If objref.Object().IsNormal() is true, then the object will be locked.
objectId: Id of normal object to lock
ignoreLayerMode:
if true, the object will be locked even if it is on a layer that is locked or off
Returns: true if the object was successfully locked

Rhino.DocObjects.Tables.ObjectTable.Unlock(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsLocked() is true, then the object will be returned to normal (visible and selectable) mode
objref: reference to locked object to unlock
ignoreLayerMode:
if true, the object will be unlocked even if it is on a layer that is locked or off
Returns: true if the object was successfully unlocked

Rhino.DocObjects.Tables.ObjectTable.Unlock(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsLocked() is true, then the object will be returned to normal (visible and selectable) mode
obj: locked object to unlock
ignoreLayerMode:
if true, the object will be unlocked even if it is on a layer that is locked or off
Returns: true if the object was successfully unlocked

Rhino.DocObjects.Tables.ObjectTable.Unlock(System.Guid,System.Boolean)
If Object().IsLocked() is true, then the object will be returned to normal (visible and selectable) mode
objectId: Id of locked object to unlock
ignoreLayerMode:
if true, the object will be unlocked even if it is on a layer that is locked or off
Returns: true if the object was successfully unlocked

Rhino.DocObjects.Tables.ObjectTable.UnselectAll(System.Boolean)
Unselect objects
ignorePersistentSelections:
if true, then objects that are persistently selected will not be unselected
Returns: Number of object that were unselected

Rhino.DocObjects.Tables.ObjectTable.UnselectAll
Unselect objects
Returns: Number of object that were unselected

Rhino.DocObjects.Tables.ObjectTable.Transform(Rhino.DocObjects.ObjRef,Rhino.Geometry.Transform,System.Boolean)
Creates a new object that is the transformation of the existing object
and deletes the existing object if deleteOriginal is true.
objref:
reference to object to transform. The objref.Object() will be deleted if deleteOriginal is true
xform: transformation to apply
deleteOriginal:
if true, the original object is deleted
if false, the original object is not deleted
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed

Rhino.DocObjects.Tables.ObjectTable.Transform(Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform,System.Boolean)
Creates a new object that is the transformation of the existing object
and deletes the existing object if deleteOriginal is true.
obj:
Rhino object to transform. This object will be deleted if deleteOriginal is true.
xform: transformation to apply
deleteOriginal:
if true, the original object is deleted
if false, the original object is not deleted
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed

Rhino.DocObjects.Tables.ObjectTable.Transform(System.Guid,Rhino.Geometry.Transform,System.Boolean)
Creates a new object that is the transformation of the existing object
and deletes the existing object if deleteOriginal is true.
objectId:
Id of rhino object to transform. This object will be deleted if deleteOriginal is true.
xform: transformation to apply
deleteOriginal:
if true, the original object is deleted
if false, the original object is not deleted
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed

Rhino.DocObjects.Tables.ObjectTable.TransformWithHistory(Rhino.DocObjects.ObjRef,Rhino.Geometry.Transform)
Creates a new object that is the transformation of the existing object
and records history of the transformation if history recording is turned on.
If history recording is not enabled, this function will act the same as
Transform(objref, xform, false)
objref:
reference to object to transform
xform: transformation to apply
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed

Rhino.DocObjects.Tables.ObjectTable.TransformWithHistory(Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform)
Creates a new object that is the transformation of the existing object
and records history of the transformation if history recording is turned on.
If history recording is not enabled, this function will act the same as
Transform(obj, xform, false)
obj:
Rhino object to transform
xform: transformation to apply
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed

Rhino.DocObjects.Tables.ObjectTable.TransformWithHistory(System.Guid,Rhino.Geometry.Transform)
Creates a new object that is the transformation of the existing object
and records history of the transformation if history recording is turned on.
If history recording is not enabled, this function will act the same as
Transform(objectId, xform, false)
objectId:
Id of rhino object to transform
xform: transformation to apply
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed

Rhino.DocObjects.Tables.ObjectTable.Duplicate(Rhino.DocObjects.ObjRef)
Same as Transform(objref, ON_Xform.Identity, false)
objref:
Returns:

Rhino.DocObjects.Tables.ObjectTable.Duplicate(Rhino.DocObjects.RhinoObject)
Same as TransformObject(obj, ON_Xform.Identity, false)
obj:
Returns:

Rhino.DocObjects.Tables.ObjectTable.Duplicate(System.Guid)
Same as TransformObject(objref, ON_Xform.Identity, false)
objectId:
Returns:

Rhino.DocObjects.Tables.ObjectTable.GripUpdate(Rhino.DocObjects.RhinoObject,System.Boolean)
Altered grip positions on a RhinoObject are used to calculate an updated object
that is added to the document
obj: object with modified grips to update
deleteOriginal: if true, obj is deleted from the document
Returns: new RhinoObject on success; otherwise null