Rhino.Commands.Command.InCommand
Determines if Rhino is currently running a command.
Returns: True if a command is currently running, false if no commands are currently running.

Rhino.Commands.Command.InScriptRunnerCommand
This is a low level tool to determine if Rhino is currently running
a script running command like "ReadCommandFile" or the RhinoScript
plug-in's "RunScript".
Returns: True if a script running command is active.