Rhino.Geometry.Cylinder
A right circular cylinder

Rhino.Geometry.Cylinder.#ctor(Rhino.Geometry.Circle)
Create a new cylinder with infinite height.
baseCircle: Base circle for infinite cylinder.

Rhino.Geometry.Cylinder.#ctor(Rhino.Geometry.Circle,System.Double)
Create a new cylinder with a finite height.
baseCircle: Base circle for cylinder.
height: Height of cylinder (zero for infinite cylinder).

Rhino.Geometry.Cylinder.IsFinite
True if the cylinder is finite (height[0] != height[1])
False if the cylinder is infinite.

Rhino.Geometry.Cylinder.ToBrep(System.Boolean,System.Boolean)
Create a Brep representation of this Cylinder.
This is synonymous with calling NurbsSurface.CreateFromCylinder().
capBottom: If true, the bottom of the cylinder will be capped.
capTop: If true, the top of the cylinder will be capped.
Returns: A Brep representation of the cylinder or null.

Rhino.Geometry.Cylinder.ToNurbsSurface
Create a Nurbs surface representation of this Cylinder.
This is synonymous with calling NurbsSurface.CreateFromCylinder().
Returns: A Nurbs surface representation of the cylinder or null.

Rhino.Geometry.Cylinder.ToRevSurface
Create a RevSurface representation of this Cylinder.
This is synonymous with calling RevSurface.CreateFromCylinder().
Returns: A RevSurface representation of the cylinder or null.