Rhino.Geometry.Intersect.IntersectionEvent.IsPoint
All curve intersection events are either a single point or an overlap

Rhino.Geometry.Intersect.IntersectionEvent.IsOverlap
All curve intersection events are either a single point or an overlap