Rhino.ApplicationSettings.EdgeAnalysisSettings.ShowEdgeColor
color used to enhance display edges in commands like ShowEdges and ShowNakedEdges.

Rhino.ApplicationSettings.EdgeAnalysisSettings.ShowEdges
0 = all, 1 = naked, 2 = non-manifold