Rhino.Display.DisplayPipeline
The display pipeline calls events during specific phases of drawing
During the drawing of a single frame the events are called in the following order
[Begin Drawing of a Frame]
CalculateBoundingBoxCalculateClippingPanesSetupFrustumSetupLightingInitializeFrameBufferDrawBackgroundIf this is a layout and detail objects exist the channels are called in the
same order for each detail object (drawn as a nested viewport)PreDrawObjectsFor Each Visible Non Highlighted ObjectSetupObjectDisplayAttributesPreDrawObjectDrawObjectPostDrawObjectPostDrawObjects - depth writing/testing onDrawForeGround - depth writing/testing offFor Each Visible Highlighted ObjectSetupObjectDisplayAttributesPreDrawObjectDrawObjectPostDrawObjectPostProcessFrameBuffer (If a delegate exists that requires this)DrawOverlay (if Rhino is in a feedback mode)
[End of Drawing of a Frame]
NOTE: There may be multiple DrawObject calls for a single object. An example of when this could
happen would be with a shaded sphere. The shaded mesh is first drawn and these channels would
be processed; then at a later time the isocurves for the sphere would be drawn.

Rhino.Display.DisplayPipeline.PostDrawObjects
Called after all non-highlighted objects have been drawn. Depth writing and testing are
still turned on. If you want to draw without depth writing/testing, see DrawForeground

Rhino.Display.DisplayPipeline.DrawForeground
Called after all non-highlighted objects have been drawn and PostDrawObjects has been called.
Depth writing and testing are turned OFF. If you want to draw with depth writing/testing,
see PostDrawObjects

Rhino.Display.DisplayPipeline.StereoProjection
Get the current stereo projection if stereo mode is on.
0 = left1 = right
If stereo mode is not enables, this property always returns 0.

Rhino.Display.DisplayPipeline.EnableDepthTesting(System.Boolean)
Enable or disable the DepthTesting behaviour of the engine.
When DepthTesting is disabled, objects in front will no
longer occlude objects behind them.
enable: True to enable DepthTesting, false to disable.

Rhino.Display.DisplayPipeline.EnableDepthWriting(System.Boolean)
Enable or disable the DepthWriting behaviour of the engine.
When DepthWriting is disabled, drawn geometry does not affect the Z-Buffer.
enable: True to enable DepthWriting, false to disable.

Rhino.Display.DisplayPipeline.EnableColorWriting(System.Boolean)
Enable or disable the ColorWriting behaviour of the engine.
enable: True to enable ColorWriting, false to disable.

Rhino.Display.DisplayPipeline.EnableLighting(System.Boolean)
Enable or disable the Lighting logic of the engine.
enable: True to enable Lighting, false to disable.

Rhino.Display.DisplayPipeline.EnableClippingPlanes(System.Boolean)
Enable or disable the Clipping Plane logic of the engine.
enable: True to enable Clipping Planes, false to disable.

Rhino.Display.DisplayPipeline.IsVisible(Rhino.Geometry.Point3d)
Test a given 3d world coordinate point for visibility inside the view
frustum under the current viewport and model transformation settings.
worldCoordinate: Point to test for visibility
Returns: True if the point is visible, false if it is not.

Rhino.Display.DisplayPipeline.IsVisible(Rhino.DocObjects.RhinoObject)
Test a given object for visibility inside the view frustum under the current viewport and model
transformation settings. This function calls a virtual IsVisibleFinal function that
subclassed pipelines can add extra tests to. In the base class, this test only tests
visibility based on the objects world coordinates location and does not pay attention
to the object's attributes.
NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility"
tests based on location (is some part of the object in the view frustum).
Use CRhinoDisplayPipeline::IsActive() to perform "visibility"
tests based on object type.
rhinoObject: Object to test.
Returns: True if the object is visible, false if not.

Rhino.Display.DisplayPipeline.IsVisible(Rhino.Geometry.BoundingBox)
Test a given box for visibility inside the view frustum under the current
viewport and model transformation settings.
bbox: Box to test for visibility
Returns: True if at least some portion of the box is visible, false if not.

Rhino.Display.DisplayPipeline.IsActive(Rhino.DocObjects.RhinoObject)
Determines if an object can be visible in this viewport based on it's object type and display attributes.
This test does not check for visibility based on location of the object.
NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility"
tests based on location (is some part of the object in the view frustum).
Use CRhinoDisplayPipeline::IsActive() to perform "visibility"
tests based on object type.
rhinoObject: Object to test.
Returns:
True if this object can be drawn in the pipeline's viewport based on it's object type and display attributes.

Rhino.Display.DisplayPipeline.InterruptDrawing
Tests to see if the pipeline should stop drawing more geometry and just show what it has so far.
If a drawing operation is taking a long time, this function will return true and tell Rhino it should just
finish up and show the frame buffer. This is used in dynamic drawing operations.
Returns:
True if the pipeline should stop attempting to draw more geometry and just show the frame buffer.

Rhino.Display.DisplayPipeline.DrawMeshWires(Rhino.Geometry.Mesh,System.Drawing.Color)
Draw all the wires in a given mesh.
mesh: Mesh for wire drawing.
color: Color of mesh wires.

Rhino.Display.DisplayPipeline.DrawMeshWires(Rhino.Geometry.Mesh,System.Drawing.Color,System.Int32)
Draw all the wires in a given mesh.
mesh: Mesh for wire drawing.
color: Color of mesh wires.
thickness: Thickness (in pixels) of mesh wires.

Rhino.Display.DisplayPipeline.DrawMeshVertices(Rhino.Geometry.Mesh,System.Drawing.Color)
Draw all the vertices in a given mesh.
mesh: Mesh for vertex drawing.
color: Color of mesh vertices.

Rhino.Display.DisplayPipeline.DrawMeshShaded(Rhino.Geometry.Mesh,Rhino.Display.DisplayMaterial)
Draw the shaded faces of a given mesh.
mesh: Mesh to draw.
material: Material to draw faces with.

Rhino.Display.DisplayPipeline.DrawMeshFalseColors(Rhino.Geometry.Mesh)
Draw the mesh faces as False Color patches.
The mesh must have Vertex Colors defined for this to work.
mesh: Mesh to draw.

Rhino.Display.DisplayPipeline.DrawBrepWires(Rhino.Geometry.Brep,System.Drawing.Color)
Draw all the wireframe curves of a Brep object.
brep: Brep to draw.
color: Color of Wireframe curves.

Rhino.Display.DisplayPipeline.DrawBrepWires(Rhino.Geometry.Brep,System.Drawing.Color,System.Int32)
Draw all the wireframe curves of a Brep object.
brep: Brep to draw.
color: Color of Wireframe curves.
wireDensity:
"Density" of wireframe curves.
-1 = no internal wires. 0 = default internal wires.>0 = custom high density.

Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,System.Drawing.Color)
Draw a point with a given radius, style and color.
point: Location of point in world coordinates.
color: Color of point.

Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Int32,System.Drawing.Color)
Draw a point with a given radius, style and color.
point: Location of point in world coordinates.
style: Point display style.
radius: Point size in pixels.
color:
Color of point. If style is ControlPoint, this will be the border color.

Rhino.Display.DisplayPipeline.DrawArrow(Rhino.Geometry.Line,System.Drawing.Color)
Draw a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
line: Arrow shaft.
color: Color of arrow.

Rhino.Display.DisplayPipeline.DrawArrows(Rhino.Geometry.Line[],System.Drawing.Color)
Draw a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
lines: Arrow shafts.
color: Color of arrows.

Rhino.Display.DisplayPipeline.DrawArrows(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Drawing.Color)
Draw a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
lines: Arrow shafts.
color: Color of arrows.

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Line,System.Drawing.Color)
Draw a single line object.
line: Line to draw.
color: Color to draw line in.

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Line,System.Drawing.Color,System.Int32)
Draw a single line object.
line: Line to draw.
color: Color to draw line in.
thickness: Thickness (in pixels) of line.

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color)
Draw a single line object.
from: Line from point.
to: Line to point.
color: Color to draw line in.

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color,System.Int32)
Draw a single line object.
from: Line from point.
to: Line to point.
color: Color to draw line in.
thickness: Thickness (in pixels) of line.

Rhino.Display.DisplayPipeline.DrawDottedLine(Rhino.Geometry.Line,System.Drawing.Color)
Draw a single dotted line.
line: Line to draw.
color: Color of line.

Rhino.Display.DisplayPipeline.DrawDottedLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color)
Draw a single dotted line.
from: Line start point.
to: Line end point.
color: Color of line.

Rhino.Display.DisplayPipeline.DrawDottedPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Boolean)
Draw a set of connected lines (polyline) in a dotted pattern
points: End points of each line segment
color: Color of polyline
close: Draw a line between the first and last points

Rhino.Display.DisplayPipeline.DrawLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Drawing.Color)
Draw a set of lines with a given color and thickness. If you want the fastest possible set of lines
to be drawn, pass a Line[] for lines.
lines: Lines to draw.
color: Color to draw with.

Rhino.Display.DisplayPipeline.DrawLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Drawing.Color,System.Int32)
Draw a set of lines with a given color and thickness. If you want the fastest possible set of lines
to be drawn, pass a Line[] for lines.
lines: Lines to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of lines.

Rhino.Display.DisplayPipeline.DrawPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color)
Draw a single Polyline object.
polyline: Polyline to draw.
color: Color to draw in.

Rhino.Display.DisplayPipeline.DrawPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Int32)
Draw a single Polyline object.
polyline: Polyline to draw.
color: Color to draw in.
thickness: Thickness (in pixels) of the Polyline.

Rhino.Display.DisplayPipeline.DrawPolygon(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Boolean)
Draw a filled polygon.
points:
Collection of world coordinate points that are connected by lines to form a closed shape.
Collection must contain at least 3 points.
color: Color to draw with.
filled:
True if the closed area should be filled with color.
False if you want to draw just the border of the closed shape.

Rhino.Display.DisplayPipeline.DrawDot(System.Int32,System.Int32,System.String,System.Drawing.Color,System.Drawing.Color)
Draw a text dot in screen coordinates.
screenX: X coordinate (in pixels) of dot center.
screenY: Y coordinate (in pixels) of dot center.
text: Text content of dot.
dotColor: Dot background color.
textColor: Dot foreground color.

Rhino.Display.DisplayPipeline.DrawDot(System.Int32,System.Int32,System.String)
Draw a text dot in screen coordinates.
screenX: X coordinate (in pixels) of dot center.
screenY: Y coordinate (in pixels) of dot center.
text: Text content of dot.

Rhino.Display.DisplayPipeline.DrawDot(Rhino.Geometry.Point3d,System.String)
Draw a text dot in world coordinates.
worldPosition: Location of dot in world coordinates.
text: Text content of dot.

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.BoundingBox,System.Drawing.Color)
Draw the edges of a BoundingBox.
box: Box to draw.
color: Color to draw in.

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.BoundingBox,System.Drawing.Color,System.Int32)
Draw the edges of a BoundingBox.
box: Box to draw.
color: Color to draw in.
thickness: Thickness (in pixels) of box edges.

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.Box,System.Drawing.Color)
Draw the edges of a Box object.
box: Box to draw.
color: Color to draw in.

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.Box,System.Drawing.Color,System.Int32)
Draw the edges of a Box object.
box: Box to draw.
color: Color to draw in.
thickness: Thickness (in pixels) of box edges.

Rhino.Display.DisplayPipeline.DrawBoxCorners(Rhino.Geometry.BoundingBox,System.Drawing.Color)
Draw corner widgets of a world aligned boundingbox.
Widget size will be 5% of the Box diagonal.
box: Box to draw.
color: Color to draw with.

Rhino.Display.DisplayPipeline.DrawBoxCorners(Rhino.Geometry.BoundingBox,System.Drawing.Color,System.Double)
Draw corner widgets of a world aligned boundingbox.
box: Box to draw.
color: Color to draw with.
size: Size (in model units) of the corner widgets.

Rhino.Display.DisplayPipeline.DrawBoxCorners(Rhino.Geometry.BoundingBox,System.Drawing.Color,System.Double,System.Int32)
Draw corner widgets of a world aligned boundingbox.
box: Box to draw.
color: Color to draw with.
size: Size (in model units) of the corner widgets.
thickness: Thickness (in pixels) of the corner widgets.

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)
Draw an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Int32)
Draw an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.
thickness: Thickness of arrow widget lines.

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Int32,System.Double)
Draw an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.
thickness: Thickness of arrow widget lines.
size: Size (in pixels) of the arrow shaft.

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Int32,System.Double,System.Double)
Draw an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.
thickness: Thickness of arrow widget lines.
size: Size (in pixels) of the arrow shaft.
rotation: Rotational angle adjustment (in radians, counter-clockwise of direction.

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point2d,System.Boolean)
Draws 2D text on the viewport
text: the string to draw
color: text color
screenCoordinate: definition point in screen coordinates (0,0 is top-left corner)
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point2d,System.Boolean,System.Int32)
Draws 2D text on the viewport
text: the string to draw
color: text color
screenCoordinate: definition point in screen coordinates (0,0 is top-left corner)
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified
height: height in pixels (good default is 12)

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point2d,System.Boolean,System.Int32,System.String)
Draws 2D text on the viewport
text: the string to draw
color: text color
screenCoordinate: definition point in screen coordinates (0,0 is top-left corner)
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified
height: height in pixels (good default is 12)
fontface: font name (good default is "Arial")

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point3d,System.Boolean)
Draws 2D text on the viewport
text: the string to draw
color: text color
worldCoordinate: definition point in world coordinates
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point3d,System.Boolean,System.Int32)
Draws 2D text on the viewport
text: the string to draw
color: text color
worldCoordinate: definition point in world coordinates
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified
height: height in pixels (good default is 12)

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point3d,System.Boolean,System.Int32,System.String)
Draws 2D text on the viewport
text: the string to draw
color: text color
worldCoordinate: definition point in world coordinates
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified
height: height in pixels (good default is 12)
fontface: font name (good default is "Arial")

Rhino.Display.DisplayPipeline.Draw3dText(Rhino.Display.Text3d,System.Drawing.Color,Rhino.Geometry.Plane)
Draw 3d text with a different plane than what is defined in the Text3d class
text:
color:
textPlane:

Rhino.Display.DisplayPipeline.Draw3dText(Rhino.Display.Text3d,System.Drawing.Color,Rhino.Geometry.Point3d)
Draw 3d text using the Text3d plane with an adjusted origin
text:
color:
textPlaneOrigin: