Rhino.Geometry.Point3d.#ctor(System.Double,System.Double,System.Double)
Create a point with defined x,y,z values
x:
y:
z:

Rhino.Geometry.Point3d.Item(System.Int32)
Gets or sets an indexed coordinate of this point.
index:
The coordinate index. Valid values are:
0 = X coordinate1 = Y coordinate2 = Z coordinate

Rhino.Geometry.Point3d.X
Gets or sets the X coordinate of this point.

Rhino.Geometry.Point3d.Y
Gets or sets the Y coordinate of this point.

Rhino.Geometry.Point3d.Z
Gets or sets the Z coordinate of this point.

Rhino.Geometry.Point3d.IsValid
If any coordinate of a point is UnsetValue, then the point is not valid.

Rhino.Geometry.Point3d.MaximumCoordinate
Gets the largest (both positive and negative) coordinate value in this point.

Rhino.Geometry.Point3d.DistanceTo(Rhino.Geometry.Point3d)
Compute the distance between two points.
other: Other point for distance measurement.
Returns: The distance between this point and other.

Rhino.Geometry.Point3d.Transform(Rhino.Geometry.Transform)
Transform the point. The transformation matrix acts on the left of the point
i.e., result = transformation*point
xform: Transformation to apply.

Rhino.Geometry.Point3d.ArePointsCoplanar(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Test if a set of points are coplanar within a certain tolerance
points:
tolerance: A good default is RhinoMath.ZeroTolerance
Returns:

Rhino.Geometry.Point3d.CullDuplicates(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Finds duplicates in the supplied list of points and returns a
new array of points without duplicates.
points:
tolerance:
The minimum distance between points. Points that fall within this
tolerance will be discarded.
Returns: Array of points with duplicates removed, or null on error

Rhino.Geometry.Point3d.SortAndCullPointList(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Sort a list of points so they will be connected in a "reasonable polyline" order. Also remove
points from the list that are closer together than a minimum distance
points: points to sort
minimumDistance: minimum distance to use. Throw out ones closer than this
Returns: new list of sorted points