Rhino.DocObjects.Tables.ViewTable.Document
Document that owns this object table

Rhino.DocObjects.Tables.ViewTable.ActiveView
Gets or Sets the active view

Rhino.DocObjects.Tables.ViewTable.FlashObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Boolean)
Cause objects selection state to change momentarily so the object
appears to flash on the screen
list:
useSelectionColor:
If true, flash between object color and selection color. If false,
flash between visible and invisible

Rhino.DocObjects.Tables.ViewTable.Redraw
Redraws all views
Remarks:
If you change something in the active document -- like adding
objects, deleting objects, modifying layer or object display
attributes, etc., then you need to call CRhinoDoc::Redraw to
redraw all the views.
If you change something in a particular view like the projection,
construction plane, background bitmap, etc., then you need to
call CRhinoView::Redraw to redraw that particular view.

Rhino.DocObjects.Tables.ViewTable.GetViewList(System.Boolean,System.Boolean)
Gets an array of all the views
includeStandardViews:
includePageViews:
Returns:

Rhino.DocObjects.Tables.ViewTable.Find(System.Guid)
Find a view in this document with a given main viewport Id
mainViewportId:
Returns: View on success. null if no view could be found in this document

Rhino.DocObjects.Tables.ViewTable.Find(System.String,System.Boolean)
Find a view in this document with a main viewport that has a given name. Note that there
may be multiple views in this document that have the same name. This function only returns
the first view found. If you want to find all the views with a given name, use the GetViewList
function and iterate through the views
mainViewportName:
compareCase:
Returns:

Rhino.DocObjects.Tables.ViewTable.AddPageView(System.String)
Create a new page view with a given title
title:
If null or empty, a name will be generated as "Page #" where # is the largest page number
Returns: newly created page view on success. Null on error

Rhino.DocObjects.Tables.ViewTable.AddPageView(System.String,System.Double,System.Double)
Create a new page view with a given title and size
title:
If null or empty, a name will be generated as "Page #" where # is the largest page number
pageWidth:
pageHeight:
Returns: newly created page view on success. Null on error