Rhino.DocObjects.Layer.Name
The name of this layer

Rhino.DocObjects.Layer.LayerIndex
Gets the index of this layer.

Rhino.DocObjects.Layer.Id
Gets the ID of this layer object.

Rhino.DocObjects.Layer.IgesLevel
Gets the IGES level for this layer.

Rhino.DocObjects.Layer.Color
Gets the display color for this layer.

Rhino.DocObjects.Layer.PlotColor
Gets the plot color for this layer.

Rhino.DocObjects.Layer.PlotWeight
Gets the thickness of the plotting pen in millimeters.
A thickness of 0.0 indicates the "default" pen weight should be used.

Rhino.DocObjects.Layer.LinetypeIndex
Gets the line-type index for this layer.

Rhino.DocObjects.Layer.RenderMaterialIndex
Gets the index of render material for objects on this layer that have
MaterialSource() == MaterialFromLayer.
A material index of -1 indicates no material has been assigned
and the material created by the default Material constructor
should be used.

Rhino.DocObjects.Layer.IsVisible
Gets the visibility of this layer.

Rhino.DocObjects.Layer.IsLocked
Gets a value indicating the locked state of this layer.

Rhino.DocObjects.Layer.IsExpanded
Gets a value indicating whether this layer is expanded in the Rhino Layer dialog.

Rhino.DocObjects.Layer.SortIndex
Runtime index used to sort layers in layer dialog

Rhino.DocObjects.Layer.GetDefaultLayerProperties
Creates a Layer with the current default layer properties.
The default layer properties are:
color = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColor
line style = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerLineStyle
material index = -1
iges level = -1
mode = NormalLayer
name = empty
layer index = 0 (ignored by AddLayer)
Returns:

Rhino.DocObjects.Layer.Default
Set layer to default settings

Rhino.DocObjects.Layer.IsValidName(System.String)
Determine if a given string is valid for a layer name
name:
Returns:

Rhino.DocObjects.Layer.GetChildren
Get immediate children of this layer. Note that child layers may have their own children
Returns: Array of child layers. null if this layer does not have any children