Rhino.Input.Custom.GetBaseClass.SetCommandPrompt(System.String)
Set prompt message that appears in the command prompt window.
prompt: command prompt message

Rhino.Input.Custom.GetBaseClass.SetCommandPromptDefault(System.String)
Set message that describes what default value will be used if the user presses enter.
This description appears in angle brackets <> in the command prompt window. You do
not need to provide a default value description unless you explicity enable AcceptNothing.
defaultValue: description of default value
ON_3dPoint default_center = new ON_3dPoint(2,3,4);
GetPoint gp = new GetPoint();
gp.SetCommandPrompt( "Center point" );
gp.SetCommandPromptDefault( "(2,3,4)" );
gp.AcceptNothing(true);
gp.GetPoint();
if ( gp.Result() == GetResult.Nothing )
point = default_center;
Remarks:
If you have a simple default point, number, or string, it is easier to use SetDefaultPoint,
SetDefaultNumber, or SetDefaultString. SetCommandPromptDefault and AcceptNothing can be used
for providing more advanced UI behavior.

Rhino.Input.Custom.GetBaseClass.SetDefaultPoint(Rhino.Geometry.Point3d)
Set a point as default value that will be returned if the user presses the ENTER key during the get.
point: value for default point
Remarks:
Calling SetDefaultPoint will automatically handle setting the command prompt default and reacting to
the user pressing ENTER.  If the user presses enter to accept the default point, GetResult.Point is
returned and RhinoGet.GotDefault() will return true. Calling SetDefaultPoint will clear any previous
calls to SetDefaultString or SetDefaultNumber.

Rhino.Input.Custom.GetBaseClass.SetDefaultNumber(System.Double)
Set a number as default value that will be returned if the user presses ENTER key during the get.
defaultNumber: value for default number
Remarks:
Calling SetDefaultNumber will automatically handle setting the command prompt default and
reacting to the user pressing ENTER. If the user presses ENTER to accept the default number,
GetResult.Number is returned and RhinoGet.GotDefault() will return true. Calling
SetDefaultNumber will clear any previous calls to SetDefaultString or SetDefaultPoint.

Rhino.Input.Custom.GetBaseClass.SetDefaultInteger(System.Int32)
Set a number as default value that will be returned if the user presses ENTER key during the get.
defaultValue: value for default number
Remarks:
Calling SetDefaultInteger will automatically handle setting the command prompt default and
reacting to the user pressing ENTER. If the user presses ENTER to accept the default integer,
GetResult.Number is returned and CRhinoGet.GotDefault() will return true. Calling
SetDefaultNumber will clear any previous calls to SetDefaultString or SetDefaultPoint.

Rhino.Input.Custom.GetBaseClass.SetDefaultString(System.String)
Set a string as default value that will be returned
if the user presses ENTER key during the get.
defaultValue: value for default string
Remarks:
Calling SetDefaultString will automatically handle setting the command prompt
default and reacting to the user pressing ENTER. If the user presses ENTER to
accept the default string, GetResult.String is returned and RhinoGet.GotDefault()
will return true. Calling SetDefaultString will clear any previous calls to
SetDefaultNumber or SetDefaultPoint.

Rhino.Input.Custom.GetBaseClass.SetDefaultColor(System.Drawing.Color)
Set a color as default value that will be returned if the user presses ENTER key during the get.
defaultColor: value for default color
Remarks:
Calling SetDefaultColor will automatically handle setting the command prompt default and
reacting to the user pressing ENTER.  If the user presses ENTER to accept the default color,
GetResult.Color is returned and RhinoGet.GotDefault() will return true. Calling
SetDefaultColor will clear any previous calls to SetDefaultString or SetDefaultPoint.

Rhino.Input.Custom.GetBaseClass.SetWaitDuration(System.Int32)
Set the wait duration (in milliseconds) of the getter. If the duration passes without
the user making a decision, the GetResult.Timeout code is returned.
milliseconds: Number of milliseconds to wait.

Rhino.Input.Custom.GetBaseClass.ClearDefault
Clears any defaults set using SetDefaultPoint, SetDefaultNumber, SetDefaultString, or SetCommandPromptDefault

Rhino.Input.Custom.GetBaseClass.GotDefault
returns true if user pressed ENTER to accept a default point, number,
or string set using SetDefaultPoint, SetDefaultNumber, or SetDefaultString.
Returns:

Rhino.Input.Custom.GetBaseClass.AddOption(System.String)
Add a command line option
englishOption:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
Returns:
option index value (>0) or 0 if option cannot be added

Rhino.Input.Custom.GetBaseClass.AddOption(System.String,System.String)
Add a command line option
englishOption:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
englishOptionValue:
Returns:
option index value (>0) or 0 if option cannot be added

Rhino.Input.Custom.GetBaseClass.AddOptionDouble(System.String,Rhino.Input.Custom.OptionDouble@,System.String)
Add a command line option to get numbers and automatically save the value
englishName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
numberValue:
prompt:
option prompt shown if the user selects this option.  If null or empty, then the
option name is used as the get number prompt.
Returns:
option index value (>0) or 0 if option cannot be added

Rhino.Input.Custom.GetBaseClass.AddOptionDouble(System.String,Rhino.Input.Custom.OptionDouble@)
Add a command line option to get numbers and automatically save the value
englishName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
numberValue:
Returns:
option index value (>0) or 0 if option cannot be added

Rhino.Input.Custom.GetBaseClass.AddOptionInteger(System.String,Rhino.Input.Custom.OptionInteger@,System.String)
Add a command line option to get integers and automatically save the value
englishName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
intValue:
prompt:
option prompt shown if the user selects this option.  If null or empty, then the
option name is used as the get number prompt.
Returns:
option index value (>0) or 0 if option cannot be added

Rhino.Input.Custom.GetBaseClass.AddOptionInteger(System.String,Rhino.Input.Custom.OptionInteger@)
Add a command line option to get integers and automatically save the value
englishName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
intValue:
Returns:
option index value (>0) or 0 if option cannot be added

Rhino.Input.Custom.GetBaseClass.AddOptionToggle(System.String,Rhino.Input.Custom.OptionToggle@)
Add a command line option to toggle a setting
englishName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
toggleValue:
Returns: option index value (>0) or 0 if option cannot be added

Rhino.Input.Custom.GetBaseClass.AddOptionList(System.String,System.Collections.Generic.IEnumerable{System.String},System.Int32)
Add a command line list option
englishOptionName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
listValues:
listCurrentIndex: zero based index of current option
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.ClearCommandOptions
Clear all command options

Rhino.Input.Custom.GetBaseClass.AcceptNothing(System.Boolean)
If you want to allow the user to be able to press enter in order to
skip selecting a something in GetPoint.Get(), GetObject::GetObjects(),
etc., then call AcceptNothing( true ) beforehand.
enable:

Rhino.Input.Custom.GetBaseClass.AcceptUndo(System.Boolean)
If you want to allow the user to have an undo option in GetPoint.Get(),
GetObject.GetObjects(), etc., then call AcceptUndo(true) beforehand.
enable:

Rhino.Input.Custom.GetBaseClass.AcceptNumber(System.Boolean,System.Boolean)
If you want to allow the user to be able to type in a number during GetPoint.Get(),
GetObject::GetObjects(), etc., then call AcceptNumber() beforehand.
If the user chooses to type in a number, then the result code GetResult.Number is
returned and you can use RhinoGet.Number() to get the value of the number. If you
are using GetPoint and you want "0" to return (0,0,0) instead of the number zero,
then set acceptZero = false.
enable:
acceptZero:
If you are using GetPoint and you want "0" to return (0,0,0) instead of the number zero,
then set acceptZero = false.

Rhino.Input.Custom.GetBaseClass.AcceptPoint(System.Boolean)
If you want to allow the user to be able to type in a point then call AcceptPoint(true)
before calling GetPoint()/GetObject(). If the user chooses to type in a number, then
the result code GetResult.Point is returned and you can use RhinoGet.Point()
to get the value of the point.
enable:

Rhino.Input.Custom.GetBaseClass.AcceptColor(System.Boolean)
If you want to allow the user to be able to type in a color r,g,b or name
during GetPoint.Get(), GetObject::GetObjects(), etc., then call AcceptColor(true)
before calling GetPoint()/GetObject(). If the user chooses to type in a color,
then the result code GetResult.Color is returned and you can use RhinoGet.Color()
to get the value of the color.  If the get accepts points, then the user will not
be able to type in r,g,b colors but will be able to type color names.
enable:

Rhino.Input.Custom.GetBaseClass.AcceptString(System.Boolean)
If you want to allow the user to be able to type in a string during GetPoint.Get(),
GetObject::GetObjects(), etc., then call AcceptString(true) before calling
GetPoint()/GetObject(). If the user chooses to type in a string, then the result code
GetResult.String is returned and you can use RhinoGet.String() to get the value of the string.
enable:

Rhino.Input.Custom.GetBaseClass.Result
returns result of the Get*() call
Returns:

Rhino.Input.Custom.GetBaseClass.CommandResult
Handy tool for getting command result value from getter results
Returns:

Rhino.Input.Custom.GetBaseClass.Number
Used to get number if GetPoint.Get(), GetObject.GetObjects(), etc., returns GetResult.Number
Returns:

Rhino.Input.Custom.GetBaseClass.StringResult
Used to get string if GetPoint.Get(), GetObject.GetObjects(), etc., returns GetResult.String
Returns:

Rhino.Input.Custom.GetBaseClass.Point
Used to get point if Get*() returns GetResult.Point
Returns:

Rhino.Input.Custom.GetBaseClass.Vector
Used to get direction if Get*() returns GetResult.Point (Set by some digitizers, but in general it's (0,0,0)
Returns:

Rhino.Input.Custom.GetBaseClass.Color
Used to get color if Get*() returns GetResult.Color
Returns:

Rhino.Input.Custom.GetBaseClass.View
Used to get view user clicked in during GetPoint.Get(), GetObject.GetObjects(), etc.
Returns:

Rhino.Input.Custom.GetBaseClass.PickRectangle
If the get was a GetObjects() and the mouse was used to select the objects,
then the returned rect has left < right and top < bottom. This rect
is the Windows GDI screen coordinates of the picking rectangle.
RhinoViewport.GetPickXform( pick_rect, pick_xform )
will calculate the picking transformation that was used.
In all other cases, left=right=top=bottom=0;
Returns:

Rhino.Input.Custom.GetBaseClass.Point2d
Returns location in view of point in selected in GetPoint::Get() or GetPoint::Get2dPoint().
(0,0) = upper left corner of window
Returns:

Rhino.Input.Custom.GetBaseClass.Rectangle2d
Returns location in view of 2d rectangle selected in GetPoint::Get2dRectangle().
rect.left < rect.right and rect.top < rect.bottom
(0,0) = upper left corner of window
Returns:

Rhino.Input.Custom.GetBaseClass.Line2d
Returns two points defining location in view window of 2d line selected
in GetPoint::Get2dLine().
(0,0) = upper left corner of window
Returns: