Rhino.Geometry.GeometryBase.IsDocumentControlled
If true this object may not be modified. Any properties or functions that attempt
to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException

Rhino.Geometry.GeometryBase.IsDeformable
True if object can be accurately modified with "squishy" transformations like
projections, shears, and non-uniform scaling.

Rhino.Geometry.GeometryBase.Transform(Rhino.Geometry.Transform)
Transforms the geometry. If the input Transform has a SimilarityType of
OrientationReversing, you may want to consider flipping the transformed
geometry after calling this function when it makes sense. For example,
you may want to call Flip() on a Brep after transforming it.
xform:
Transformation to apply to geometry.
Returns:

Rhino.Geometry.GeometryBase.Translate(Rhino.Geometry.Vector3d)
Translates the object along the specified vector.
translationVector:
Returns: true if geometry successfully translated

Rhino.Geometry.GeometryBase.Translate(System.Double,System.Double,System.Double)
Translates the object along the specified vector.
x:
y:
z:
Returns: true if geometry successfully translated

Rhino.Geometry.GeometryBase.Scale(System.Double)
Scales the object by the specified factor. The scale is centered at the origin.
scaleFactor:
Returns: true if geometry successfully scaled

Rhino.Geometry.GeometryBase.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotates the object about the specified axis. A positive rotation
angle results in a counter-clockwise rotation about the axis (right hand rule).
angleRadians: angle of rotation in radians
rotationAxis: direction of the axis of rotation
rotationCenter: point on the axis of rotation
Returns: true if geometry successfully rotated

Rhino.Geometry.GeometryBase.GetBoundingBox(System.Boolean)
Boundingbox solver. Gets the world axis aligned boundingbox for the geometry.
accurate: If True, a physically accurate boundingbox will be computed.
If not, a boundingbox estimate will be computed. For some geometry types there is no
difference between the estimate and the accurate boundingbox. Estimated boundingboxes
can be computed much (much) faster than accurate (or "tight") bounding boxes.
Estimated bounding boxes are always similar to or larger than accurate bounding boxes.
Returns: The boundingbox of the geometry in world coordinates or BoundingBox.Empty
if not bounding box could be found.

Rhino.Geometry.GeometryBase.MakeDeformable
If possible, converts the object into a form that can be accurately modified
with "squishy" transformations like projections, shears, an non-uniform scaling.
Returns:
False if object cannot be converted to a deformable object. True if object was
already deformable or was converted into a deformable object.

Rhino.Geometry.GeometryBase.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry
key: id used to retrieve this string
value: string associated with key
Returns: true on success

Rhino.Geometry.GeometryBase.GetUserString(System.String)
Get user string from this geometry
key: id used to retrieve the string
Returns: string associated with the key if successful. null if no key was found

Rhino.Geometry.GeometryBase.GetUserStrings
Get all (key, value) user strings attached to this geometry
Returns: