Rhino.DocObjects.HatchPattern.Index
Index in the hatch pattern table for this pattern. -1 if not in the table

Rhino.DocObjects.HatchPattern.ReadFromFile(System.String,System.Boolean)
Read hatch pattern definitions from a file
filename:
Name of an existing file. If filename is null or emtpty, default hatch pattern filename is used
quiet:
If file doesn't exist, and quiet is false, an error meesage box is shown.
Returns: