Rhino.Geometry.BoundingBox
Represents a world aligned boundingbox defined by the two extreme corner points.

Rhino.Geometry.BoundingBox.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Create a new boundingbox from two corner points.
min: Point containing all the minimum coordinates.
max: Point containing all the maximum coordinates.

Rhino.Geometry.BoundingBox.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Create a boundingbox from numeric extremes.
minX: Lower extreme for box X size.
minY: Lower extreme for box Y size.
minZ: Lower extreme for box Z size.
maxX: Upper extreme for box X size.
maxY: Upper extreme for box Y size.
maxZ: Upper extreme for box Z size.

Rhino.Geometry.BoundingBox.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Create a boundingbox from a collection of points.
points: Points to include in the boundingbox.

Rhino.Geometry.BoundingBox.PointAt(System.Double,System.Double,System.Double)
Evaluate the box with normalized parameters.
tx: Normalized parameter along the x-direction.
ty: Normalized parameter along the y-direction.
tz: Normalized parameter along the z-direction.
Returns: The point at the {tx, ty, tz} parameters.

Rhino.Geometry.BoundingBox.ClosestPoint(Rhino.Geometry.Point3d)
Find the closest point on or in the Box.
point: Sample point.
Returns: The point on or in the box that is closest to the sample point.

Rhino.Geometry.BoundingBox.ClosestPoint(Rhino.Geometry.Point3d,System.Boolean)
Find the closest point on or in the Box.
point: Sample point.
includeInterior: If False, the point is projected onto the boundary faces only,
otherwise the interior of the box is also taken into consideration.
Returns: The point on or in the box that is closest to the sample point.

Rhino.Geometry.BoundingBox.FurthestPoint(Rhino.Geometry.Point3d)
Find the furthest point on the Box.
point: Sample point.
Returns: The point on the box that is furthest from the sample point.

Rhino.Geometry.BoundingBox.Inflate(System.Double)
Inflate the box with equal amounts in all directions.
Inflating with negative amounts may result in decreasing boxes.
InValid boxes can not be inflated.
amount: Amount (in model units) to inflate this box in all directions.

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.Point3d)
Test a point for BoundingBox inclusion. This is the same as calling Contains(point, false)
point: Point to test.
Returns: True if the point is on the inside of or coincident with this BoundingBox.

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.Point3d,System.Boolean)
Test a point for BoundingBox inclusion.
point: Point to test.
strict: If true, the point needs to be fully on the inside of the BoundingBox.
I.e. coincident points will be considered 'outside'.
Returns: True if the point is (strictly) on the inside of this BoundingBox.

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.BoundingBox)
Test a box for BoundingBox inclusion. This is the same as calling Contains(box,false)
box: Box to test.
Returns: True if the box is on the inside of or coincident with this BoundingBox.

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.BoundingBox,System.Boolean)
Test a box for BoundingBox inclusion.
box: Box to test.
strict: If true, the box needs to be fully on the inside of the BoundingBox.
I.e. coincident boxes will be considered 'outside'.
Returns: True if the box is (strictly) on the inside of this BoundingBox.

Rhino.Geometry.BoundingBox.MakeValid
Ensure the box is defined in an increasing fashion along x, y and z axes.
If the Min or Max points are unset, this function will not change the box.
Returns: True if the box was made valid, False if the box could not be made valid.

Rhino.Geometry.BoundingBox.GetCorners
Gets an array of the 8 corner points of this box.
Returns: An array of 8 corners.

Rhino.Geometry.BoundingBox.GetEdges
Gets an array of the 12 edges of this box
Returns:

Rhino.Geometry.BoundingBox.ToBrep
Create a Brep representation of this BoundingBox.
Returns: A Brep representation of this box or null.

Rhino.Geometry.BoundingBox.Intersection(Rhino.Geometry.BoundingBox,Rhino.Geometry.BoundingBox)
Computes the intersection of two bounding boxes
a:
b:
Returns: