Rhino.ApplicationSettings.AppearanceSettings.PageviewPaperColor
CRhinoPageView paper background. A rectangle is drawn into the background
of page views to represent the printed area. The alpha portion of the color
is used to draw the paper blended into the background

Rhino.ApplicationSettings.AppearanceSettings.CurrentLayerBackgroundColor
color used by the layer manager dialog as the background color for the current layer.