Rhino.Input.Custom.GetObject.GeometryFilter
The geometry type filter controls which types of geometry
(points, curves, surfaces, meshes, etc.) can be selected.
The default geometry type filter permits selection of all
types of geometry.
NOTE: the filter can be a bitwise combination of multiple ObjectTypes

Rhino.Input.Custom.GetObject.DeselectAllBeforePostSelect
True if pre-selected input will be deselected before
post-selection begins when no pre-selected input is valid.

Rhino.Input.Custom.GetObject.ReferenceObjectSelect
By default, reference objects can be selected. If you do not want to be
able to select reference objects, then call EnableReferenceObjectSelect=false

Rhino.Input.Custom.GetObject.AlreadySelectedObjectSelect
Allow selecting objects that are already selected. By default, GetObjects() disallows
selection of objects that are already selected to avoid putting the same object
in the selection set more than once. Calling EnableAlreadySelectedObjectSelect = true
overrides that restriction and allows selected objects to be selected and
returned by GetObjects. This is useful because, coupled with the return immediately
mode of GetObjects( 1, -1), it is possible to select a selected object to deselect
when the selected objects are being managed outside GetObjects() as in the case of
CRhinoPolyEdge::GetEdge().

Rhino.Input.Custom.GetObject.CustomGeometryFilter(Rhino.DocObjects.RhinoObject,Rhino.Geometry.GeometryBase,Rhino.Geometry.ComponentIndex)
Checks geometry to see if it can be selected.
Override to provide fancy filtering.
rhObject: parent object being considered
geometry: geometry being considered
componentIndex:
if >= 0, geometry is a proper sub-part of object->Geometry() with componentIndex
Returns: The default always returns true

Rhino.Input.Custom.GetObject.PassesGeometryAttributeFilter(Rhino.DocObjects.RhinoObject,Rhino.Geometry.GeometryBase,Rhino.Geometry.ComponentIndex)
Checks geometry to see if it passes the basic GeometryAttributeFilter.
rhObject: parent object being considered
geometry: geometry being considered
componentIndex: if >= 0, geometry is a proper sub-part of object->Geometry() with componentIndex.
Returns:
true if the geometry passes the filter returned by GeometryAttributeFilter().

Rhino.Input.Custom.GetObject.EnablePreSelect(System.Boolean,System.Boolean)
Control the pre selection behavior GetObjects.
enable: if true, pre-selection is enabled
ignoreUnacceptablePreselectedObjects:
If true and some acceptable objects are pre-selected, then any unacceptable
pre-selected objects are ignored. If false and any unacceptable are pre-selected,
then the user is forced to post-select.
Remarks:
By default, if valid input is pre-selected when GetObjects() is called, then that input
is returned and the user is not given the opportunity to post-select. If you want
to force the user to post-select, then call EnablePreSelect(false).

Rhino.Input.Custom.GetObject.EnableSelPrevious(System.Boolean)
By default, any object selected during a command becomes part of the
"previous selection set" and can be reselected by the SelPrev command.
If you need to select objects but do not want them to be selected by
a subsquent call to SelPrev, then call EnableSelPrev = false

Rhino.Input.Custom.GetObject.EnableHighlight(System.Boolean)
By default, any object post-pick selected by GetObjects() is highlighted.
If you want to post-pick objects and not have them automatically highlight,
then call EnableHighlight = false

Rhino.Input.Custom.GetObject.SetPressEnterWhenDonePrompt(System.String)
The default prompt when EnablePressEnterWhenDonePrompt is enabled is "Press Enter
when done". Use this function to specify a different string to be appended.
prompt:

Rhino.Input.Custom.GetObject.Get
Call to select a single object
Returns:
Success - objects selected.
Cancel - user pressed ESCAPE to cancel the get.
See GetResults for other possible values that may be returned when options, numbers,
etc., are acceptable responses.

Rhino.Input.Custom.GetObject.EnableClearObjectsOnEntry(System.Boolean)
By default the picked object list is cleared when GetObject.GetObjects() is called.
If you are reusing a GetObject class and do not want the existing object list
cleared when you call Input, then call EnableClearObjectsOnEntry(false) before
calling GetObjects().
enable:

Rhino.Input.Custom.GetObject.EnableUnselectObjectsOnExit(System.Boolean)
By default any objects in the object list are unselected when GetObject.GetObjects()
exits with any return code besides Object. If you want to leave the objects
selected when non-object input is returned, then call EnableClearObjectsOnExit(false)
before calling GetObjects().
enable: