Rhino.FileIO.BinaryArchiveWriter.Archive3dmVersion
If a 3dm archive is being read or written, then this is the
version of the 3dm archive format (1, 2, 3, 4 or 5).
0     a 3dm archive is not being read/written
1     a version 1 3dm archive is being read/written
2     a version 2 3dm archive is being read/written
3     a version 3 3dm archive is being read/written
4     a version 4 3dm archive is being read/written
5     an old version 5 3dm archive is being read
50    a version 5 3dm archive is being read/written

Rhino.FileIO.BinaryArchiveWriter.Write3dmChunkVersion(System.Int32,System.Int32)
A chunk version is a single byte that encodes a major.minor
version number.  Useful when creating I/O code for 3dm chunks
that may change in the future.  Increment the minor version
number if new information is added to the end of the chunk.
Increment the major version if the format of the chunk changes
in some other way.
major: 0 to 15
minor: 0 to 16
Returns: true on successful read