Rhino.Display.Text3d.#ctor(System.String)
Create a new instance of Text3d.
text: Text string.

Rhino.Display.Text3d.#ctor(System.String,Rhino.Geometry.Plane,System.Double)
Create a new instance of Text3d.
text: Text string.
plane: 3D Plane for text.
height: Height (in units) for text.