Rhino.Geometry.SpaceMorph.QuickPreview
True if the morph should be done as quickly as possible because the result
is being used for some type of dynamic preview. If QuickPreview is true,
the tolerance may be ignored.
The QuickPreview value does not affect the way meshes and points are morphed.
The default is false.

Rhino.Geometry.SpaceMorph.PreserveStructure
True if the morph should be done in a way that preserves the structure of the geometry.
In particular, for NURBS objects, true means that only the control points are moved.
The PreserveStructure value does not affect the way meshes and points are morphed.
The default is false.

Rhino.Geometry.SpaceMorph.Morph(Rhino.Geometry.GeometryBase)
Apply the space morph to geometry
geometry:
Returns: true on success, false on failure

Rhino.Geometry.SpaceMorph.IsMorphable(Rhino.Geometry.GeometryBase)
True if the geometry can be morphed by calling SpaceMorph.Morph(geometry)

Rhino.Geometry.SpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs euclidean point
point:
Returns: morphed point