Rhino.Runtime.CommonObject
Base class for .NET classes that wrap C++ unmanaged Rhino classes

Rhino.Runtime.CommonObject.IsDocumentControlled
If true this object may not be modified. Any properties or functions that attempt
to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException

Rhino.Runtime.CommonObject.ReleaseNonConstPointer
Used for "temporary" wrapping of objects that we don't want .NET to destruct
on disposal