Rhino.DocObjects.Tables.StringTable.Document
Document that owns this object table

Rhino.DocObjects.Tables.StringTable.Count
The number of user data strings in the current document

Rhino.DocObjects.Tables.StringTable.GetValue(System.String,System.String)
Get a user data string from the document
section:
entry:
Returns:

Rhino.DocObjects.Tables.StringTable.GetSectionNames
Return list of all the section names for user data strings in the document.
By default a section name is a key that is prefixed with a string separated by a backslash
Returns:

Rhino.DocObjects.Tables.StringTable.GetEntryNames(System.String)
Return list of all entry names for a given section of user data strings in the document
section:
Returns:

Rhino.DocObjects.Tables.StringTable.SetString(System.String,System.String,System.String)
Adds or sets a user data string to the document. This string is the same string set when using RhinoScript or IronPython
section:
entry:
value:
Returns:
the previous value if successful and a previous value existed

Rhino.DocObjects.Tables.StringTable.Delete(System.String,System.String)
Removes user data strings from the document
section: name of section to delete. If null, all sections will be deleted
entry: name of entry to delete. If null, all entries will be deleted for a given section
Returns: true or false indicating success or failure