Rhino.DocObjects.RhinoObject
RhinoObjects should only ever be creatable by the RhinoDoc

Rhino.DocObjects.RhinoObject.NextRuntimeSerialNumber
Get the runtime serial number that will be assigned to
the next Rhino Object that is created.

Rhino.DocObjects.RhinoObject.Document
Gets the document that owns this object

Rhino.DocObjects.RhinoObject.Geometry
All rhino objects are composed of geometry and attributes.
Get the underlying geometry for this object

Rhino.DocObjects.RhinoObject.IsDeleted
true if the object is deleted. Deleted objects are kept by the document
for undo purposes. Call RhinoDoc.UndeleteObject to undelete an object

Rhino.DocObjects.RhinoObject.IsReference
Determine if an object is a reference object. An object from a work session
reference model is a reference object and cannot be modified. An object is
a reference object if, and only if, it is on a reference layer.

Rhino.DocObjects.RhinoObject.Visible
object visibility

Rhino.DocObjects.RhinoObject.Id
Every object has a UUID (universally unique identifier). The default value is Guid.Empty.
When an object is added to a model, the value is checked.  If the value is Guid.Empty, a
new UUID is created. If the value is not NULL but it is already used by another object
in the model, a new UUID is created. If the value is not Guid.Empty and it is not used by
another object in the model, then that value persists. When an object is updated, by
a move for example, the value of ObjectId persists.

Rhino.DocObjects.RhinoObject.GroupCount
number of groups object belongs to

Rhino.DocObjects.RhinoObject.GripsOn
State of object's default editing grips

Rhino.DocObjects.RhinoObject.GripsSelected
True if grips are turned on and at least one is selected

Rhino.DocObjects.RhinoObject.CommitChanges
Moves changes made to this RhinoObject into the RhinoDoc
Returns:
true if changes were made

Rhino.DocObjects.RhinoObject.GetGroupList
Returns an array of GroupCount group indices.  If GroupCount is zero, then GetGroupList() returns null.
Returns:

Rhino.DocObjects.RhinoObject.IsSelected(System.Boolean)
Check selection state
checkSubObjects:
(false is good default)
If true and the entire object is not selected, and some subset of the object
is selected, like some edges of a surface, then 3 is returned.
If false and the entire object is not selected, then zero is returned.
Returns:
0 = object is not selected.
1 = object is selected.
2 = entire object is selected persistently.
3 = one or more proper sub-objects are selected.

Rhino.DocObjects.RhinoObject.IsSubObjectSelected(Rhino.Geometry.ComponentIndex)
Check sub-object selection state
componentIndex: index of subobject to check
Returns:
Remarks: subobject cannot be persistently selected

Rhino.DocObjects.RhinoObject.GetSelectedSubObjects
Get a list of all selected sub-objects
Returns:

Rhino.DocObjects.RhinoObject.IsSelectable(System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Reports if an object can be selected
ignoreSelectionState:
If true, then selected objects are selectable.
If false, then selected objects are not selectable.
ignoreGripsState:
If true, then objects with grips on can be selected.
If false, then the value returned by the object's IsSelectableWithGripsOn() function decides if the object can be selected.
ignoreLayerLocking:
If true, then objects on locked layers are selectable.
If false, then objects on locked layers are not selectable.
ignoreLayerVisibility:
If true, then objects on hidden layers are selectable.
If false, then objects on hidden layers are not selectable.
Returns: true if object is capable of being selected
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.IsSelectable
Reports if an object can be selected
Returns: true if object is capable of being selected
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.IsSubObjectSelectable(Rhino.Geometry.ComponentIndex,System.Boolean)
Reports if a subobject can be selected
componentIndex: index of subobject to check
ignoreSelectionState:
If true, then selected objects are selectable.
If false, then selected objects are not selectable.
Returns:
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.Select(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Reports if an object can be selected
on:
syncHighlight:
If true, then the object is hightlighted if it is selected
and not hightlighted if is is not selected.
persistentSelect:
Objects that are persistently selected stay selected when a command terminates.
ignoreGripsState:
If true, then objects with grips on can be selected.
If false, then the value returned by the object's IsSelectableWithGripsOn() function
decides if the object can be selected when it has grips turned on.
ignoreLayerLocking:
If true, then objects on locked layers can be selected.
If false, then objects on locked layers cannot be selected.
ignoreLayerVisibility:
If true, then objects on hidden layers can be selectable.
If false, then objects on hidden layers cannot be selected.
Returns:
0: object is not selected
1: object is selected
2: object is selected persistently
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.Select(System.Boolean)
Reports if an object can be selected
on:
Returns:
0: object is not selected
1: object is selected
2: object is selected persistently
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.Select(System.Boolean,System.Boolean)
Reports if an object can be selected
on:
syncHighlight:
If true, then the object is hightlighted if it is selected
and not hightlighted if is is not selected.
Returns:
0: object is not selected
1: object is selected
2: object is selected persistently
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.SelectSubObject(Rhino.Geometry.ComponentIndex,System.Boolean,System.Boolean)
Reports if an object can be selected
componentIndex: index of subobject to check
select:
syncHighlight:
(default=true)
If true, then the object is hightlighted if it is selected
and not hightlighted if is is not selected.
Returns:
0: object is not selected
1: object is selected
2: object is selected persistently
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.UnselectAllSubObjects
Returns number of unselected subobjects
Returns:

Rhino.DocObjects.RhinoObject.IsHighlighted(System.Boolean)
Check highlight state
checkSubObjects:
If true and the entire object is not highlighted, and some subset of the object
is highlighted, like some edges of a surface, then 3 is returned.
If false and the entire object is not highlighted, then zero is returned.
Returns:
0 object is not highlighted
1 entire object is highlighted
3 one or more proper sub-objects are highlighted

Rhino.DocObjects.RhinoObject.GetHighlightedSubObjects
Get a list of all highlighted sub-objects
Returns:

Rhino.DocObjects.RhinoObject.UnhighlightAllSubObjects
Returns number of changed subobjects
Returns:

Rhino.DocObjects.RhinoObject.GetGrips
Returns grips for this object IF grips are enabled. If grips are not
enabled, returns null.
Returns:

Rhino.DocObjects.RhinoObject.ShortDescription(System.Boolean)
Localized short description os an object
plural:
Returns: