Rhino.Geometry.Collections.BrepFaceList.ShrinkFaces
Shrink all the faces in this Brep. Sometimes the surfaces extend far beyond the trimming
boundaries of the Brep Face. This function will remove those portions of the surfaces
that are not used.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.BrepFaceList.SplitKinkyFaces
Split any faces with creases into G1 pieces.
Returns: True on success, false on failure.
Remarks: If you need to detect whether splitting occured,
compare the before and after values of Faces.Count

Rhino.Geometry.Collections.BrepFaceList.SplitKinkyFaces(System.Double)
Split any faces with creases into G1 pieces.
kinkTolerance: Tolerance (in radians) to use for crease detection.
Returns: True on success, false on failure.
Remarks: If you need to detect whether splitting occured,
compare the before and after values of Faces.Count

Rhino.Geometry.Collections.BrepFaceList.SplitKinkyFaces(System.Double,System.Boolean)
Split any faces with creases into G1 pieces.
kinkTolerance: Tolerance (in radians) to use for crease detection.
compact: If true, the Brep will be compacted if possible.
Returns: True on success, false on failure.
Remarks: If you need to detect whether splitting occured,
compare the before and after values of Faces.Count