Rhino.Geometry.BrepFace
A Brep face is composed of one surface and trimming curves

Rhino.Geometry.BrepFace.OrientationIsReversed
True if face orientation is opposite of natural surface orientation.

Rhino.Geometry.BrepFace.SetDomain(System.Int32,Rhino.Geometry.Interval)
Set the surface domain of this Face.
direction: Direction of face to set (0 = U, 1 = V).
domain: Domain to apply.
Returns: True on success, false on failure.

Rhino.Geometry.BrepFace.DuplicateSurface
Get a copy to the untrimmed surface that this face is based on.
Returns: A copy of this face's underlying surface.

Rhino.Geometry.BrepFace.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Split this face using 3D trimming curves.
curves: Curves to split with.
tolerance: Tolerance for splitting, when in doubt use the Document Absolute Tolerance.
Returns: A Brep consisting of all the split fragments, or null on failure.

Rhino.Geometry.BrepFace.IsPointOnFace(System.Double,System.Double)
Test if a parameter space point is on the interior of a trimmed face.
u: Parameter space point u value.
v: Parameter space point v value.
Returns: A value describing the spatial relationship between the point and the face.

Rhino.Geometry.BrepFace.GetMesh
Get the shading mesh that is associated with this Face.