Rhino.DocObjects.MaterialInfo
Provides material definition information

Rhino.DocObjects.MaterialInfo.Default
Set material to default settings

Rhino.DocObjects.MaterialInfo.FindBitmapTexture(System.String)
Searches for a texure with matching filename and type. If more
than one texture matches, the first match is returned.
filename: if null then any filename matches
Returns: -1 if no match is found

Rhino.DocObjects.MaterialInfo.FindBitmapTexture
Searches for any bitmap texture
Returns: -1 if no match is found