Rhino.Geometry.Collections.MeshTextureCoordinateList.Clear
Clear the Texture Coordinate list on the mesh.

Rhino.Geometry.Collections.MeshTextureCoordinateList.AddRange(Rhino.Geometry.Point2f[])
Append an array of texture coordinates.
textureCoordinates: Texture coordinates to append.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.SetTextureCoordinate(System.Int32,System.Single,System.Single)
Sets or adds a texture coordinate to the Texture Coordinate List.
If [index] is less than [Count], the existing coordinate at [index] will be modified.If [index] equals [Count], a new coordinate is appended to the end of the coordinate list.If [index] is larger than [Count], the function will return false.
index: Index of texture coordinate to set.
s: S component of texture coordinate.
t: T component of texture coordinate.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.SetTextureCoordinate(System.Int32,System.Double,System.Double)
Sets or adds a texture coordinate to the Texture Coordinate List.
If [index] is less than [Count], the existing coordinate at [index] will be modified.If [index] equals [Count], a new coordinate is appended to the end of the coordinate list.If [index] is larger than [Count], the function will return false.
index: Index of texture coordinate to set.
s: S component of texture coordinate.
t: T component of texture coordinate.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.SetTextureCoordinate(System.Int32,Rhino.Geometry.Point2f)
Sets or adds a texture coordinate to the Texture Coordinate List.
If [index] is less than [Count], the existing coordinate at [index] will be modified.If [index] equals [Count], a new coordinate is appended to the end of the coordinate list.If [index] is larger than [Count], the function will return false.
index: Index of texture coordinate to set.
tc: Texture coordinate point.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.SetTextureCoordinate(System.Int32,Rhino.Geometry.Point3f)
Sets or adds a texture coordinate to the Texture Coordinate List.
If [index] is less than [Count], the existing coordinate at [index] will be modified.If [index] equals [Count], a new coordinate is appended to the end of the coordinate list.If [index] is larger than [Count], the function will return false.
index: Index of texture coordinate to set.
tc: Texture coordinate point.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.SetTextureCoordinates(Rhino.Geometry.Point2f[])
Set all texture coordinates in one go.
textureCoordinates: Texture coordinates to assign to the mesh.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.NormalizeTextureCoordinates
Scale the texture coordinates so the texture domains are [0,1]
and eliminate any texture rotations.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.TransposeTextureCoordinates
David: What does this do?
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.ReverseTextureCoordinates(System.Int32)
Reverse one coordinate direction of the texture coordinates, within texture domain m_tex_domain
direction:
0 = first texture coordinate is reversed
1 = second texture coordinate is reversed
Returns: