Rhino.Runtime.Interop
Use for moving object types between RhinoCommon and legacy Rhino_DotNet or C++

Rhino.Runtime.Interop.NativeGeometryConstPointer(Rhino.Geometry.GeometryBase)
Return the underlying const ON_Geometry* for a RhinoCommon class
geometry:
Returns:

Rhino.Runtime.Interop.CreateFromNativePointer(System.IntPtr)
Create a RhinoCommon Geometry class from a given ON_Geomety*. The ON_Geometry*
must be declared on the heap and it's lifetime becomes controlled by RhinoCommon
pGeometry: ON_Geometry*
Returns: The appropriate geometry class in RhinoCommon on success

Rhino.Runtime.Interop.TryCopyFromOnArc(System.Object,Rhino.Geometry.Arc@)
Attempts to copy the contents of a RMA.OpenNURBS.OnArc to a Rhino.Geometry.Arc
source:
destination:
Returns: true on success

Rhino.Runtime.Interop.TryCopyToOnArc(Rhino.Geometry.Arc,System.Object)
Attempts to copy the contents of a Rhino.Geometry.Arc to a RMA.OpenNURBS.OnArc
source:
destination:
Returns:

Rhino.Runtime.Interop.FromOnBrep(System.Object)
Copy a Rhino_DotNet brep to a RhinoCommon Brep class
source:
RMA.OpenNURBS.IOnBrep or RMA.OpenNURBS.OnBrep
Returns:
RhinoCommon Brep on success. This will be an independent copy

Rhino.Runtime.Interop.FromOnSurface(System.Object)
Copy a Rhino_DotNet surface to a RhinoCommon Surface class.
source:
Any of the following in the RMA.OpenNURBS namespace are acceptable.
IOnSurface, OnSurface, IOnPlaneSurface, OnPlaneSurface, IOnClippingPlaneSurface,
OnClippingPlaneSurface, IOnNurbsSurface, OnNurbsSurfac, IOnRevSurface, OnRevSurface,
IOnSumSurface, OnSumSurface
Returns:
RhinoCommon Surface on success. This will be an independent copy

Rhino.Runtime.Interop.FromOnMesh(System.Object)
Copy a Rhino_DotNet Mesh to a RhinoCommon Mesh class.
source:
RMA.OpenNURBS.IOnMesh or RMA.OpenNURBS.OnMesh
Returns:
RhinoCommon Mesh on success. This will be an independent copy

Rhino.Runtime.Interop.ToIRhinoViewport(Rhino.Display.RhinoViewport)
Convert a Rhino.Display.Viewport to an RMA.Rhino.IRhinoViewport
source:
Returns: