Rhino.Geometry.MeshParameters
Represents mesher settings for Brep->Mesh conversions.

Rhino.Geometry.MeshParameters.Minimal
Gets minimal meshing parameters.
Use this rather than the default constructor as it
initialized important fields properly.

Rhino.Geometry.MeshParameters.Default
Gets default meshing parameters.
Use this rather than the default constructor as it
initialized important fields properly.

Rhino.Geometry.MeshParameters.Coarse
Gets meshing parameters for coarse meshing.
This corresponds with the "Jagged and Faster" default in Rhino.

Rhino.Geometry.MeshParameters.Smooth
Gets meshing parameters for smooth meshing.
This corresponds with the "Smooth and Slower" default in Rhino.

Rhino.Geometry.MeshParameters.JaggedSeams
Gets or sets whether or not the mesh is allowed to have jagged seams.
When this flag is set to True, meshes on either side of a Brep Edge will not match up.

Rhino.Geometry.MeshParameters.RefineGrid
Gets or sets a value indicating whether or not the sampling grid can be refined
when certain tolerances are not met.

Rhino.Geometry.MeshParameters.SimplePlanes
Gets or sets a value indicating whether or not planar areas are allowed
to be meshed in a simplified manner.

Rhino.Geometry.MeshParameters.ComputeCurvature
Gets or sets a value indicating whether or not surface curvature
data will be embedded in the mesh.

Rhino.Geometry.MeshParameters.GridMinCount
Gets or sets the minimum number of grid quads in the initial sampling grid.

Rhino.Geometry.MeshParameters.GridMaxCount
Gets or sets the maximum number of grid quads in the initial sampling grid.

Rhino.Geometry.MeshParameters.GridAngle
Gets or sets the maximum allowed angle difference (in radians)
for a single sampling quad. The angle pertains to the surface normals.

Rhino.Geometry.MeshParameters.GridAspectRatio
Gets or sets the maximum allowed aspect ratio of sampling quads.

Rhino.Geometry.MeshParameters.GridAmplification
Gets or sets the grid amplification factor.
Values lower than 1.0 will decrease the number of initial quads,
values higher than 1.0 will increase the number of initial quads.

Rhino.Geometry.MeshParameters.Tolerance
Gets or sets the maximum allowed edge deviation.
This tolerance is measured between the center of the mesh edge and the surface.

Rhino.Geometry.MeshParameters.MinimumTolerance
Gets or sets the minimum tolerance.

Rhino.Geometry.MeshParameters.RelativeTolerance
Gets or sets the relative tolerance.

Rhino.Geometry.MeshParameters.MinimumEdgeLength
Gets or sets the minimum allowed mesh edge length.

Rhino.Geometry.MeshParameters.MaximumEdgeLength
Gets or sets the maximum allowed mesh edge length.