Rhino.Geometry.DetailView.SetScale(System.Double,Rhino.UnitSystem,System.Double,Rhino.UnitSystem)
Set the detail viewport's projection so geometry is displayed at a certain scale
modelLength: reference model length
modelUnits: units for model length
pageLength: length on page that the modelLength should equal
pageUnits: units for page length
Returns:
true on success
false if the viewport's projection is perspective or the input values do not make sense