Rhino.Collections.Point3dList.#ctor(System.Int32)
Create a new pointlist with a preallocated initial capacity.

Rhino.Collections.Point3dList.#ctor(Rhino.Geometry.Point3d[])
Construct a new Point3dList from a given number of points.
initialPoints: Points to add to the list.

Rhino.Collections.Point3dList.GetConstPointArray(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32@)
Anything calling this function should not be modifying the contents of the array
points:
count:
Returns:

Rhino.Collections.Point3dList.ClosestIndex(Rhino.Geometry.Point3d)
Find the index of the point that is closest to a test point in this list
testPoint: point to compare against
Returns: index of closest point in the list on success. -1 on error

Rhino.Collections.Point3dList.Add(System.Double,System.Double,System.Double)
Adds a ON_3dPoint to the end of the List with given x,y,z coordinates
x:
y:
z:

Rhino.Collections.Point3dList.Transform(Rhino.Geometry.Transform)
Apply a transform to all the points in the list.
xform: Transform to apply.

Rhino.Collections.Point3dList.ClosestIndexInList(System.Collections.Generic.IList{Rhino.Geometry.Point3d},Rhino.Geometry.Point3d)
Find the index of the point in a list of points that is closest to a test point.
list: A list of points.
testPoint: Point to compare against.
Returns: Index of closest point in the list on success or -1 on error.

Rhino.Collections.Point3dList.ClosestPointInList(System.Collections.Generic.IList{Rhino.Geometry.Point3d},Rhino.Geometry.Point3d)
Find the point in a list of points that is closest to a test point.
list: A list of points.
testPoint: Point to compare against.
Returns:
Throws System.ArgumentException:
list must contain at least one point and testPoint must be valid