Rhino.Geometry.SurfaceCurvature
Maintains all information for a Surface Curvature evaluation.

Rhino.Geometry.SurfaceCurvature.OsculatingCircle(System.Int32)
Compute the osculating circle along the given direction.
direction: Direction index, valid values are 0 and 1.
Returns: The osculating circle in the given direction or Circle.Unset on failure.