Rhino.Display.ColorHSL.#ctor(System.Drawing.Color)
Create a new instance of ColorHSL that is equivalent to an RGB color.
rgb: RGB Color to mimic.
Remarks: Exact conversions between color spaces are often not possible.

Rhino.Display.ColorHSL.#ctor(System.Double,System.Double,System.Double)
Create a new instance of ColorHSL with custom channel values.
hue: Hue channel value. Hue channels rotate between 0.0 and 1.0
saturation: Saturation channel value. Channel will be limited to 0~1.
luminance: Luminance channel value. Channel will be limited to 0~1.

Rhino.Display.ColorHSL.#ctor(System.Double,System.Double,System.Double,System.Double)
Create a new instance of ColorHSL with custom channel values.
alpha: Alpha channel value. Channel will be limited to 0~1.
hue: Hue channel value. Hue channels rotate between 0.0 and 1.0
saturation: Saturation channel value. Channel will be limited to 0~1.
luminance: Luminance channel value. Channel will be limited to 0~1.

Rhino.Display.ColorHSL.H
Gets or sets the hue channel value.
Hue channels rotate between 0.0 and 1.0

Rhino.Display.ColorHSL.ToArgbColor
Convert HSL color to an equivalent System.Drawing.Color
Returns: