Rhino.Geometry.Vector3f.#ctor(System.Single,System.Single,System.Single)
Create a new vector from 3 single precision numbers.
x: X component of vector.
y: Y component of vector.
z: Z component of vector.