Rhino.Geometry.VolumeMassProperties.WorldCoordinatesFirstMoments
Returns the world coordinate first moments if they were able to be calculated.
X is integral of "x dm" over the volume
Y is integral of "y dm" over the volume
Z is integral of "z dm" over the volume

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesFirstMomentsError
Uncertainty in world coordinates first moments calculation

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesSecondMoments
Returns the world coordinate first moments if they were able to be calculated.
X is integral of "xx dm" over the area
Y is integral of "yy dm" over the area
Z is integral of "zz dm" over the area

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesSecondMomentsError
Uncertainty in world coordinates second moments calculation

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesProductMoments
Returns the world coordinate product moments if they were able to be calculated.
X is integral of "xy dm" over the area
Y is integral of "yz dm" over the area
Z is integral of "zx dm" over the area

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesProductMomentsError
Uncertainty in world coordinates second moments calculation

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesMomentsOfInertia
The moments of inertia about the world coordinate axes.
X = integral of (y^2 + z^2) dm
Y = integral of (z^2 + x^2) dm
Z = integral of (z^2 + y^2) dm
Remarks:
What is meant by "moments of intertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesMomentsOfInertiaError
Uncertainty in world coordinates moments of inertia calculation

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesSecondMomentsError
Uncertainty in centroid coordinates second moments calculation

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesMomentsOfInertiaError
Uncertainty in centroid coordinates moments of inertia calculation

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Mesh)
Compute the VolumeMassProperties for a single Mesh.
mesh: Mesh to measure.
Returns: The VolumeMassProperties for the given Mesh or null on failure.

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Brep)
Compute the VolumeMassProperties for a single Brep.
brep: Brep to measure.
Returns: The VolumeMassProperties for the given Brep or null on failure.

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Surface)
Compute the VolumeMassProperties for a single Surface.
surface: Surface to measure.
Returns: The VolumeMassProperties for the given Surface or null on failure.

Rhino.Geometry.VolumeMassProperties.Sum(Rhino.Geometry.VolumeMassProperties)
Sum mass properties together to get an aggregate mass.
summand: mass properties to add
Returns: True if successful.