Rhino.DocObjects.Tables.GroupTable.Document
Document that owns this group table

Rhino.DocObjects.Tables.GroupTable.Count
Number of groups in the group table

Rhino.DocObjects.Tables.GroupTable.Find(System.String,System.Boolean)
Find group with a given name
groupName:
Name of group to search for. Ignores case
ignoreDeletedGroups:
True means don't search deleted groups.
Returns:
>=0 index of the group with the given name.
-1 no group found with the given name

Rhino.DocObjects.Tables.GroupTable.Add(System.String)
Add a new empty group to the group table
groupName: name of new group
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.

Rhino.DocObjects.Tables.GroupTable.Add
Add a new empty group to the group table
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.

Rhino.DocObjects.Tables.GroupTable.Add(System.String,System.Collections.Generic.IEnumerable{System.Guid})
Add a new group to the group table with a set of objects
groupName: name of new group
objectIds:
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.

Rhino.DocObjects.Tables.GroupTable.Add(System.Collections.Generic.IEnumerable{System.Guid})
Add a new group to the group table with a set of objects
objectIds:
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.

Rhino.DocObjects.Tables.GroupTable.AddToGroup(System.Int32,System.Guid)
Add an object to an existing group
groupIndex:
objectId:
Returns:

Rhino.DocObjects.Tables.GroupTable.AddToGroup(System.Int32,System.Collections.Generic.IEnumerable{System.Guid})
Adds a list of objects to an existing group
groupIndex:
objectIds:
Returns:

Rhino.DocObjects.Tables.GroupTable.Delete(System.Int32)
Deleted groups are kept in the runtime group table so that undo
will work with groups.  Call IsDeleted() to determine if a group is deleted.
groupIndex:
Returns: