Rhino.Display.DisplayModeDescription
Description of a how Rhino will display in a viewport. These are the modes
that are listed under "Advanced display" in the options dialog

Rhino.Display.DisplayModeDescription.GetDisplayModes
Get all display mode descriptions that Rhino currently knows about
Returns:
Copies of all of the display mode descriptions. If you want to modify
these descriptions, you must call UpdateDisplayMode or AddDisplayMode