Rhino.DocObjects.ObjRef.Surface


Rhino.DocObjects.ObjRef.SelectionMethod
Get the method used to select this object.
Returns: The method used to select this object.

Rhino.DocObjects.ObjRef.SelectionPoint
If the object was selected by picking a point on it, then
SelectionPoint() returns the point where the selection
occured, otherwise it returns Point3d.Unset.
Returns: The point where the selection occured or Point3d.Unset
on failure.

Rhino.DocObjects.ObjRef.SurfaceParameter(System.Double@,System.Double@)
If the reference geometry is a surface, brep with one face,
or surface edge with a selection point, then this gets the
surface paramters of the selection point.
u:
v:
Returns:
If the selection point was on a surface, the the surface is returned.