Rhino.ApplicationSettings.ClipboardState.KeepData
Always keep clipboard data, regardless of size and never prompt the user

Rhino.ApplicationSettings.ClipboardState.DeleteData
Always delete clipboard data, regardless of size and never prompt the user

Rhino.ApplicationSettings.ClipboardState.PromptWhenBig
Prompt user when clipboard memory is large