Rhino.Geometry.Transform
parallel to C++ ON_Xform

Rhino.Geometry.Transform.#ctor(System.Double)
Creates a new Transform matrix with specific values along the diagonal.
diagonalValue: Value to assign to all diagonal cells except M33 which is set to 1.0.

Rhino.Geometry.Transform.Identity
Gets a new Identity transform matrix. An identity matrix defines no transformation.

Rhino.Geometry.Transform.Unset
Get an XForm filled with RhinoMath.UnsetValue.

Rhino.Geometry.Transform.Translation(Rhino.Geometry.Vector3d)
Create a new Translation (move) transformation.
motion: Translation (motion) vector.
Returns: A transform matrix which moves geometry along the motion vector.

Rhino.Geometry.Transform.Translation(System.Double,System.Double,System.Double)
Create a new Translation (move) tranformation.
Right column is (dx, dy, dz, 1.0).
dx: Distance to translate (move) geometry along the world X axis.
dy: Distance to translate (move) geometry along the world Y axis.
dz: Distance to translate (move) geometry along the world Z axis.
Returns: A transform matrix which moves geometry with the specified distances.

Rhino.Geometry.Transform.Scale(Rhino.Geometry.Point3d,System.Double)
Create a new Uniform Scaling transformation with a specified scaling anchor point.
anchor: Defines the anchor point of the scaling operation.
scaleFactor: Scaling factor in all directions.
Returns: A transform matrix which scales geometry uniformly around the anchor point.

Rhino.Geometry.Transform.Scale(Rhino.Geometry.Plane,System.Double,System.Double,System.Double)
Create a new Non-Uniform Scaling transformation with a specified scaling anchor point.
plane: Defines the center and orientation of the scaling operation.
xScaleFactor: Scaling factor along the anchor plane X-Axis direction.
yScaleFactor: Scaling factor along the anchor plane Y-Axis direction.
zScaleFactor: Scaling factor along the anchor plane Z-Axis direction.
Returns: A transformation matrix which scales geometry non-uniformly.

Rhino.Geometry.Transform.Rotation(System.Double,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Create a new Rotation transformation with specified angles, rotation centers and rotation axes.
sinAngle: Sin of the rotation angle.
cosAngle: Cos of the rotation angle.
rotationAxis: Axis direction of rotation.
rotationCenter: Center point of rotation.
Returns: A transformation matrix which rotates geometry around an anchor point.

Rhino.Geometry.Transform.Rotation(System.Double,Rhino.Geometry.Point3d)
Create a new Rotation transformation with specified angles and rotation centers.
angleRadians: Angle (in Radians) of the rotation.
rotationCenter: Center point of rotation. Rotation axis is vertical.
Returns: A transformation matrix which rotates geometry around an anchor point.

Rhino.Geometry.Transform.Rotation(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Create a new Rotation transformation with specified angles, rotation centers and rotation axes.
angleRadians: Angle (in Radians) of the rotation.
rotationAxis: Axis direction of rotation operation.
rotationCenter: Center point of rotation. Rotation axis is vertical.
Returns: A transformation matrix which rotates geometry around an anchor point.

Rhino.Geometry.Transform.Rotation(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
transformation maps X0 to X1, Y0 to Y1, Z0 to Z1
x0:
y0:
z0:
x1:
y1:
z1:
Returns:

Rhino.Geometry.Transform.Mirror(Rhino.Geometry.Plane)
Create a new Mirror transformation.
mirrorPlane: Plane that defines the mirror orientation and position.
Returns: A transformation matrix which mirrors geometry in a specified plane.

Rhino.Geometry.Transform.ChangeBasis(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Computes a change of basis transformation. A basis change is essentially a remapping
of geometry from one coordinate system to another.
plane0: Coordinate system in which the geometry is currently described.
plane1: Target coordinate system in which we want the geometry to be described.
Returns:
A transformation matrix which orients geometry from one coordinate system to another on success.
Transform.Unset on failure

Rhino.Geometry.Transform.ChangeBasis(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Computes a change of basis transformation. A basis change is essentially a remapping
of geometry from one coordinate system to another.
initialBasisX: can be any 3d basis
initialBasisY: can be any 3d basis
initialBasisZ: can be any 3d basis
finalBasisX: can be any 3d basis
finalBasisY: can be any 3d basis
finalBasisZ: can be any 3d basis
Returns:
A transformation matrix which orients geometry from one coordinate system to another on success.
Transform.Unset on failure

Rhino.Geometry.Transform.PlanarProjection(Rhino.Geometry.Plane)
Create a projection transformation.
plane: Plane onto which everything will be perpendicularly projected.
Returns: A transformation matrix which projects geometry onto a specified plane.

Rhino.Geometry.Transform.Shear(Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Create a Shear transformation.
plane: Base plane for shear.
x: Shearing vector along plane x-axis.
y: Shearing vector along plane y-axis.
z: Shearing vector along plane z-axis.
Returns: A transformation matrix which shear geometry.

Rhino.Geometry.Transform.Multiply(Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Multiply (combine) two transformations.
a: First transformation.
b: Second transformation.
Returns: A transformation matrix that combines the effect of both input transformations.
The resulting Transform gives the same result as though you'd first apply A then B.

Rhino.Geometry.Transform.TryGetInverse(Rhino.Geometry.Transform@)
Attempt to get the Inverse Transform of this Transform.
inverseTransform:
Returns:
True on success.
If false is returned and this Transform is Invalid, inserveTransform will be set to this Transform.
If false is returned and this Transform is Valid, inverseTransform will be set to a pseudo inverse.