Rhino.Display.RhinoPageView.PageIsActive
True if the page is active instead of any detail views. This occurs
when the MainViewport.Id == ActiveViewportID

Rhino.Display.RhinoPageView.PageName
Same as the MainViewport.Name

Rhino.Display.RhinoPageView.AddDetailView(System.String,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,Rhino.Display.DefinedViewportProjection)
Create a detail view object that is displayed on this page and adds it to the doc
title:
corner0: corners of the detail view in world coordinates
corner1: corners of the detail view in world coordinates
initialProjection:
Returns: newly created detail view on success. null on error

Rhino.Display.RhinoPageView.GetDetailViews
Get a list of the detail view objects associated with this layout
Returns: