Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Plane)
Copy constructor
other:

Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Construct a plane from a point and a normal vector.
origin: Origin point of the plane.
normal: Non-zero normal to the plane.
CreateFromNormal

Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Construct a plane from a point and two vectors in the plane.
origin: Origin point of the plane.
xDirection:
Non-zero vector in the plane that determines the x-axis direction.
yDirection:
Non-zero vector not parallel to x_dir that is used to determine the
yaxis direction. y_dir does not need to be perpendicular to x_dir.

Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Construct a plane from three non-colinear points.
origin: Origin point of the plane.
xPoint:
Second point in the plane. The x-axis will be parallel to x_point-origin.
yPoint:
Third point on the plane that is not colinear with the first two points.
yaxis*(y_point-origin) will be > 0.

Rhino.Geometry.Plane.#ctor(System.Double,System.Double,System.Double,System.Double)
Construct a plane from an equation
ax+by+cz=d

Rhino.Geometry.Plane.XAxis
Gets or sets the Xaxis vector of this plane.

Rhino.Geometry.Plane.YAxis
Gets or sets the Yaxis vector of this plane.

Rhino.Geometry.Plane.ZAxis
Gets or sets the Zaxis vector of this plane.

Rhino.Geometry.Plane.WorldXY
plane coincident with the World XY plane

Rhino.Geometry.Plane.WorldYZ
plane coincident with the World YZ plane

Rhino.Geometry.Plane.WorldZX
plane coincident with the World ZX plane

Rhino.Geometry.Plane.FitPlaneToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Plane@)
Fit a plane through a collection of points.
points: Points to fit to.
plane: Resulting plane
Returns: A value indicating the result of the operation.

Rhino.Geometry.Plane.FitPlaneToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Plane@,System.Double@)
Fit a plane through a collection of points.
points: Points to fit to.
plane: Resulting plane
maximumDeviation: The distance from the furthest point to the plane.
Returns: A value indicating the result of the operation.

Rhino.Geometry.Plane.GetPlaneEquation
Get the plane equation for this plane in the format of Ax+By+Cz+D=0
Returns:
Array of four values

Rhino.Geometry.Plane.PointAt(System.Double,System.Double)
Evaluate a point on the plane.
u: evaulation parameter
v: evaulation parameter
Returns: plane.origin + u*plane.xaxis + v*plane.yaxis

Rhino.Geometry.Plane.PointAt(System.Double,System.Double,System.Double)
Evaluate a point on the plane
u: evaulation parameter
v: evaulation parameter
w: evaulation parameter
Returns: plane.origin + u*plane.xaxis + v*plane.yaxis + z*plane.zaxis

Rhino.Geometry.Plane.ExtendThroughBox(Rhino.Geometry.BoundingBox,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
Extend this plane through a Box.
box:
s:
If this function returns True,
the s parameter returns the Interval on the plane along the X direction that will
encompass the Box.
t:
If this function returns True,
the t parameter returns the Interval on the plane along the Y direction that will
encompass the Box.
Returns: True on success, false on failure.

Rhino.Geometry.Plane.ExtendThroughBox(Rhino.Geometry.Box,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
Extend this plane through a Box.
box:
s:
If this function returns True,
the s parameter returns the Interval on the plane along the X direction that will
encompass the Box.
t:
If this function returns True,
the t parameter returns the Interval on the plane along the Y direction that will
encompass the Box.
Returns: True on success, false on failure.

Rhino.Geometry.Plane.ClosestParameterTo(Rhino.Geometry.Point3d,System.Double@,System.Double@)
This method is Obsolete, use ClosestParameter() instead.

Rhino.Geometry.Plane.ClosestParameter(Rhino.Geometry.Point3d,System.Double@,System.Double@)
Gets the parameters of the point on the plane closest to a test point.
testPoint: Point to get close to.
s: Parameter along plane X-direction.
t: Parameter along plane Y-direction.
Returns:
True if a parameter could be found,
false if the point could not be projected successfully.

Rhino.Geometry.Plane.ClosestPointTo(Rhino.Geometry.Point3d)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Plane.RemapToPlaneSpace(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@)
Convert a point from World space coordinates into Plane space coordinates.
ptSample: World point to remap.
ptPlane: Point in plane (s,t,d) coordinates.
Returns: True on success, false on failure.
Remarks: D stands for distance, not disease.

Rhino.Geometry.Plane.Transform(Rhino.Geometry.Transform)
Transform the plane with a Transformation matrix.
xform: Transformation to apply to plane.
Returns: True on success, false on failure.

Rhino.Geometry.Plane.Translate(Rhino.Geometry.Vector3d)
Translate (move) the plane along a vector.
delta: Translation (motion) vector
Returns: True on success, false on failure.

Rhino.Geometry.Plane.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d)
Rotate the plane about its origin point.
sinAngle: Sin(angle).
cosAngle: Cos(angle).
axis: Axis of rotation.
Returns: True on success, false on failure.

Rhino.Geometry.Plane.Rotate(System.Double,Rhino.Geometry.Vector3d)
Rotate the plane about its origin point.
angle: Angle in radians.
axis: Axis of rotation.
Returns: True on success, false on failure.

Rhino.Geometry.Plane.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotate the plane about a custom anchor point.
angle: Angle in radians.
axis: Axis of rotation.
centerOfRotation: Center of rotation.
Returns: True on success, false on failure.

Rhino.Geometry.Plane.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotate the plane about a custom anchor point.
sinAngle: Sin(angle)
cosAngle: Cos(angle)
axis: Axis of rotation.
centerOfRotation: Center of rotation.
Returns: True on success, false on failure.