Rhino.Geometry.Polyline
An ordered set of points connected by linear segments

Rhino.Geometry.Polyline.#ctor
Create a new empty polyline.

Rhino.Geometry.Polyline.#ctor(System.Int32)
Create a new empty polyline with an initial capacity.
initialCapacity: Number of vertices this polyline can contain without resizing.

Rhino.Geometry.Polyline.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Create a new polyline from a collection of points.
collection: Points to copy into the local vertex array.

Rhino.Geometry.Polyline.IsValid
Gets a value that indicates whether or not this polyline is valid.
Valid polylines have at least one segment, no Invalid points and no zero length segments.
Closed Polylines with only two segments are also not considered valid.

Rhino.Geometry.Polyline.IsClosed
Gets whether or not this polyline is closed.
The polyline is considered to be closed if the start-point is
identical to the end-point.
Rhino.Geometry.Polyline.IsClosedWithinTolerance(System.Double)

Rhino.Geometry.Polyline.IsClosedWithinTolerance(System.Double)
Test to see whether or not the polyline is closed to within tolerance.
tolerance: If the distance between the start and end point of the polyline
is less than tolerance, the polyline is considered to be closed.
Returns: True if the polyline is closed to within tolerance, false if not.

Rhino.Geometry.Polyline.Trim(Rhino.Geometry.Interval)
Create a polyline out of a parameter subdomain.
domain: The subdomain of the polyline.
The integer part of the domain parameters indicate the index of the segment.
Returns: The polyline as defined by the subdomain, or null on failure.

Rhino.Geometry.Polyline.ClosestPointTo(Rhino.Geometry.Point3d)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Polyline.ClosestParameterTo(Rhino.Geometry.Point3d)
This method is Obsolete, use ClosestParameter() instead.

Rhino.Geometry.Polyline.GetSegments
Get an array of line segments that make up the entire polyline.
Returns: An array of line segments or null if the polyline contains fewer than 2 points.

Rhino.Geometry.Polyline.ToNurbsCurve
Create a nurbs curve representation of this polyline.
Returns: A Nurbs curve shaped like this polyline or null on failure.

Rhino.Geometry.Polyline.DeleteShortSegments(System.Double)
Remove all points that are closer than tolerance to the previous point.
Start and end points are left intact.
tolerance: Vertices closer together than tolerance will be removed.
Returns: Number of points (and segments) removed.

Rhino.Geometry.Polyline.CollapseShortSegments(System.Double)
Collapse all segments until none are shorter than tolerance.
This function is significantly slower than DeleteShortSegments,
since it recursively operates on the shortest segment.
When a segment is collapsed the end-points are placed in the center of the segment.
tolerance: Tolerance to use during collapsing.
Returns: The number of segments that were collapsed.
Rhino.Geometry.Polyline.DeleteShortSegments(System.Double)

Rhino.Geometry.Polyline.ReduceSegments(System.Double)
Create a reduction of this polyline by recursively removing the least significant segments.
tolerance: Tolerance for reduction. Whenever a vertex of the polyline is more
significant than tolerance, it will be included in the reduction.
Returns: The number of vertices that disappeared due to reduction.

Rhino.Geometry.Polyline.Smooth(System.Double)
Smooth the polyline segments by averaging adjacent vertices.
Smoothing requires a polyline with exclusively valid vertices.
amount: Amount to smooth. Zero equals no smoothing, one equals complete smoothing.
Returns: True on success, false on failure.

Rhino.Geometry.Polyline.BreakAtAngles(System.Double)
Break this polyline into sections at sharp kinks.
Closed polylines will also be broken at the first and last vertex.
angle: Angle (in radians) between adjacent segments for a break to occur.
Returns: An array of polyline segments or null on error.