Rhino.Display.ColorLAB.#ctor(System.Drawing.Color)
Create a new instance of ColorLAB that is equivalent to an RGB color.
rgb: RGB Color to mimic.
Remarks: Exact conversions between color spaces are often not possible.

Rhino.Display.ColorLAB.#ctor(System.Double,System.Double,System.Double)
Create a new instance of ColorLAB with custom channel values.

Rhino.Display.ColorLAB.#ctor(System.Double,System.Double,System.Double,System.Double)
Create a new instance of ColorLAB with custom channel values.