Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#IList&lt;Rhino#Geometry#Intersect#IntersectionEvent&gt;#Item(System.Int32)
Gets the intersection event data at the given index; setting always throws an exception.
index: Index of intersection event to retrieve.
Returns: The intersection event.
Throws System.NotSupportedException: NotSupportedException is always thrown when
setting this indexer.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#ICollection&lt;Rhino#Geometry#Intersect#IntersectionEvent&gt;#IsReadOnly
This collection is readonly, so this property returns always true.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#IEnumerable#GetEnumerator
Returns a non-generic enumerator that is capable of yielding all IntersectionEvents in the collection.
Returns: The constructed non-generic enumerator.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#ICollection&lt;Rhino#Geometry#Intersect#IntersectionEvent&gt;#Remove(Rhino.Geometry.Intersect.IntersectionEvent)
Removal is not supported and this method always throws NotSupportedException.
Throws System.NotSupportedException: NotSupportedException is always thrown.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#ICollection&lt;Rhino#Geometry#Intersect#IntersectionEvent&gt;#Contains(Rhino.Geometry.Intersect.IntersectionEvent)
Allows to establish whether this collection contains and IntersectionEvent.
item: Object to be found.
Returns: True if element is contained; otherwise false.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#ICollection&lt;Rhino#Geometry#Intersect#IntersectionEvent&gt;#Clear
Clearing is not supported and this method always throws NotSupportedException.
Throws System.NotSupportedException: NotSupportedException is always thrown.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#ICollection&lt;Rhino#Geometry#Intersect#IntersectionEvent&gt;#Add(Rhino.Geometry.Intersect.IntersectionEvent)
Addition is not supported and this method always throws NotSupportedException.
item: Addition is not supported and this value is ignored.
Throws System.NotSupportedException: NotSupportedException is always thrown.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#IList&lt;Rhino#Geometry#Intersect#IntersectionEvent&gt;#RemoveAt(System.Int32)
Removal is not supported and this method always throws NotSupportedException.
index: Removal is not supported and this value is ignored.
Throws System.NotSupportedException: NotSupportedException is always thrown.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#IList&lt;Rhino#Geometry#Intersect#IntersectionEvent&gt;#Insert(System.Int32,Rhino.Geometry.Intersect.IntersectionEvent)
Inserting is not supported and this method always throws NotSupportedException.
index: Inserting is not supported and this value is ignored.
item: Inserting is not supported and this value is ignored.
Throws System.NotSupportedException: NotSupportedException is always thrown.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#IList&lt;Rhino#Geometry#Intersect#IntersectionEvent&gt;#IndexOf(Rhino.Geometry.Intersect.IntersectionEvent)
Determines the index of an IntersectionEvent.
item: The IntersectionEvent to be found.
Returns: The index in case the IntersectionEvent was found; -1 otherwise.