Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d
ON_SimpleArray<ON_3dPoint>, ON_3dPointArray, ON_PolyLine all have the same size
This class wraps all of these C++ versions

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.#ctor
Create with an initial capacity of 0

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.Count
The number of actual points in this class

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.ToArray
Copies the contents to an array of ON_3dPoints
Returns: