Rhino.Display.CalculateBoundingBoxEventArgs.IncludeBoundingBox(Rhino.Geometry.BoundingBox)
Unions a bounding box with the current display bounding box in order to ensure
dynamic objects in "box" are drawn
box: