Rhino.Geometry.Collections.MeshFaceNormalList.Clear
Clear the Face Normal list on the mesh.

Rhino.Geometry.Collections.MeshFaceNormalList.AddFaceNormal(System.Single,System.Single,System.Single)
Append a face normal to the list of mesh face normals.
x: X component of face normal.
y: Y component of face normal.
z: Z component of face normal.
Returns: The index of the newly added face normal.

Rhino.Geometry.Collections.MeshFaceNormalList.AddFaceNormal(System.Double,System.Double,System.Double)
Append a face normal to the list of mesh face normals.
x: X component of face normal.
y: Y component of face normal.
z: Z component of face normal.
Returns: The index of the newly added face normal.

Rhino.Geometry.Collections.MeshFaceNormalList.AddFaceNormal(Rhino.Geometry.Vector3d)
Append a face normal to the list of mesh face normals.
normal: New face normal.
Returns: The index of the newly added face normal.

Rhino.Geometry.Collections.MeshFaceNormalList.AddFaceNormal(Rhino.Geometry.Vector3f)
Append a face normal to the list of mesh face normals.
normal: New face normal.
Returns: The index of the newly added face normal.

Rhino.Geometry.Collections.MeshFaceNormalList.UnitizeFaceNormals
Unitize all the existing face normals.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshFaceNormalList.ComputeFaceNormals
Compute all the face normals for this mesh based on the physical shape of the mesh.
Returns: True on success, false on failure.