Rhino.Geometry.Line
Represents a single line segment.

Rhino.Geometry.Line.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Create a new line segment between two points.
from: Start point of line.
to: End point of line.

Rhino.Geometry.Line.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Create a new line segment from start point and span vector.
start: Start point of line segment.
span: Direction and length of line segment.

Rhino.Geometry.Line.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double)
Create a new line segment from start point, direction and length.
start: Start point of line segment.
direction: Direction of line segment.
length: Length of line segment.

Rhino.Geometry.Line.Unset
Get a line segment which has Unset end points.

Rhino.Geometry.Line.Direction
Gets the direction of this line segment.
The length of the direction vector equals the length of
the line segment.
Sets both the direction and the length of the line.

Rhino.Geometry.Line.TryFitLineToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Line@)
Attempt to fit a line through a set of points.
points: The points through which to fit.
fitLine: The resulting line on success
Returns: True on success, false on failure.

Rhino.Geometry.Line.ClosestParameterTo(Rhino.Geometry.Point3d)
This method is Obsolete, use ClosestParameter() instead.

Rhino.Geometry.Line.ClosestPointTo(Rhino.Geometry.Point3d,System.Boolean)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Line.MinimumDistanceTo(Rhino.Geometry.Point3d)
Find the shortest distance between this line as a finite segment
and a test point
testPoint:
Returns:

Rhino.Geometry.Line.MinimumDistanceTo(Rhino.Geometry.Line)
Find the shortest distance between this line as a finite segment
and another finite segment
testLine:
Returns:

Rhino.Geometry.Line.MaximumDistanceTo(Rhino.Geometry.Point3d)
Find the largest distance between this line as a finite segment
and a test point
testPoint:
Returns:

Rhino.Geometry.Line.MaximumDistanceTo(Rhino.Geometry.Line)
Find the largest distance between this line as a finite segment
and another finite segment
testLine:
Returns:

Rhino.Geometry.Line.Transform(Rhino.Geometry.Transform)
Transform the line using a Transformation matrix.
xform: Transform to apply to this line.
Returns: True on success, false on failure.

Rhino.Geometry.Line.ToNurbsCurve
Create a nurbs curve representation of this line.
This amounts to the same as calling NurbsCurve.CreateFromLine().
Returns: A nurbs curve representation of this line or null if no such representation could be made.

Rhino.Geometry.Line.Extend(System.Double,System.Double)
Extend the line by custom distances on both sides.
startLength:
Distance to extend the line at the start point.
Positive distance result in longer lines.
endLength:
Distance to extend the line at the end point.
Positive distance result in longer lines.
Returns: True on success, false on failure.

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.BoundingBox)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line
that overlaps the box.
box: Box to extend through.
Returns: True on success, false on failure.

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.BoundingBox,System.Double)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line that overlaps the box.
box: Box to extend through.
additionalLength: Additional length to append at both sides of the line.
Returns: True on success, false on failure.

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.Box)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line that overlaps the box.
box: Box to extend through.
Returns: True on success, false on failure.

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.Box,System.Double)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line that overlaps the box.
box: Box to extend through.
additionalLength: Additional length to append at both sides of the line.
Returns: True on success, false on failure.

Rhino.Geometry.Line.TryGetPlane(Rhino.Geometry.Plane@)
Get a plane that contains the line. The origin of the plane is at the start of the line.
If possible, a plane parallel to the world xy, yz, or zx plane is returned.
plane:
Returns: true on success