Rhino.Geometry.Collections.MeshVertexList
Provides access to the Vertices and Vertex related functionality of a Mesh.

Rhino.Geometry.Collections.MeshVertexList.SetVertex(System.Int32,System.Single,System.Single,System.Single)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.If [index] equals [Count], a new vertex is appended to the end of the vertex list.If [index] is larger than [Count], the function will return false.
index: Index of vertex to set.
x: X component of vertex location.
y: Y component of vertex location.
z: Z component of vertex location.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexList.SetVertex(System.Int32,System.Double,System.Double,System.Double)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.If [index] equals [Count], a new vertex is appended to the end of the vertex list.If [index] is larger than [Count], the function will return false.
index: Index of vertex to set.
x: X component of vertex location.
y: Y component of vertex location.
z: Z component of vertex location.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexList.SetVertex(System.Int32,Rhino.Geometry.Point3f)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.If [index] equals [Count], a new vertex is appended to the end of the vertex list.If [index] is larger than [Count], the function will return false.
index: Index of vertex to set.
vertex: Vertex location.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexList.SetVertex(System.Int32,Rhino.Geometry.Point3d)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.If [index] equals [Count], a new vertex is appended to the end of the vertex list.If [index] is larger than [Count], the function will return false.
index: Index of vertex to set.
vertex: Vertex location.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexList.IsHidden(System.Int32)
Gets a value indicating whether or not a vertex is hidden.
vertexIndex: Index of vertex to query.
Returns: True if the vertex is hidden, false if it is not.

Rhino.Geometry.Collections.MeshVertexList.Hide(System.Int32)
Hide the vertex at the given index.
vertexIndex: Index of vertex to hide.

Rhino.Geometry.Collections.MeshVertexList.Show(System.Int32)
Show the vertex at the given index.
vertexIndex: Index of vertex to show.

Rhino.Geometry.Collections.MeshVertexList.HideAll
Hide all vertices in the mesh.

Rhino.Geometry.Collections.MeshVertexList.ShowAll
Show all vertices in the mesh.

Rhino.Geometry.Collections.MeshVertexList.CullUnused
Cull (remove) all vertices that are currently not used by the Face list.
Returns: The number of unused vertices that were removed.

Rhino.Geometry.Collections.MeshVertexList.CombineIdentical(System.Boolean,System.Boolean)
Merge identical vertices.
ignoreNormals:
If true, vertex normals will not be taken into consideration when comparing vertices.
ignoreAdditional:
If true, texture coordinates, colors, and principal curvatures
will not be taken into consideration when comparing vertices.
Returns:
True if the mesh is changed, in which case the mesh will have fewer vertices than before.

Rhino.Geometry.Collections.MeshVertexList.GetVertexFaces(System.Int32)
Get a list of all of the faces that share a given vertex
vertexIndex:
Returns: list of indices of faces on success, null on failure

Rhino.Geometry.Collections.MeshVertexList.GetTopologicalIndenticalVertices(System.Int32)
Get a list of other vertices which a "topologically" identical
to this vertex
vertexIndex:
Returns:
Array of indices of vertices that are topoligically the same as this vertex. The
array includes vertexIndex. Returns null on failure

Rhino.Geometry.Collections.MeshVertexList.GetConnectedVertices(System.Int32)
Gets indices of all vertices that form "edges" with a given vertex index.
vertexIndex:
Returns:

Rhino.Geometry.Collections.MeshVertexList.ToPoint3fArray
Copy all of the points in this vertex list to an array of Point3d
Returns: