Rhino.DocObjects.GripObject.Moved
True if the grip has moved from OriginalLocation

Rhino.DocObjects.GripObject.Weight
The weight of a NURBS control point grip or RhinoMath.UnsetValue
if the grip is not a NURBS control point grip

Rhino.DocObjects.GripObject.Move(Rhino.Geometry.Transform)
Move the grip to a new location
xform:
Transformation appliead to the OriginalLocation point

Rhino.DocObjects.GripObject.Move(Rhino.Geometry.Vector3d)
Move the grip to a new location
delta:
Translation applied to the OriginalLocation point

Rhino.DocObjects.GripObject.Move(Rhino.Geometry.Point3d)
Move the grip to a new location
newLocation:
New location for grip

Rhino.DocObjects.GripObject.UndoMove
Undoes any grip moves made by calling Move