Rhino.DocObjects.Tables.InstanceDefinitionTable.Document
Document that owns this table

Rhino.DocObjects.Tables.InstanceDefinitionTable.Count
Number of items in the instance definitions table

Rhino.DocObjects.Tables.InstanceDefinitionTable.Find(System.String,System.Boolean)
Finds the instance definition with a given name
instanceDefinitionName: name of instance definition to search for (ignores case)
ignoreDeletedInstanceDefinitions: true means don't search deleted instance definitions
Returns:

Rhino.DocObjects.Tables.InstanceDefinitionTable.Find(System.Guid,System.Boolean)
Finds the instance definition with a given id
instanceId: Unique id of the instance definition to search for
ignoreDeletedInstanceDefinitions: true means don't search deleted instance definitions
Returns:

Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(Rhino.DocObjects.InstanceDefinition,System.String,System.String,System.Boolean)
Modify instance definition name and description.
Does not change instance defintion uuid or geometry.
idef:
newName:
newDescription:
quiet:
if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful

Rhino.DocObjects.Tables.InstanceDefinitionTable.MakeSourcePathRelative(Rhino.DocObjects.InstanceDefinition,System.Boolean,System.Boolean)
Marks the source path for a linked instance definition as relative or absolute
idef:
relative:
if true, the path should be considered as relative
if false, the path should be considered as absolute
quiet:
Returns:
true if the instance defintion could be modified

Rhino.DocObjects.Tables.InstanceDefinitionTable.Delete(System.Int32,System.Boolean,System.Boolean)
Deletes instance definition
idefIndex:
zero based index of instance definition to delete.
This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count
deleteReferences:
true to delete all references to this definition.
false to delete definition only if there are no references.
quiet:
If true, no warning message box appears if an instance definition cannot be
deleted because it is the current layer or it contains active geometry.
Returns:
true if successful. false if the instance definition has active references and bDeleteReferences is false.

Rhino.DocObjects.Tables.InstanceDefinitionTable.GetList(System.Boolean)
ignoreDeleted: if true then deleted layers are filtered out
Returns: