Rhino.Geometry.IsoStatus
flags for isoparametric curves
Note: odd values are all "x" = constant and even values > 0 are all "y" = constant

Rhino.Geometry.IsoStatus.None
curve is not an isoparameteric curve

Rhino.Geometry.IsoStatus.X
curve is a "x" = constant (vertical) isoparametric curve in the interior of the surface's domain

Rhino.Geometry.IsoStatus.Y
curve is a "y" = constant (horizontal) isoparametric curve in the interior of the surface's domain

Rhino.Geometry.IsoStatus.West
curve is a "x" = constant isoparametric curve along the west side of the surface's domain

Rhino.Geometry.IsoStatus.South
curve is a "y" = constant isoparametric curve along the south side of the surface's domain

Rhino.Geometry.IsoStatus.East
curve is a "x" = constant isoparametric curve along the east side of the surface's domain

Rhino.Geometry.IsoStatus.North
curve is a "y" = constant isoparametric curve along the north side of the surface's domain