Rhino.DocObjects.Tables.LayerTable.Item(System.Int32)
Conceptually, the layer table is an array of layers.
The operator[] can be used to get individual layers. A layer is
either active or deleted and this state is reported by Layer.IsDeleted
index: zero based array index
Returns:
Refererence to the layer.  If layer_index is out of range, the current
layer is returned. Note that this reference may become invalid after
AddLayer() is called.

Rhino.DocObjects.Tables.LayerTable.Document
Document that owns this table

Rhino.DocObjects.Tables.LayerTable.ActiveCount
Returns number of layers in the layer table, excluding deleted layers

Rhino.DocObjects.Tables.LayerTable.CurrentLayerIndex
At all times, there is a "current" layer.  Unless otherwise specified, new objects
are assigned to the current layer. The current layer is never locked, hidden, or deleted.
Resturns: Zero based layer table index of the current layer

Rhino.DocObjects.Tables.LayerTable.Find(System.String,System.Boolean)
Finds the layer with a given name.
layerName: name of layer to search for. The search ignores case.
ignoreDeletedLayers: true means don't search deleted layers.
Returns:
>=0 index of the layer with the given name
-1  no layer has the given name

Rhino.DocObjects.Tables.LayerTable.Find(System.Guid,System.Boolean)
Find a layer with a matching id
layerId:
ignoreDeletedLayers: If true, deleted layers are not checked
Returns:
>=0 index of the layer with the given name
-1  no layer has the given name

Rhino.DocObjects.Tables.LayerTable.Add(Rhino.DocObjects.Layer)
Adds a new layer with specified definition to the layer table
layer:
definition of new layer. The information in layer is copied. If layer.Name is empty
the a unique name of the form "Layer 01" will be automatically created.
Returns:
>=0 index of new layer
-1  layer not added because a layer with that name already exists.

Rhino.DocObjects.Tables.LayerTable.Add(System.String,System.Drawing.Color)
Adds a new layer with specified definition to the layer table
layerName: Name for new layer. Cannot be a null or zero-length string.
layerColor: Color of new layer. Alpha components will be ignored.
Returns:
>=0 index of new layer
-1  layer not added because a layer with that name already exists.

Rhino.DocObjects.Tables.LayerTable.AddReferenceLayer(Rhino.DocObjects.Layer)
Adds a new reference layer with specified definition to the layer table
Reference layers are not saved in files
layer:
definition of new layer. The information in layer is copied. If layer.Name is empty
the a unique name of the form "Layer 01" will be automatically created.
Returns:
>=0 index of new layer
-1  layer not added because a layer with that name already exists.

Rhino.DocObjects.Tables.LayerTable.Add
Adds a new layer with default definition to the layer table.
Returns: index of new layer

Rhino.DocObjects.Tables.LayerTable.AddReferenceLayer
Adds a new reference layer with default definition to the layer table.
Reference layers are not saved in files
Returns: index of new layer

Rhino.DocObjects.Tables.LayerTable.Modify(Rhino.DocObjects.Layer,System.Int32,System.Boolean)
Modify layer settings
newSettings: This information is copied
layerIndex:
zero based index of layer to set.  This must be in the range 0 <= layerIndex < LayerTable.Count
quiet: if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if layerIndex is out of range or the settings attempt
to lock or hide the current layer.

Rhino.DocObjects.Tables.LayerTable.UndoModify(System.Int32,System.UInt32)
If the layer has been modified and the modifcation can be undone,
then UndoModifyLayer() will restore the layer to its previous state.
layerIndex:
undoRecordSerialNumber:
Returns: true if this layer had been modified and the modifications were undone

Rhino.DocObjects.Tables.LayerTable.Delete(System.Int32,System.Boolean)
Deletes layer
layerIndex:
zero based index of layer to delete. This must be in the range 0 <= layerIndex < LayerTable.Count
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer or it contains active geometry.
Returns:
true if successful. false if layer_index is out of range or the the layer cannot be
deleted because it is the current layer or because it layer contains active geometry.

Rhino.DocObjects.Tables.LayerTable.Undelete(System.Int32)
Undeletes a layer that has been deleted by DeleteLayer().
layerIndex:
zero based index of layer to undelete.
This must be in the range 0 <= layerIndex < LayerTable.Count
Returns: true if successful

Rhino.DocObjects.Tables.LayerTable.GetUnusedLayerName(System.Boolean)
Gets unused layer name used as default when creating new layers.
ignoreDeleted:
if this is true then may use a name used by a deleted layer.
Returns: