Rhino.Geometry.Interval.Item(System.Int32)
Gets or sets the indexed bound of this Interval.
index: Bound index (0 = lower; 1 = upper)

Rhino.Geometry.Interval.Length
Gets the (signed) length of the numeric range.
If the interval is decreasing, a negative length will be returned.

Rhino.Geometry.Interval.IsIncreasing
Returns true if T0 < T1

Rhino.Geometry.Interval.IsDecreasing
Returns true if T[0] > T[1]

Rhino.Geometry.Interval.CompareTo(Rhino.Geometry.Interval)
Returns:
0  this is identical to other
-1  this[0] < other[0]
+1  this[0] > other[0]
-1  this[0] == other[0] and this[1] < other[1]
+1  this[0] == other[0] and this[1] > other[1]

Rhino.Geometry.Interval.Grow(System.Double)
Grow the Interval to include the given number.
value: Number to include in this interval.

Rhino.Geometry.Interval.MakeIncreasing
Ensures this interval is either singleton or increasing.

Rhino.Geometry.Interval.Swap
Swaps T0 and T1.

Rhino.Geometry.Interval.ParameterAt(System.Double)
Convert normalized parameter to interval value, or pair of values.
Returns: Interval parameter min*(1.0-normalizedParameter) + max*normalizedParameter
NormalizedParameterAt

Rhino.Geometry.Interval.ParameterIntervalAt(Rhino.Geometry.Interval)
Convert normalized parameter to interval value, or pair of values.
Returns: Interval parameter min*(1.0-normalizedParameter) + max*normalized_paramete
NormalizedParameterAt

Rhino.Geometry.Interval.NormalizedParameterAt(System.Double)
Convert interval value, or pair of values, to normalized parameter.
Returns: Normalized parameter x so that min*(1.0-x) + max*x = intervalParameter.
ParameterAt

Rhino.Geometry.Interval.NormalizedIntervalAt(Rhino.Geometry.Interval)
Convert interval value, or pair of values, to normalized parameter.
Returns: Normalized parameter x so that min*(1.0-x) + max*x = intervalParameter.
ParameterAt

Rhino.Geometry.Interval.IncludesParameter(System.Double)
Test a parameter for Interval inclusion.
t: Parameter to test.
Returns: True if t is contained within or is coincident with the limits of this Interval.

Rhino.Geometry.Interval.IncludesParameter(System.Double,System.Boolean)
Test a parameter for Interval inclusion.
t: Parameter to test.
strict: If true, the parameter must be fully on the inside of the Interval.
Returns: True if t is contained within the limits of this Interval.

Rhino.Geometry.Interval.IncludesInterval(Rhino.Geometry.Interval)
Test another interval for Interval inclusion.
interval: Interval to test
Returns: True if the other interval is contained within or is coincident with the limits of this Interval.

Rhino.Geometry.Interval.IncludesInterval(Rhino.Geometry.Interval,System.Boolean)
Test another interval for Interval inclusion.
interval: Interval to test.
strict: If true, the other interval must be fully on the inside of the Interval.
Returns: True if the other interval is contained within the limits of this Interval.

Rhino.Geometry.Interval.FromIntersection(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
If the intersection is not empty, then
intersection = [max(a.Min(),b.Min()), min(a.Max(),b.Max())]
The interval [ON.UnsetValue,ON.UnsetValue] is considered to be
the empty set interval.  The result of any intersection involving an
empty set interval or disjoint intervals is the empty set interval.

Rhino.Geometry.Interval.FromUnion(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
The union of an empty set and an increasing interval is the increasing
interval.  The union of two empty sets is empty. The union of an empty
set an a non-empty interval is the non-empty interval.
The union of two non-empty intervals is
union = [min(a.Min(),b.Min()), max(a.Max(),b.Max()),]
Union() returns true if the union is not empty.