Rhino.Geometry.ControlPoint
Represents a geometry control-point.

Rhino.Geometry.ControlPoint.#ctor(System.Double,System.Double,System.Double)
Create a new unweighted Control Point.
x: X coordinate of Control Point.
y: Y coordinate of Control Point.
z: Z coordinate of Control Point.

Rhino.Geometry.ControlPoint.#ctor(System.Double,System.Double,System.Double,System.Double)
Create a new weighted Control Point.
x: X coordinate of Control Point.
y: Y coordinate of Control Point.
z: Z coordinate of Control Point.
weight: Weight factor of Control Point.
You should not use weights equal to or less than zero.

Rhino.Geometry.ControlPoint.#ctor(Rhino.Geometry.Point3d)
Create a new unweighted Control Point.
pt: Coordinate of Control Point.

Rhino.Geometry.ControlPoint.#ctor(Rhino.Geometry.Point3d,System.Double)
Create a new weighted Control Point.
pt: Coordinate of Control Point.
weight: Weight factor of Control Point.
You should not use weights equal to or less than zero.

Rhino.Geometry.ControlPoint.#ctor(Rhino.Geometry.Point4d)
Create a new weighted Control Point.
pt: Control point values.