Rhino.ApplicationSettings.ModelAidSettings.GridSnap
Enables or disables Rhino's grid snap modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.Ortho
Enables or disables Rhino's ortho modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.AltPlusArrow
true mean Alt+arrow is used for nudging.

Rhino.ApplicationSettings.ModelAidSettings.NudgeMode
0 = world, 1 = cplane, 2 = view, 3 = uvn, -1 = not set

Rhino.ApplicationSettings.ModelAidSettings.MousePickboxRadius
radius of mouse pick box in pixels