Rhino.Runtime.PythonScript.Output
By default string output goes to the Rhino.RhinoApp.Write function
Set Output if you want to redirect the output from python to a different function
while this script executes.

Rhino.Runtime.PythonScript.ScriptContextDoc
object set to variable held in scriptcontext.doc