Rhino.DocObjects.ObjectDecoration.StartArrowhead
arrow head at start

Rhino.DocObjects.ObjectDecoration.EndArrowhead
arrow head at end

Rhino.DocObjects.ObjectDecoration.BothArrowhead
arrow head at start and end