Rhino.Geometry.ArcCurve
ArcCurve is used to represent arcs and circles.
ArcCurve.IsCircle returns true if the curve is a complete circle.
Details:
an ArcCurve is a subcurve of a circle, with a constant speed
parameterization. The parameterization is	an affine linear
reparameterzation of the underlying arc	m_arc onto the domain m_t.
A valid ArcCurve has Radius()>0 and  0<AngleRadians()<=2*PI
and a strictly increasing Domain().

Rhino.Geometry.ArcCurve.Arc
Gets or sets the Arc that is contained within this ArcCurve.