Rhino.Geometry.Interpolator.#ctor
Create a new, empty Interpolator.

Rhino.Geometry.Interpolator.#ctor(System.Int32)
Create an empty Interpolator with a certain capacity.
initialCapacity: Number of items this interpolator can store without resizing.

Rhino.Geometry.Interpolator.#ctor(System.Collections.Generic.IEnumerable{System.Double})
Create an Interpolator from a collection of numbers.
collection: Collection of numbers to duplicate.

Rhino.Geometry.Interpolator.#ctor(System.Int32,System.Double)
Create a new Interpolator with a specified amount of numbers.
amount: Number of values to add to this Interpolator. Must be equal to or larger than zero.
defaultValue: Number to add.