Rhino.DocObjects.Tables.BitmapTable
Store the list of bitmaps in a Rhino document

Rhino.DocObjects.Tables.BitmapTable.Document
Document that owns this bitmap table

Rhino.DocObjects.Tables.BitmapTable.Count
Number of bitmaps in the table

Rhino.DocObjects.Tables.BitmapTable.AddBitmap(System.String,System.Boolean)
Adds a new bitmap with specified name to the bitmap table
bitmapFilename:
If NULL or empty, then a unique name of the form "Bitmap 01" will be automatically created.
replaceExisting:
If true and the there is alread a bitmap using the specified name, then that bitmap is replaced.
If false and there is already a bitmap using the specified name, then -1 is returned.
Returns:
index of new bitmap in table on success. -1 on error

Rhino.DocObjects.Tables.BitmapTable.DeleteBitmap(System.String)
deletes bitmap
bitmapFilename:
Returns:
true if successful. false if the bitmap cannot be deleted because it
is the current bitmap or because it bitmap contains active geometry.

Rhino.DocObjects.Tables.BitmapTable.ExportToFiles(System.String,System.Int32)
Export all the bitmaps in the table to files
directoryPath:
full path to the directory where the bitmaps should be saved.
If NULL, a dialog is used to interactively get the directory name.
overwrite: 0 = no, 1 = yes, 2 = ask
Returns: Number of bitmaps written

Rhino.DocObjects.Tables.BitmapTable.ExportToFile(System.Int32,System.String)
Write a bitmap to a file
index:
path:
full path, including file name and extension, name of the file to write
Returns: true if successful