Rhino.DocumentSaveEventArgs
Provides document information for RhinoDoc events

Rhino.DocumentSaveEventArgs.FileName
Name of file being written

Rhino.DocumentSaveEventArgs.ExportSelected
True if only selected objects are being written to a file