Rhino.DocObjects.ObjectAttributes.Visible
object visibility

Rhino.DocObjects.ObjectAttributes.DisplayMode
objects can be displayed in one of three ways: wireframe, shaded, or render preview.
If the display mode is ON::default_display, then the display mode of the viewport
detrmines how the object is displayed. If the display mode is ON::wireframe_display,
ON::shaded_display, or ON::renderpreview_display, then the object is forced to
display in that mode.

Rhino.DocObjects.ObjectAttributes.ObjectId
Every object has a UUID (universally unique identifier). The default value is Guid.Empty.
When an object is added to a model, the value is checked.  If the value is NULL, a
new UUID is created. If the value is not NULL but it is already used by another object
in the model, a new UUID is created. If the value is not NULL and it is not used by
another object in the model, then that value persists. When an object is updated, by
a move for example, the value of ObjectId persists.

Rhino.DocObjects.ObjectAttributes.Name
objects have optional text names.  More than one object in
a model can have the same name and some objects may have no name.

Rhino.DocObjects.ObjectAttributes.LayerIndex
Layer definitions in an OpenNURBS model are stored in a layer table.
The layer table is conceptually an array of ON_Layer classes.  Every
OpenNURBS object in a model is on some layer.  The object's layer
is specified by zero based indicies into the ON_Layer array.

Rhino.DocObjects.ObjectAttributes.LinetypeIndex
Linetype definitions in an OpenNURBS model are stored in a linetype table.
The linetype table is conceptually an array of ON_Linetype classes. Every
OpenNURBS object in a model references some linetype.  The object's linetype
is specified by zero based indicies into the ON_Linetype array.
index 0 is reserved for continuous linetype (no pattern)

Rhino.DocObjects.ObjectAttributes.MaterialIndex
If you want something simple and fast, set m_material_index to the index of
the rendering material and ignore m_rendering_attributes. If you are developing
a high quality plug-in renderer, and a user is assigning one of your fabulous
rendering materials to this object, then add rendering material information to
the m_rendering_attributes.m_materials[] array.

Rhino.DocObjects.ObjectAttributes.MaterialSource
Determine if the simple material should come from the object or from it's layer.
High quality rendering plug-ins should use m_rendering_attributes.

Rhino.DocObjects.ObjectAttributes.WireDensity
When a surface object is displayed in wireframe, m_wire_density controls
how many isoparametric wires are used.
value    number of isoparametric wires
0        boundary and knot wires
1        boundary and knot wires and, if there are no interior knots, a single interior wire.
N>=2     boundary and knot wires and (N+1) interior wires

Rhino.DocObjects.ObjectAttributes.GroupCount
number of groups object belongs to

Rhino.DocObjects.ObjectAttributes.Duplicate
Create a copy of this ObjectAttributes
Returns:

Rhino.DocObjects.ObjectAttributes.GetGroupList
Returns an array of GroupCount group indices.  If GroupCount is zero, then GetGroupList() returns null.
Returns:

Rhino.DocObjects.ObjectAttributes.AddToGroup(System.Int32)
Adds object to the group with specified index by appending index to
group list (If the object is already in group, nothing is changed.)
groupIndex:

Rhino.DocObjects.ObjectAttributes.RemoveFromGroup(System.Int32)
removes object from the group with specified index. If the
object is not in the group, nothing is changed.
groupIndex:

Rhino.DocObjects.ObjectAttributes.RemoveFromAllGroups
Removes object from all groups

Rhino.DocObjects.ObjectAttributes.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry
key: id used to retrieve this string
value: string associated with key
Returns: true on success

Rhino.DocObjects.ObjectAttributes.GetUserString(System.String)
Get user string
key: id used to retrieve the string
Returns: string associated with the key if successful. null if no key was found

Rhino.DocObjects.ObjectAttributes.GetUserStrings
Get all (key, value) user strings attached
Returns: