Rhino.Geometry.Vector3d.Item(System.Int32)
Gets or sets the component at the given index.
index: Index of vector component. Valid values are:
0 = X-component1 = Y-component2 = Z-component

Rhino.Geometry.Vector3d.X
Gets or sets the X component of the vector.

Rhino.Geometry.Vector3d.Y
Gets or sets the Y component of the vector.

Rhino.Geometry.Vector3d.Z
Gets or sets the Z component of the vector.

Rhino.Geometry.Vector3d.IsValid
Gets a value indicating whether this vector is valid.
A valid vector must contain valid numbers for x, y and z.

Rhino.Geometry.Vector3d.MinimumCoordinate
Gets the value of the smallest component.

Rhino.Geometry.Vector3d.MaximumCoordinate
Gets the value of the largest component.

Rhino.Geometry.Vector3d.Length
Gets the length of this vector.

Rhino.Geometry.Vector3d.SquareLength
Gets the squared length of this vector.

Rhino.Geometry.Vector3d.IsUnitVector
Gets a value indicating whether or not this is a unit vector.
A unit vector has a length of 1.0.

Rhino.Geometry.Vector3d.Multiply(Rhino.Geometry.Vector3d,System.Double)
provided for languages that do not support operator overloading
vector:
t:
Returns:

Rhino.Geometry.Vector3d.Multiply(System.Double,Rhino.Geometry.Vector3d)
provided for languages that do not support operator overloading
t:
vector:
Returns:

Rhino.Geometry.Vector3d.Divide(Rhino.Geometry.Vector3d,System.Double)
provided for languages that do not support operator overloading
vector:
t:
Returns:

Rhino.Geometry.Vector3d.Add(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
provided for languages that do not support operator overloading
vector1:
vector2:
Returns:

Rhino.Geometry.Vector3d.Subtract(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
provided for languages that do not support operator overloading
vector1:
vector2:
Returns:

Rhino.Geometry.Vector3d.Multiply(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
provided for languages that do not support operator overloading
vector1:
vector2:
Returns:

Rhino.Geometry.Vector3d.Negate(Rhino.Geometry.Vector3d)
provided for languages that do not support operator overloading
vector:
Returns:

Rhino.Geometry.Vector3d.CrossProduct(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Compute the Cross Product of two vectors.
The cross product is a vector that is perpendicular to both a and b.
a: First vector for cross product.
b: Second vector for cross product.
Returns: The cross product of a and b

Rhino.Geometry.Vector3d.VectorAngle(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Compute the angle between two vectors.
a: First vector for angle.
b: Second vector for angle.
Returns: The angle (in radians) between a and b or RhinoMath.UnsetValue if the input is invalid.

Rhino.Geometry.Vector3d.IsTiny(System.Double)
Test a vector to see if it is very short.
tolerance:
A nonzero value used as the coordinate zero tolerance.
Returns: (Math.Abs(X) <= tiny_tol) AND (Math.Abs(Y) <= tiny_tol) AND (Math.Abs(Z) <= tiny_tol)

Rhino.Geometry.Vector3d.Unitize
Unitize this vector. A unit vector has a length of 1.0.
An invalid or zero length vector cannot be unitized.
Returns: True on success, false on failure.

Rhino.Geometry.Vector3d.Transform(Rhino.Geometry.Transform)
Transform the vector in place. The transformation matrix acts on
the left of the vector; i.e., result = transformation*vector
transformation: Transformation matrix to apply.

Rhino.Geometry.Vector3d.Rotate(System.Double,Rhino.Geometry.Vector3d)
Rotate this vector around an axis.
angleRadians: Angle of rotation (in radians).
rotationAxis: Axis of rotation.
Returns: True on success, false on failure.

Rhino.Geometry.Vector3d.Reverse
Reverse (invert) this vector. If this vector is invalid, the
reverse will also be invalid and false will be returned.
Returns: True on success, false if the vector is invalid.

Rhino.Geometry.Vector3d.IsParallelTo(Rhino.Geometry.Vector3d)
Test to see whether this vector is parallel to within one degree of another one.
other: Vector to compare to.
Returns:
Parallel indicator:
+1 = both vectors are parallel.0 = vectors are not parallel or at least one of the vectors is zero.-1 = vectors are anti-parallel.

Rhino.Geometry.Vector3d.IsParallelTo(Rhino.Geometry.Vector3d,System.Double)
Test to see whether this vector is parallel to within a custom angle tolerance of another one.
other: Vector to compare to.
angleTolerance: Angle tolerance (in radians)
Returns:
Parallel indicator:
+1 = both vectors are parallel.0 = vectors are not parallel or at least one of the vectors is zero.-1 = vectors are anti-parallel.

Rhino.Geometry.Vector3d.IsPerpendicularTo(Rhino.Geometry.Vector3d)
Test to see whether this vector is perpendicular to within one degree of another one.
other: Vector to compare to.
Returns: True if both vectors are perpendicular, false if otherwise.

Rhino.Geometry.Vector3d.IsPerpendicularTo(Rhino.Geometry.Vector3d,System.Double)
Test to see whether this vector is perpendicular to within a custom angle tolerance of another one.
other: Vector to compare to.
angleTolerance: Angle tolerance (in radians)
Returns: True if both vectors are perpendicular, false if otherwise.

Rhino.Geometry.Vector3d.PerpendicularTo(Rhino.Geometry.Vector3d)
Set this vector to be perpendicular to another vector.
Result is not unitized.
other:
Returns: True on success, false if input vector is zero or invalid.