Rhino.Input.Custom.OptionDouble.#ctor(System.Double,System.Double,System.Double)
initialValue:
lowerLimit:
upperLimit:

Rhino.Input.Custom.OptionDouble.#ctor(System.Double,System.Boolean,System.Double)
initialValue:
setLowerLimit:
if true, limit sets the lower limit and upper limit is undefined
if false, limit sets the upper limit and lower limit is undefined
limit: