Rhino.Geometry.NurbsCurve.#ctor(System.Int32,System.Int32)
Create a new Nurbscurve with a specific degree and control-point count.
degree: Degree of curve. Must be equal to or larger than 1 and smaller than or equal to 11.
pointCount: Number of control-points.

Rhino.Geometry.NurbsCurve.#ctor(System.Int32,System.Boolean,System.Int32,System.Int32)
Create a new NurbsCurve with knot and CV memory allocated
dimension: >=1
rational: true to make a rational NURBS
order: (>= 2) The order=degree+1
pointCount: (>= order) number of control vertices

Rhino.Geometry.NurbsCurve.Order
Gets the order of the curve. Order = Degree + 1

Rhino.Geometry.NurbsCurve.CreateFromLine(Rhino.Geometry.Line)
Get a non-rational, degree 1 Nurbs curve representation of the line.
Returns: Curve on success, null on failure.

Rhino.Geometry.NurbsCurve.CreateFromArc(Rhino.Geometry.Arc)
Get a rational degree 2 NURBS curve representation
of the arc. Note that the parameterization of NURBS curve
does not match arc's transcendental paramaterization.
Returns: Curve on success, null on failure.

Rhino.Geometry.NurbsCurve.CreateFromCircle(Rhino.Geometry.Circle)
Get a rational degree 2 NURBS curve representation
of the circle. Note that the parameterization of NURBS curve
does not match circle's transcendental paramaterization.
Use GetRadianFromNurbFormParameter() and
GetParameterFromRadian() to convert between the NURBS curve
parameter and the transcendental parameter.
Returns: Curve on success, null on failure

Rhino.Geometry.NurbsCurve.CreateFromEllipse(Rhino.Geometry.Ellipse)
Get a rational degree 2 NURBS curve representation
of the ellipse. Note that the parameterization of NURBS curve
does not match ellsipses transcendental paramaterization.
Returns: Curve on success, null on failure

Rhino.Geometry.NurbsCurve.IsDuplicate(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsCurve,System.Boolean,System.Double)
Test two curves for similarity.
curveA: First curve used in comparison.
curveB: Second curve used in comparison.
ignoreParameterization: if true, parameterization and orientaion are ignored.
tolerance: tolerance to use when comparing control points.
Returns: true if curves are similar within tolerance.

Rhino.Geometry.NurbsCurve.Create(System.Boolean,System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Create a 3D NURBS curve from a list of control points
periodic: If true, create a periodic uniform curve. If false, create a clamped uniform curve
degree: (>=1) degree=order-1
points: control vertex locations
Returns:
new NURBS curve on success
null on error

Rhino.Geometry.NurbsCurve.IncreaseDegree(System.Int32)
Increase the degree of this curve.
desiredDegree: The desired degree.
Degrees should be number between and including 1 and 11.
Returns: True on success, false on failure.

Rhino.Geometry.NurbsCurve.MakePiecewiseBezier(System.Boolean)
Clamps ends and adds knots so the NURBS curve has bezier spans
(all distinct knots have multiplitity = degree).
setEndWeightsToOne:
If true and the first or last weight is not one, then the first and
last spans are reparameterized so that the end weights are one.
Returns: True on success, false on failure.

Rhino.Geometry.NurbsCurve.Reparameterize(System.Double)
Use a linear fractional transformation to reparameterize the NURBS curve.
This does not change the curve's domain.
c:
reparameterization constant (generally speaking, c should be > 0). The
control points and knots are adjusted so that
output_nurbs(t) = input_nurbs(lambda(t)), where lambda(t) = c*t/( (c-1)*t + 1 ).
Note that lambda(0) = 0, lambda(1) = 1, lambda'(t) > 0,
lambda'(0) = c and lambda'(1) = 1/c.
Returns: true if successful
Remarks:
The cv and knot values are values are changed so that output_nurbs(t) = input_nurbs(lambda(t)).

Rhino.Geometry.NurbsCurve.GrevilleParameter(System.Int32)
Get the greville (edit point) parameter that belongs
to the control point at the specified index.
index: Index of Greville (Edit) point.

Rhino.Geometry.NurbsCurve.GrevillePoint(System.Int32)
Get the greville (edit point) parameter that belongs
to the control point at the specified index.
index: Index of Greville (Edit) point.

Rhino.Geometry.NurbsCurve.GrevilleParameters
Get all Greville (Edit point) parameters for this curve.

Rhino.Geometry.NurbsCurve.GrevillePoints
Get all Greville (Edit) points for this curve.