Rhino.Geometry.Ellipse.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Create a new Ellipse from base plane and both principal radii.
plane: Base plane of ellipse.
radius1: Ellipse radius along base plane X direction.
radius2: Ellipse radius along base plane Y direction.

Rhino.Geometry.Ellipse.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Create a new Ellipse from three points.
center:
second:
third:

Rhino.Geometry.Ellipse.Plane
Gets or sets the Base pane of the Ellipse.

Rhino.Geometry.Ellipse.Radius1
Gets or sets the Radius of the ellipse along the Base plane X direction.

Rhino.Geometry.Ellipse.Radius2
Gets or sets the Radius of the ellipse along the Base plane Y direction.

Rhino.Geometry.Ellipse.ToNurbsCurve
Create a nurbs curve representation of this ellipse.
This amounts to the same as calling NurbsCurve.CreateFromEllipse().
Returns: A nurbs curve representation of this ellipse or null if no such representation could be made.