Rhino.DocObjects.Tables.MaterialTable.Item(System.Int32)
Conceptually, the material table is an array of materials.
The operator[] can be used to get individual materials. A material is
either active or deleted and this state is reported by Material.IsDeleted
index: zero based array index
Returns:
If index is out of range, the current material is returned.

Rhino.DocObjects.Tables.MaterialTable.Document
Document that owns this table

Rhino.DocObjects.Tables.MaterialTable.CurrentMaterialSource


Rhino.DocObjects.Tables.MaterialTable.Add
Adds a new material to the table based on the default material
Returns:

Rhino.DocObjects.Tables.MaterialTable.Find(System.String,System.Boolean)
Finds a meterial with a given name
materialName: Name of the material to search for. The search ignores case.
ignoreDeletedMaterials: true means don't search deleted materials
Returns:
>=0 index of the material with the given name
-1  no material has the given name

Rhino.DocObjects.Tables.MaterialTable.Find(System.Guid,System.Boolean)
Find a material with a matching id
materialId:
ignoreDeletedMaterials: If true, deleted materials are not checked
Returns:
>=0 index of the material with the given name
-1  no material has the given name

Rhino.DocObjects.Tables.MaterialTable.Modify(Rhino.DocObjects.Material,System.Int32,System.Boolean)
Modify material settings
newSettings: This information is copied
materialIndex:
zero based index of material to set.  This must be in the range 0 <= layerIndex < MaterialTable.Count
quiet: if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if materialIndex is out of range or the settings attempt
to lock or hide the current material.