Rhino.PersistentSettingsManager.ReadSettings
Reads existing settings for a plugin and its associated commands.
Clears the dirty flag for the settings.
Returns:
True if settings are successfully read. False if there was no existing
settings file to read, or if a read lock could not be acquired.

Rhino.PersistentSettingsManager.WriteSettings
Flushes the current settings to the user's roaming directory.
If an xml file for the guid already exists, it attempts to update
the file in order to maintain comments, etc. If the xml is corrupt
or the file does not exist, it writes out a new file.
Returns:
True if settings where flushed to disk, otherwise false.