Rhino.Commands.Result.Success
command worked

Rhino.Commands.Result.Cancel
user canceled command

Rhino.Commands.Result.Nothing
command did nothing but cancel was not pressed

Rhino.Commands.Result.Failure
command failed (bad input, computational problem, etc.)

Rhino.Commands.Result.UnknownCommand
command not found (user probably had a typo in command name)

Rhino.Commands.Result.ExitRhino
exit RhinoCommon