Rhino.Geometry.Box
Represents an orthogonal, oriented box that is not tied to the World Axis directions.

Rhino.Geometry.Box.#ctor(Rhino.Geometry.BoundingBox)
Create a new Box that mimics a BoundingBox struct.
The orientation plane of the Box will be coincident with the
World XY plane.
bbox: BoundingBox to mimic.

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Create a new box from a base Plane and three Intervals.
basePlane: Orientation plane of the box.
xSize: Dimensions along the base plane X-Axis.
ySize: Dimensions along the base plane Y-Axis.
zSize: Dimensions along the base plane Z-Axis.

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Create an aligned Boundingbox for a set of points.
basePlane: Orientation of the box.
points: Points to include, Invalid points will be ignored.

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.GeometryBase)
Create an aligned boundingbox for a generic piece of geometry.
basePlane: Base plane for aligned bounding box.
geometry: Geometry to box.

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.BoundingBox)
Create a world aligned box from a base plane and a boundingbox.
basePlane: Base plane of bounging box.
boundingbox: Bounding Box in plane coordinates.

Rhino.Geometry.Box.PointAt(System.Double,System.Double,System.Double)
Evaluate the Box volume at the given unitized parameters.
x: Unitized parameter along Box X direction.
y: Unitized parameter along Box Y direction.
z: Unitized parameter along Box Z direction.
Returns: The point at (x,y,z).

Rhino.Geometry.Box.ClosestPoint(Rhino.Geometry.Point3d)
Find the closest point on or in the Box. The box should be Valid for this to work.
point: Sample point.
Returns: The point on or in the box that is closest to the sample point.

Rhino.Geometry.Box.FurthestPoint(Rhino.Geometry.Point3d)
Find the furthest point on the Box. The Box should be Valid for this to work properly.
point: Sample point.
Returns: The point on the box that is furthest from the sample point.

Rhino.Geometry.Box.Inflate(System.Double)
Inflate the box with equal amounts in all directions.
Inflating with negative amounts may result in decreasing boxes.
InValid boxes can not be inflated.
amount: Amount (in model units) to inflate this box in all directions.

Rhino.Geometry.Box.Inflate(System.Double,System.Double,System.Double)
Inflate the box with custom amounts in all directions.
Inflating with negative amounts may result in decreasing boxes.
InValid boxes can not be inflated.
xAmount: Amount (in model units) to inflate this box in the x direction.
yAmount: Amount (in model units) to inflate this box in the y direction.
zAmount: Amount (in model units) to inflate this box in the z direction.

Rhino.Geometry.Box.Contains(Rhino.Geometry.Point3d)
Test a point for Box inclusion. This is the same as calling Contains(point,false)
point: Point to test.
Returns: True if the point is on the inside of or coincident with this Box.

Rhino.Geometry.Box.Contains(Rhino.Geometry.Point3d,System.Boolean)
Test a point for Box inclusion.
point: Point to test.
strict: If true, the point needs to be fully on the inside of the Box.
I.e. coincident points will be considered 'outside'.
Returns: True if the point is (strictly) on the inside of this Box.

Rhino.Geometry.Box.Contains(Rhino.Geometry.BoundingBox)
Test a boundingbox for Box inclusion. This is the same as calling Contains(box,false)
box: Box to test.
Returns: True if the box is on the inside of or coincident with this Box.

Rhino.Geometry.Box.Contains(Rhino.Geometry.BoundingBox,System.Boolean)
Test a boundingbox for Box inclusion.
box: Box to test.
strict: If true, the boundingbox needs to be fully on the inside of this Box.
I.e. coincident boxes will be considered 'outside'.
Returns: True if the box is (strictly) on the inside of this Box.

Rhino.Geometry.Box.Contains(Rhino.Geometry.Box)
Test a box for Box inclusion. This is the same as calling Contains(box,false)
box: Box to test.
Returns: True if the box is on the inside of or coincident with this Box.

Rhino.Geometry.Box.Contains(Rhino.Geometry.Box,System.Boolean)
Test a box for Box inclusion.
box: Box to test.
strict: If true, the box needs to be fully on the inside of this Box.
I.e. coincident boxes will be considered 'outside'.
Returns: True if the box is (strictly) on the inside of this Box.

Rhino.Geometry.Box.Union(Rhino.Geometry.Point3d)
Create a union between this Box and the given point.
This essentially grows the Box until it contains the point.
point: Point to include.

Rhino.Geometry.Box.MakeValid
Attempts to make the Box valid. This is not always possible.
Returns: True if the box was made valid, or if it was valid to begin with.
False if the box remains in a differently abled state.

Rhino.Geometry.Box.Transform(Rhino.Geometry.Transform)
Transform this Box using a Transformation matrix. If the Transform does not preserve
Similarity, the dimensions of the resulting box cannot be trusted.
xform: Transformation matrix to apply to this Box.
Returns: True if the Box was successfully transformed, False if otherwise.

Rhino.Geometry.Box.RepositionBasePlane(Rhino.Geometry.Point3d)
Reposition the origin of the Base plane for this box without affecting
the physical dimensions.
origin: The new base plane origin.

Rhino.Geometry.Box.ToBrep
Create a Brep representation of this Box.
Returns: A Brep representation of this box or null.