Rhino.Geometry.AnnotationBase.NumericValue
Return depends on geometry type.
LinearDimension = Distance between arrow tips,
RadialDimension = radius or diamater depending on type
AngularDimension = angle in degrees
Leader or Text = UnsetValue

Rhino.Geometry.AnnotationBase.TextHeight
Text height in model units

Rhino.Geometry.AnnotationBase.Plane
Plane containing the annotation