Rhino.Geometry.Sphere.#ctor(Rhino.Geometry.Point3d,System.Double)


Rhino.Geometry.Sphere.Diameter
Gets or sets the diameter for this Sphere.

Rhino.Geometry.Sphere.Radius
Gets or sets the Radius for this Sphere.

Rhino.Geometry.Sphere.Center
Gets or sets the center point for the sphere.

Rhino.Geometry.Sphere.NorthPole
Gets the point at the North Pole of the sphere.

Rhino.Geometry.Sphere.SouthPole
Gets the point at the South Pole of the sphere.

Rhino.Geometry.Sphere.PointAt(System.Double,System.Double)
longitudeRadians: [0,2pi]
latitudeRadians: [-pi/2,pi/2]
Returns:

Rhino.Geometry.Sphere.NormalAt(System.Double,System.Double)
longitudeRadians: [0,2pi]
latitudeRadians: [-pi/2,pi/2]
Returns:

Rhino.Geometry.Sphere.ClosestPointTo(Rhino.Geometry.Point3d)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Sphere.ClosestPoint(Rhino.Geometry.Point3d)
returns point on sphere that is closest to given point
testPoint:
Returns:

Rhino.Geometry.Sphere.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d)
Rotate the sphere about the center point.
sinAngle: sin(angle)
cosAngle: cos(angle)
axisOfRotation:

Rhino.Geometry.Sphere.Rotate(System.Double,Rhino.Geometry.Vector3d)
Rotate the sphere about the center point.
angleRadians: Angle of rotation (in radians)
axisOfRotation: Rotation axis.

Rhino.Geometry.Sphere.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotate the sphere about a point and an axis.
sinAngle: sin(angle)
cosAngle: cod(angle)
axisOfRotation: Axis of rotation.
centerOfRotation: Center of rotation.

Rhino.Geometry.Sphere.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
rotate sphere about a point and axis
angleRadians: Rotation angle (in Radians)
axisOfRotation: Axis of rotation.
centerOfRotation: Center of rotation.

Rhino.Geometry.Sphere.Translate(Rhino.Geometry.Vector3d)
Translate (move) the sphere along a motion vector.
delta: Motion vector.

Rhino.Geometry.Sphere.Transform(Rhino.Geometry.Transform)
Transform the Sphere. Note that non-similarity preserving transformations
cannot be applied to a sphere as that would result in an ellipsoid.
xform: Transformation matrix to apply.
Returns: True on success, false on failure.

Rhino.Geometry.Sphere.ToNurbsSurface
Convert this Sphere to a NurbsSurface representation.
This is synonymous with calling NurbsSurface.CreateFromSphere().
Returns: A nurbs surface representation of this sphere or null.

Rhino.Geometry.Sphere.ToRevSurface
Convert this Sphere to a RevSurface representation.
This is synonymous with calling RevSurface.CreateFromSphere().
Returns: A surface of revolution representation of this sphere or null.