Rhino.Input.Custom.GetInteger
used to get integer numbers

Rhino.Input.Custom.GetInteger.Get
Call to get an integer
Returns:

Rhino.Input.Custom.GetInteger.SetLowerLimit(System.Int32,System.Boolean)
Set a lower limit on the number that can be returned.
By default there is no lower limit.
lowerLimit: smallest acceptable number
strictlyGreaterThan:
If true, then the returned number will be > lower_limit

Rhino.Input.Custom.GetInteger.SetUpperLimit(System.Int32,System.Boolean)
Set an upper limit on the number that can be returned.
By default there is no upper limit.
upperLimit: largest acceptable number
strictlyLessThan: If true, then the returned number will be < upper_limit