Rhino.DocObjects.ConstructionPlane.GridSpacing
distance between grid lines

Rhino.DocObjects.ConstructionPlane.GridLineCount
number of grid lines in each direction

Rhino.DocObjects.ConstructionPlane.ThickLineFrequency
0: none,
1: all lines are thick,
2: every other is thick, ...

Rhino.DocObjects.ConstructionPlane.DepthBuffered
false=grid is always drawn behind 3d geometry
true=grid is drawn at its depth as a 3d plane and grid lines obscure things behind the grid.