Rhino.ApplicationSettings.FileSettings.AutoSaveInterval
how often the document will be saved when Rhino's automatic file saving mechanism is enabled

Rhino.ApplicationSettings.FileSettings.AutoSaveMeshes
save render and display meshes in autosave file

Rhino.ApplicationSettings.FileSettings.SaveViewChanges
true for users who consider view changes a document change

Rhino.ApplicationSettings.FileSettings.FileLockingEnabled
Ensure that only one person at a time can have a file open for saving

Rhino.ApplicationSettings.FileSettings.FileLockingOpenWarning
Display information dialog which identifies computer file is open on

Rhino.ApplicationSettings.FileSettings.ClipboardCopyToPreviousRhinoVersion
Copy both objects to the clipboard in both the current and previous Rhino clipboard formats.  This
means you will double the size of what is saved in the clipboard but will be able to copy from
the current to the previous version using the clipboard.

Rhino.ApplicationSettings.FileSettings.ExecutableFolder
Returns directory where the main Rhino executable is located

Rhino.ApplicationSettings.FileSettings.InstallFolder
Returns Rhino's installation folder

Rhino.ApplicationSettings.FileSettings.AddSearchPath(System.String,System.Int32)
Adds a new imagePath to Rhino's search imagePath list.
See "Options Files settings" in the Rhino help file for more details.
folder: [in] The valid folder, or imagePath, to add.
index:
[in] A zero-based position index in the search imagePath list to insert the string.
If -1, the imagePath will be appended to the end of the list.
Returns:
the index where the item was inserted if success
-1 on failure

Rhino.ApplicationSettings.FileSettings.FindFile(System.String)
Searches for a file using Rhino's search imagePath. Rhino will look for a file in the following locations:
1. The current document's folder.
2. Folder's specified in Options dialog, File tab.
3. Rhino's System folders
fileName: short file name to search for
Returns:  full imagePath on success; null on error

Rhino.ApplicationSettings.FileSettings.AutoSaveBeforeCommands
Input list of commands that force AutoSave prior to running

Rhino.ApplicationSettings.FileSettings.SetAutoSaveBeforeCommands(System.String[])
Set list of commands that force AutoSave prior to running