Rhino.Collections.ArchivableDictionary
Dictionary Structure
BEGINCHUNK (TCODE_ANONYMOUS_CHUNK)
|- version (int)
|- entry count (int)
for entry count entries
|- BEGINCHUNK (TCODE_ANONYMOUS_CHUNK)
|- type (OnBinaryArchiveDictionary::ItemType)
|- key (string)
|- entry contents
|- ENDCHUNK (TCODE_ANONYMOUS_CHUNK)
ENDCHUNK (TCODE_ANONYMOUS_CHUNK)

Rhino.Collections.ArchivableDictionary.#ctor
Create an instance of a dictionary for writing to a 3dm archive

Rhino.Collections.ArchivableDictionary.#ctor(System.Int32)
Create an instance of a dictionary for writing to a 3dm archive
version:
Custom version used to help the plug-in developer determine which version of
a dictionary is being written. One good way to write version information is to
use a date style integer (YYYYMMDD)

Rhino.Collections.ArchivableDictionary.#ctor(System.Int32,System.String)
Create an instance of a dictionary for writing to a 3dm archive
version:
custom version used to help the plug-in developer determine which version of
a dictionary is being written. One good way to write version information is to
use a date style integer (YYYYMMDD)
name:
Optional name to associate with this dictionary.
NOTE: if this dictionary is set as a subdictionary, the name will be changed to
the subdictionary key entry

Rhino.Collections.ArchivableDictionary.Keys
Entry names

Rhino.Collections.ArchivableDictionary.Read(Rhino.FileIO.BinaryArchiveReader)
Read a dictionary from an archive.
archive:
The archive to read from. The archive position should be at the beginning of
the dictionary
Returns: new filled dictionary on success. null on failure

Rhino.Collections.ArchivableDictionary.Write(Rhino.FileIO.BinaryArchiveWriter)
Write this dictionary to an archive
archive: The archive to write to
Returns: true on success