Rhino.Geometry.Hatch
Represents a hatch in planar boundary loop or loops.
This is a 2d entity with a plane defining a local coordinate system.
The loops, patterns, angles, etc are all in this local coordinate system.
The Hatch object manages the plane and loop array
Fill definitions are in the HatchPattern or class derived from HatchPattern
Hatch has an index to get the pattern definition from the pattern table