Rhino.DocObjects.Tables.HatchPatternTable
All of the hatch pattern definitions contained in a rhino document

Rhino.DocObjects.Tables.HatchPatternTable.Item(System.Int32)
Conceptually, the hatch pattern table is an array of hatch patterns.
The operator[] can be used to get individual hatch patterns. A hatch pattern is
either active or deleted and this state is reported by HatchPattern.IsDeleted
index: zero based array index
Returns:
If index is out of range, the current hatch pattern is returned

Rhino.DocObjects.Tables.HatchPatternTable.Document
Document that owns this table

Rhino.DocObjects.Tables.HatchPatternTable.Count
Number of patterns in the table

Rhino.DocObjects.Tables.HatchPatternTable.Find(System.String,System.Boolean)
Finds the hatch pattern with a given name. Search ignores case.
name:
ignoreDeleted: true means don't search deleted hatch patterns
Returns: index of the hatch pattern with the given name. -1 if no hatch pattern found

Rhino.DocObjects.Tables.HatchPatternTable.Add(Rhino.DocObjects.HatchPattern)
Adds a new hatch pattern with specified definition to the table
pattern:
definition of new hatch pattern. The information in pattern is copied.
If patern.Name is empty the a unique name of the form "HatchPattern 01"
will be automatically created.
Returns:
>=0 index of new hatch pattern
-1  not added because a hatch pattern with that name already exists or
some other problem occured