Rhino.Display.CustomDisplay.#ctor(System.Boolean)
Construct a new CustomDisplay instance. You must place a call to
Dispose() when you are done with this instance, otherwise
the display methods will never be switched off.
enable: If True, the display will be enabled immediately.

Rhino.Display.CustomDisplay.AddPoint(Rhino.Geometry.Point3d)
Add a new, black point to the display list.
point: Point to add.

Rhino.Display.CustomDisplay.AddPoint(Rhino.Geometry.Point3d,System.Drawing.Color)
Add a new coloured point to the display list.
point: Point to add.
color: Color of point.

Rhino.Display.CustomDisplay.AddPoint(Rhino.Geometry.Point3d,System.Drawing.Color,Rhino.Display.PointStyle,System.Int32)
Add a new stylized point to the display list.
point: Point to add.
color: Color of point.
style: Display style of point.
radius: Radius of point widget.

Rhino.Display.CustomDisplay.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Add a collection of black points to the display list.
points: Points to add.

Rhino.Display.CustomDisplay.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color)
Add a collection of coloured points to the display list.
points: Points to add.
color: Color of points.

Rhino.Display.CustomDisplay.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,Rhino.Display.PointStyle,System.Int32)
Add a collection of stylized points to the display list.
points: Points to add.
color: Color of points.
style: Display style of points.
radius: Radius of point widgets.

Rhino.Display.CustomDisplay.AddLine(Rhino.Geometry.Line)
Add a new, black line to the display list.
line: Line to add

Rhino.Display.CustomDisplay.AddLine(Rhino.Geometry.Line,System.Drawing.Color)
Add a new, colored line to the display list.
line: Line to add.
color: Color of line.

Rhino.Display.CustomDisplay.AddLine(Rhino.Geometry.Line,System.Drawing.Color,System.Int32)
Add a new, colored line to the display list.
line: Line to add.
color: Color of line.
thickness: Thickness of line.

Rhino.Display.CustomDisplay.AddVector(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Add a new, black vector to the display list.
anchor: Anchor point of vector.
span: Direction and magnitude of vector.

Rhino.Display.CustomDisplay.AddVector(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)
Add a new, colored vector to the display list.
anchor: Anchor point of vector.
span: Direction and magnitude of vector.
color: Color of vector.

Rhino.Display.CustomDisplay.AddVector(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Boolean)
Add a new, colored vector to the display list.
anchor: Anchor point of vector.
span: Direction and magnitude of vector.
color: Color of vector.
drawAnchor: Include a point at the vector anchor.

Rhino.Display.CustomDisplay.AddArc(Rhino.Geometry.Arc)
Add a new, black arc to the display list.
arc: Arc to add

Rhino.Display.CustomDisplay.AddArc(Rhino.Geometry.Arc,System.Drawing.Color)
Add a new, colored arc to the display list.
arc: Arc to add.
color: Color of arc.

Rhino.Display.CustomDisplay.AddArc(Rhino.Geometry.Arc,System.Drawing.Color,System.Int32)
Add a new, colored arc to the display list.
arc: Arc to add.
color: Color of arc.
thickness: Thickness of arc.

Rhino.Display.CustomDisplay.AddCircle(Rhino.Geometry.Circle)
Add a new, black circle to the display list.
circle: Circle to add

Rhino.Display.CustomDisplay.AddCircle(Rhino.Geometry.Circle,System.Drawing.Color)
Add a new, colored arc to the display list.
circle: Circle to add.
color: Color of circle.

Rhino.Display.CustomDisplay.AddCircle(Rhino.Geometry.Circle,System.Drawing.Color,System.Int32)
Add a new, colored circle to the display list.
circle: Circle to add.
color: Color of circle.
thickness: Thickness of circle.

Rhino.Display.CustomDisplay.AddCurve(Rhino.Geometry.Curve)
Add a new, black curve to the display list.
The curve will be duplicated so changes to the
original will not affect the display.
curve: Curve to add

Rhino.Display.CustomDisplay.AddCurve(Rhino.Geometry.Curve,System.Drawing.Color)
Add a new, colored curve to the display list.
The curve will be duplicated so changes to the
original will not affect the display.
curve: Curve to add.
color: Color of curve.

Rhino.Display.CustomDisplay.AddCurve(Rhino.Geometry.Curve,System.Drawing.Color,System.Int32)
Add a new, colored curve to the display list.
The curve will be duplicated so changes to the
original will not affect the display.
curve: Curve to add.
color: Color of curve.
thickness: Thickness of curve.

Rhino.Display.CustomDisplay.AddPolygon(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Drawing.Color,System.Boolean,System.Boolean)
Add a polygon to the drawing list. Polygons are not like Hatches, when you supply a concave
polygon, the shading probably won't work.
polygon: Points that define the corners of the polygon.
fillColor: Fill color of polygon.
edgeColor: Edge color of polygon.
drawFill: If true, the polygon contents will be drawn.
drawEdge: If true, the polygon edge will be drawn.

Rhino.Display.CustomDisplay.AddText(System.String,Rhino.Geometry.Plane,System.Double)
Add a new, black 3D text object to the display list.
text: Text to add.
plane: Plane for text orientation.
size: Height (in units) of font.

Rhino.Display.CustomDisplay.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.Drawing.Color)
Add a new, colored 3D text object to the display list.
text: Text to add.
plane: Plane for text orientation.
size: Height (in units) of font.
color: Color of text.

Rhino.Display.CustomDisplay.AddText(Rhino.Display.Text3d,System.Drawing.Color)
Add a new 3D text object to the display list.
text: Text object to add.
color: Color of text object.