Rhino.Geometry.NurbsSurface.KnotsU
The U direction knot vector

Rhino.Geometry.NurbsSurface.KnotsV
The V direction knot vector

Rhino.Geometry.NurbsSurface.CreateFromPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,System.Int32,System.Int32,System.Int32)
Create a surface from control-points.
points: Control point locations.
uCount: Number of points in U direction.
vCount: Number of points in V direction.
uDegree: Degree of surface in U direction.
vDegree: Degree of surface in V direction.
Returns: A NurbsSurface on success or null on failure.
Remarks: uCount multiplied by vCount must equal the number of points supplied.

Rhino.Geometry.NurbsSurface.CreateThroughPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Create a surface from control-points.
points: Control point locations.
uCount: Number of points in U direction.
vCount: Number of points in V direction.
uDegree: Degree of surface in U direction.
vDegree: Degree of surface in V direction.
uClosed: True if the surface should be closed in the U direction.
vClosed: True if the surface should be closed in the V direction.
Returns: A NurbsSurface on success or null on failure.
Remarks: uCount multiplied by vCount must equal the number of points supplied.

Rhino.Geometry.NurbsSurface.CreateRuledSurface(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Create a Ruled surface between two curves. Curves must share the same knot-vector.
curveA: First curve.
curveB: Second curve.
Returns: A ruled surface on success or null on failure.

Rhino.Geometry.NurbsSurface.CreateFromCorners(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Make a surface from 4 corner points
corner1:
corner2:
corner3:
corner4:
Returns: the resulting surface or null on error

Rhino.Geometry.NurbsSurface.CreateFromCorners(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Make a surface from 4 corner points
corner1:
corner2:
corner3:
corner4:
tolerance: minimum edge length without collapsing to a singularity
Returns: the resulting surface or null on error

Rhino.Geometry.NurbsSurface.CreateFromCorners(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Make a surface from 3 corner points
corner1:
corner2:
corner3:
Returns: the resulting surface or null on error

Rhino.Geometry.NurbsSurface.CreateRailRevolvedSurface(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Line,System.Boolean)
Creates a railed Surface-of-Revolution.
profile: Profile curve for revolution.
rail: Rail curve for revolution.
axis: Axis of revolution.
scaleHeight: If true, surface will be locally scaled.
Returns: A NurbsSurface or null on failure.