Rhino.Input.Custom.GetPoint.#ctor
Create a new GetPoint

Rhino.Input.Custom.GetPoint.MouseMove
Called every time the mouse moves. MouseMove is called once per mouse move and is called
BEFORE any calls to OnDynamicDraw. If you are doing anything that takes a long time,
periodically call InterruptMouseMove() to see if you should stop. If the view is such
that the 2d screen point can't be mapped to a 3d point, the 'point' argument will be Unset

Rhino.Input.Custom.GetPoint.SetBasePoint(Rhino.Geometry.Point3d,System.Boolean)
Set base point used by ortho snap, from snap, planar snap, etc.
basePoint:
showDistanceInStatusBar:
if true, then the distance from base_point to the current point will be in the
status bar distance pane.

Rhino.Input.Custom.GetPoint.ConstrainDistanceFromBasePoint(System.Double)
Set distance constraint from base point
distance:
pass UnsetValue to clear this constraint. Pass 0.0 to disable the
ability to set this constraint by typing a number during GetPoint.
Remarks:
If the base point is set and the distance from base point constraint
is > 0, then the picked point is constrained to be this distance
from the base point.

Rhino.Input.Custom.GetPoint.EnableDrawLineFromPoint(System.Boolean)
Controls drawing of dynamic a line from the start point
enable:
if true, a dynamic line is drawn from the DrawLineFromPoint startPoint to the point being picked.

Rhino.Input.Custom.GetPoint.PermitOrthoSnap(System.Boolean)
Controls availability of ortho snap. Default is true.
permit:
if true, then GetPoint pays attention to the Rhino "ortho snap" and "planar snap" settings
reported by ModelAidSettings.Ortho and ModelAidSettings.Planar

Rhino.Input.Custom.GetPoint.PermitTabMode(System.Boolean)
Permit use of the tab key to define a line constraint.
permit: if true, then the built-in tab key mode is available.
Remarks: By default, use of the tab key is supported.

Rhino.Input.Custom.GetPoint.PermitElevatorMode(System.Int32)
Permit use of the control key to define a line constraint.
permitMode:
0: no elevator modes are permitted
1: fixed plane elevator mode (like the Line command)
2: cplane elevator mode (like object dragging)

Rhino.Input.Custom.GetPoint.AddSnapPoint(Rhino.Geometry.Point3d)
Add a point to the list of osnap points
point:
Returns: Total number of snap points
Remarks:
When point osnap is enabled, GetPoint will snap to points in the Rhino model.
If you want the user to be able to snap to additional points, then use
GetPoint::AddSnapPoints to specify the locations of these additional points.

Rhino.Input.Custom.GetPoint.AddSnapPoints(Rhino.Geometry.Point3d[])
Add points to the list of osnap points
points:
Returns: Total number of snap points
Remarks:
When point osnap is enabled, GetPoint will snap to points in the Rhino model.
If you want the user to be able to snap to additional points, then use
GetPoint::AddSnapPoints to specify the locations of these additional points.

Rhino.Input.Custom.GetPoint.AddConstructionPoint(Rhino.Geometry.Point3d)
Add a point to the list of construction points
point:
Returns: Total number of construction points
Remarks:
Construction points are like snap points except that they get snapped to even when
point osnap is off.  Typically, there are only a few construction points while there
can be many snap points. For example, when polylines are drawn the start point is a
construction point and the other points are snap points.

Rhino.Input.Custom.GetPoint.AddConstructionPoints(Rhino.Geometry.Point3d[])
Add points to the list of construction points
points:
Returns: Total number of construction points
Remarks:
Construction points are like snap points except that they get snapped to even when
point osnap is off.  Typically, there are only a few construction points while there
can be many snap points. For example, when polylines are drawn the start point is a
construction point and the other points are snap points.

Rhino.Input.Custom.GetPoint.ClearConstructionPoints
Remove all construction points
Remarks:
Construction points are like snap points except that they get snapped to
even when point osnap is off. Typically, there are only a few construction
points while there can be many snap points. For example, when polylines
are drawn the start point is a construction point and the other points are
snap points.

Rhino.Input.Custom.GetPoint.GetSnapPoints
Get current snap points.
Returns:

Rhino.Input.Custom.GetPoint.GetConstructionPoints
Get current construction points
Returns:
Remarks:
Construction points are like snap points except that they get snapped to
even when point osnap is off. Typically, there are only a few construction
points while there can be many snap points. For example, when polylines
are drawn the start point is a construction point and the other points are
snap points.

Rhino.Input.Custom.GetPoint.EnableCurveSnapTangentBar(System.Boolean,System.Boolean)
Controls display of the curve snap tangent bar icon
drawTangentBarAtSnapPoint:
true to draw a tangent bar icon whenever GetPoint snaps to a curve
drawEndPoints:
true to draw points at the end of the tangent bar
Remarks:
The tangent bar is drawn by GetPoint::DynamicDraw. If you override GetPoint::DynamicDraw,
then you must call the base class function.

Rhino.Input.Custom.GetPoint.EnableCurveSnapPerpBar(System.Boolean,System.Boolean)
Controls display of the curve snap perpendicular bar icon.
drawPerpBarAtSnapPoint:
true to draw a tangent bar icon  whenever GetPoint snaps to a curve
drawEndPoints:
true to draw points at the end of the tangent bar

Rhino.Input.Custom.GetPoint.EnableCurveSnapArrow(System.Boolean,System.Boolean)
Controls display of the curve snap arrow icon
drawDirectionArrowAtSnapPoint:
true to draw arrow icon whenever GetPoint snaps to a curve
reverseArrow:
true if arrow icon direction should be the reverse of the first derivative direction
Remarks:
The tangent bar is drawn by GetPoint::DynamicDraw. If you override GetPoint::DynamicDraw,
then you must call the base class function.

Rhino.Input.Custom.GetPoint.EnableSnapToCurves(System.Boolean)
If you want GetPoint() to try to snap to curves when the mouse is near a curve
(like the center point in the Circle command when the AroundCurve option is on),
then enable the snap to curves option.
enable:

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
constrain the picked point to lie on a line
from:
to:
Returns: true if constraint could be applied

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Line)
constrain the picked point to lie on a line
line:
Returns: true if constraint could be applied

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Arc)
constrain the picked point to lie on an arc
arc:
Returns: true if constraint could be applied

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Circle)
constrain the picked point to lie on a circle
circle:
Returns: true if constraint could be applied

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Plane,System.Boolean)
constrain the picked point to lie on a plane
plane:
allowElevator:
Returns: true if constraint could be applied

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Sphere)
constrain the picked point to lie on a sphere
sphere:
Returns: true if constraint could be applied

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Cylinder)
constrain the picked point to lie on a cylinder
cylinder:
Returns: true if constraint could be applied

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Curve,System.Boolean)
constrain the picked point to lie on a curve
curve:
allowPickingPointOffObject:
defines whether the point pick is allowed to happen off object. When false,
a "no no" cursor is shown when the cursor is not on the object. When true,
a normal point picking cursor is used and the marker is visible also when
the cursor is not on the object.
Returns: true if constraint could be applied

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Surface,System.Boolean)
constrain the picked point to lie on a surface
surface:
allowPickingPointOffObject:
defines whether the point pick is allowed to happen off object. When false,
a "no no" cursor is shown when the cursor is not on the object. When true,
a normal point picking cursor is used and the marker is visible also when
the cursor is not on the object.
Returns: true if constraint could be applied

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Brep,System.Int32,System.Int32,System.Boolean)
constrain the picked point to lie on a brep
brep:
wireDensity:
When wire_density<0, isocurve intersection snapping is turned off, when wire_density>=0, the value
defines the isocurve density used for isocurve intersection snapping.
faceIndex:
When face_index <0, constrain to whole brep. When face_index >=0, constrain to individual face.
allowPickingPointOffObject:
defines whether the point pick is allowed to happen off object. When false,
a "no no" cursor is shown when the cursor is not on the object. When true,
a normal point picking cursor is used and the marker is visible also when
the cursor is not on the object.
Returns: true if constraint could be applied

Rhino.Input.Custom.GetPoint.ConstrainToConstructionPlane(System.Boolean)
If enabled, the picked point is constrained to be on the active construction plane.
If the base point is set, then the point is constrained to be on the plane that contains
the base point and is parallel to the active construction plane. By default this
constraint is enabled.
throughBasePoint:
Returns:
if true and the base point is set, then the point is constrained to be on the plane parallel
to the construction plane that passes through the base point, even when planar mode is off.
If throughBasePoint is false, then the base point shift only happens if planar mode is on.

Rhino.Input.Custom.GetPoint.ConstrainToTargetPlane
Constrain point to lie on a plane that is parallel to the
viewing plane and passes through the view's target point.

Rhino.Input.Custom.GetPoint.ClearConstraints
Remove any explicit constraints added by calls to GetPoint::Constraint() and enable
the built-in constraint options.

Rhino.Input.Custom.GetPoint.InterruptMouseMove
If you have lengthy computations in OnMouseMove() and/or DymanicDraw()
overrides, then periodically call InterruptMouseMove() to see if you
should interrupt your work because the mouse has moved again.
Returns:

Rhino.Input.Custom.GetPoint.Get(System.Boolean)
After setting up options and so on, call GetPoint::Get to get a 3d point
onMouseUp:
If false, the point is returned when the left mouse button goes down.
If true, the point is returned when the left mouse button goes up.
Returns:

Rhino.Input.Custom.GetPoint.Get
After setting up options and so on, call GetPoint::Get to get a 3d point

Rhino.Input.Custom.GetPoint.PointOnObject
Call this function to see if the point was on an object. If the point was
on an object an ObjRef is returned; otherwise null is returned
Returns: