Rhino.Display.ColorLCH.#ctor(System.Drawing.Color)
Create a new instance of ColorLCH that is equivalent to an RGB color.
rgb: RGB Color to mimic.
Remarks: Exact conversions between color spaces are often not possible.

Rhino.Display.ColorLCH.#ctor(System.Double,System.Double,System.Double)
Create a new instance of ColorLCH with custom channel values.
lightness: Value of lightness channel. This channel is limited to 0~1.
chroma: Value of chroma channel. This channel is limited to -1~1.
hue: Value of chroma channel. This channel is limited to 0~360.

Rhino.Display.ColorLCH.#ctor(System.Double,System.Double,System.Double,System.Double)
Create a new instance of ColorLCH with custom channel values.
alpha: Value of Alpha channel. This channel is limited to 0~1.
lightness: Value of Lightness channel. This channel is limited to 0~1.
chroma: Value of Chroma channel. This channel is limited to -1~1.
hue: Value of Hue channel. This channel is limited to 0~360.

Rhino.Display.ColorLCH.C
Gets or sets the Chroma channel. Chroma is defined from -1.0 to +1.0