Rhino.RhinoDoc
Represents an active model

Rhino.RhinoDoc.AddRhinoObject
Called if a new object is added to the document

Rhino.RhinoDoc.UndeleteRhinoObject
Called if an object is un-deleted

Rhino.RhinoDoc.PurgeRhinoObject
Called if an object is begin purged from a document. The object will cease to exist forever

Rhino.RhinoDoc.Notes
Returns or sets the document's notes

Rhino.RhinoDoc.IsReadOnly
Current read-only mode for this document.
True if the document is can be viewed but NOT saved.
False if document can be viewed and saved

Rhino.RhinoDoc.Materials
Materials in the document

Rhino.RhinoDoc.Linetypes
Linetypes in the document

Rhino.RhinoDoc.Layers
Layers in the document

Rhino.RhinoDoc.IsSendingMail
True if Rhino is in the process of sending this document as an email attachment

Rhino.RhinoDoc.ExtractPreviewImage(System.String)
Extracts the bitmap preview image from the specified model (3DM).
path:
The model (3DM) from which to extract the preview image.
If null, the currently loaded model is used.
Returns: true on success