Rhino.Geometry.Circle
ON_Circle is a circle in 3d. The cirle is represented by a radius and an
orthonormal frame	of the plane containing the circle, with origin at the center.
An Is_Valid() circle has positive radius and an Is_ Valid() plane defining the frame.
The circle is parameterized by radians from 0 to 2 Pi given by
t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis
where center, xaxis and yaxis define the orthonormal frame of the circle's plane.

Rhino.Geometry.Circle.#ctor(System.Double)
Create a circle with center (0,0,0) in the world XY plane
radius: Radius of circle, should be a positive number.

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Plane,System.Double)
Creates a circle in the plane with a given radius.
plane: Plane of circle. Plane origin defines the center of the circle.
radius: Radius of circle (should be a positive value).

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Point3d,System.Double)
Creates a circle parallel to the world XY plane with given center and radius.
center: Center of circle.
radius: Radius of circle (should be a positive value).

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Arc)
Create a circle from an arc.
arc: Arc that defines the plane and radius.

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Create a circle through three 3d points. The start/end of the circle is at point1.

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)
Create a circle parallel to a given plane with given center and radius.
plane: Plane for circle.
center: Center point override.
radius: Radius of circle (should be a positive value).

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Create a circle from two 3d points and a tangent at the first point.
The start/end of the circle is at point "startPoint".
startPoint: Start point of circle.
tangentAtP: Tangent vector at start.
pointOnCircle: Point coincident with desired circle.
Remarks: May create an Invalid circle

Rhino.Geometry.Circle.IsInPlane(Rhino.Geometry.Plane,System.Double)
Evaluates whether or not this circle is co-planar with a given plane.
plane: Plane.
tolerance: Tolerance to use.
Returns: True if the circle plane is co-planar with the given plane within tolerance.

Rhino.Geometry.Circle.PointAt(System.Double)
Circles use trigonometric parameterization:
t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis
t: Parameter of point to evaluate.
Returns: The point on the circle at the given parameter.

Rhino.Geometry.Circle.TangentAt(System.Double)
Circles use trigonometric parameterization:
t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis
t: Parameter of tangent to evaluate.
Returns: The tangent at the circle at the given parameter.

Rhino.Geometry.Circle.DerivativeAt(System.Int32,System.Double)
Determine the Nth order derivative.
derivative:
t: Parameter to evaluate derivative. Valid values are 0, 1, 2 and 3.
Returns: The derivative of the circle at the given parameter.

Rhino.Geometry.Circle.ClosestParameterTo(Rhino.Geometry.Point3d,System.Double@)
This method is Obsolete, use ClosestParameter() instead.

Rhino.Geometry.Circle.ClosestParameter(Rhino.Geometry.Point3d,System.Double@)
Get the parameter on the circle which is closest to a test point.
testPoint: Point to project onto the circle.
t: Parameter on circle closes to testPoint.
Returns: True on success, false on failure.

Rhino.Geometry.Circle.ClosestPointTo(Rhino.Geometry.Point3d)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Circle.ClosestPoint(Rhino.Geometry.Point3d)
Get the point on the circle which is closest to a test point.
testPoint: Point to project onto the circle.
Returns:
The point on the circle that is closest to testPoint or
Point3d.Unset on failure.

Rhino.Geometry.Circle.Transform(Rhino.Geometry.Transform)
Transform this circle using an xform matrix.
xform: Transformation to apply.
Returns: True on success, false on failure.
Remarks:
Circles may not be transformed accurately if the xform defines a
non-euclidian transformation.

Rhino.Geometry.Circle.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d)
Rotate the circle.
sinAngle: Dude, I've never understood how these sin/cos rotations work.
Someone else please write these comments.
cosAngle: see sinAngle.
axis: Rotation axis.
Returns: True on success, false on failure.

Rhino.Geometry.Circle.Rotate(System.Double,Rhino.Geometry.Vector3d)
Rotate the circle through a given angle.
angle: Angle (in radians) of the rotation.
axis: Rotation axis.
Returns: True on success, false on failure.

Rhino.Geometry.Circle.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotate the circle through a given angle.
angle: Angle (in radians) of the rotation.
axis: Rotation axis.
point: Rotation anchor point.
Returns: True on success, false on failure.

Rhino.Geometry.Circle.Translate(Rhino.Geometry.Vector3d)
Translate (move) the circle.
delta: Translation vector.
Returns: True on success, false on failure.

Rhino.Geometry.Circle.ToNurbsCurve
Create a nurbs curve representation of this circle.
This amounts to the same as calling NurbsCurve.CreateFromCircle().
Returns: A nurbs curve representation of this circle or null if no such representation could be made.