Rhino.Geometry.PointCloud.ContainsNormals
Gets a value indicating whether or not the points in this
pointcloud have colors assigned to them.

Rhino.Geometry.PointCloud.ClearColors
Destroy the Color information in this PointCloud.

Rhino.Geometry.PointCloud.ClearNormals
Destroy the Normal vector information in this PointCloud.

Rhino.Geometry.PointCloud.ClearHiddenFlags
Destroy the Hidden flag information in this PointCloud.

Rhino.Geometry.PointCloud.AppendNew
Append a new PointCloudItem to the end of this PointCloud.
Returns: The newly appended item.

Rhino.Geometry.PointCloud.InsertNew(System.Int32)
index: Index of new item.
Returns: The newly inserted item.

Rhino.Geometry.PointCloud.Merge(Rhino.Geometry.PointCloud)
Merge this PointCloud with another pointcloud.
other: PointCloud to merge with this one.

Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Append a collection of points to this PointCloud.
points: Points to append.

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d)
Insert a new point into the point list.
index: Insertion index.
point: Point to append.

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Insert a new point into the point list.
index: Insertion index.
point: Point to append.
normal: Normal vector of new point.

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d,System.Drawing.Color)
Insert a new point into the point list.
index: Insertion index.
point: Point to append.
color: Color of new point.

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)
Insert a new point into the point list.
index: Insertion index.
point: Point to append.
normal: Normal vector of new point.
color: Color of new point.

Rhino.Geometry.PointCloud.InsertRange(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Append a collection of points to this PointCloud.
index: Index at which to insert the new collection.
points: Points to append.

Rhino.Geometry.PointCloud.GetPoints
Copy all the point coordinates in this PointCloud to an array.
Returns: An array containing all the points in this PointCloud.

Rhino.Geometry.PointCloud.GetNormals
Copy all the normal vectors in this PointCloud to an array.
Returns: An array containing all the normals in this PointCloud.

Rhino.Geometry.PointCloud.GetColors
Copy all the point colors in this PointCloud to an array.
Returns: An array containing all the colors in this PointCloud.