Rhino.DocObjects.Tables.LinetypeTable.Item(System.Int32)
Conceptually, the linetype table is an array of linetypes.
The operator[] can be used to get individual linetypes. A linetype is
either active or deleted and this state is reported by Linetype.IsDeleted
index: zero based array index
Returns:
Refererence to the linetype.  If index is out of range, the current
linetype is returned. Note that this reference may become invalid after
AddLinetype() is called.

Rhino.DocObjects.Tables.LinetypeTable.Document
Document that owns this table

Rhino.DocObjects.Tables.LinetypeTable.ActiveCount
Returns number of linetypes in the linetypes table, excluding deleted linetypes

Rhino.DocObjects.Tables.LinetypeTable.CurrentLinetypeIndex
At all times, there is a "current" linetype.  Unless otherwise specified,
new objects are assigned to the current linetype. If the current linetype
source is LinetypeFromLayer the object's layer's linetype is used instead

Rhino.DocObjects.Tables.LinetypeTable.CurrentLinetype
At all times, there is a "current" linetype. Unless otherwise specified,
new objects are assigned to the current linetype. The current linetype
is never deleted.
Returns reference to the current linetype. Note that this reference may
become invalid after a call to AddLinetype().

Rhino.DocObjects.Tables.LinetypeTable.ContinuousLinetypeName
Returns the text name of the continuous linetype

Rhino.DocObjects.Tables.LinetypeTable.ByLayerLinetypeName
Returns the text name of the bylayer linetype

Rhino.DocObjects.Tables.LinetypeTable.LinetypeIndexForObject(Rhino.DocObjects.RhinoObject)
Returns the effective linetype index to be used to find the
linetype definition to draw an object. If an object's linetype
source is LinetypeFromObject, the linetype index in the object's
attributes is used. If an object's linetype source is LinetypeFromLayer
the linetype index from the object's layer is used.
rhinoObject:
Returns:

Rhino.DocObjects.Tables.LinetypeTable.Find(System.String,System.Boolean)
Finds the linetype with a given name
name: search ignores case
ignoreDeletedLinetypes: If true, deleted linetypes are not checked
Returns:
>=0 index of the linetype with the given name
-1  no linetype has the given name

Rhino.DocObjects.Tables.LinetypeTable.Find(System.Guid,System.Boolean)
Find a linetype with a matching id
id:
ignoreDeletedLinetypes: If true, deleted linetypes are not checked
Returns:
>=0 index of the linetype with the given name
-1  no linetype has the given name

Rhino.DocObjects.Tables.LinetypeTable.Add(Rhino.DocObjects.Linetype)
Adds a new linetype with specified definition to the linetype table.
linetype:
Definition of new linetype.  The information in linetype is copied.
If linetype.Name is empty then a unique name of the form "Linetype 01"
will be automatically created.
Returns:
index of new linetype or -1 on error

Rhino.DocObjects.Tables.LinetypeTable.Add(System.String,System.Collections.Generic.IEnumerable{System.Double})
Adds a new linetype with specified definition to the linetype table.
name:
segmentLengths: Positive values are dashes, negative values are gaps
Returns:
index of new linetype or -1 on error

Rhino.DocObjects.Tables.LinetypeTable.AddReferenceLinetype(Rhino.DocObjects.Linetype)
Reference linetypes are not saved in files
linetype:
Returns:

Rhino.DocObjects.Tables.LinetypeTable.Modify(Rhino.DocObjects.Linetype,System.Int32,System.Boolean)
Modify linetype settings
linetype: new settings.  This information is copied.
index: zero based index of linetype to set
quiet:
if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if linetype_index is out of range or the
settings attempt to lock or hide the current linetype.

Rhino.DocObjects.Tables.LinetypeTable.UndoModify(System.Int32)
If the linetype has been modified and the modifcation can be undone,
then UndoModify() will restore the linetype to its previous state.
index:
Returns:
true if this linetype had been modified and the modifications were undone

Rhino.DocObjects.Tables.LinetypeTable.Delete(System.Int32,System.Boolean)
Deletes linetype
index: zero based index of linetype to delete
quiet:
If true, no warning message box appears if a linetype the
linetype cannot be deleted because it is the current linetype
or it contains active geometry.
Returns:
true if successful. false if linetype_index is out of range or the
linetype cannot be deleted because it is the current linetype or
because it linetype is referenced by active geometry.

Rhino.DocObjects.Tables.LinetypeTable.Delete(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Deletes multiple linetypes
indices:
quiet:
Returns:

Rhino.DocObjects.Tables.LinetypeTable.Undelete(System.Int32)
Undeletes a linetype that has been deleted
index:
Returns: true if successful

Rhino.DocObjects.Tables.LinetypeTable.GetUnusedLinetypeName(System.Boolean)
Gets unused linetype name used as default when creating new linetypes.
ignoreDeleted:
if this is true then may use a name used by a deleted linetype
Returns: