Rhino.Geometry.Collections.MeshTopologyVertexList
Provides access to the mesh topology vertices of a mesh. Topology vertices are
sets of vertices in the MeshVertexList that can topologically be considered the
same vertex

Rhino.Geometry.Collections.MeshTopologyVertexList.Item(System.Int32)
Gets or sets the vertex at the given index. Setting a location adjusts all vertices
in the mesh's vertex list that are defined by this topological vertex
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of topology vertex to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The topological vertex at [index].

Rhino.Geometry.Collections.MeshTopologyVertexList.TopologyVertexIndex(System.Int32)
Get the topology vertex index for an existing mesh vertex in the mesh's
VertexList
vertexIndex: index of a vertex in the Mesh.Vertices
Returns: index of a topology vertex in the Mesh.TopologyVertices
Throws System.IndexOutOfRangeException:

Rhino.Geometry.Collections.MeshTopologyVertexList.MeshVertexIndices(System.Int32)
Get indices of all mesh vertices that a given topology vertex represents
topologyVertexIndex: index of a topology vertex in Mesh.TopologyVertices
Returns:
Indices of all vertices that in Mesh.Vertices that a topology vertex represents.
Throws System.IndexOutOfRangeException:

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedTopologyVertices(System.Int32)
Get all topological vertices that are connected to a given vertex
topologyVertexIndex: index of a topology vertex in Mesh.TopologyVertices
Returns:
Indices of all topological vertices that are connected to this topological vertex.
null if no vertices are connected to this vertex
Throws System.IndexOutOfRangeException:

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedFaces(System.Int32)
Get all faces that are connected to a given vertex
topologyVertexIndex: index of a topology vertex in Mesh.TopologyVertices
Returns:
Indices of all faces in Mesh.Faces that are connected to this topological vertex.
null if no faces are connected to this vertex
Throws System.IndexOutOfRangeException: