Rhino.Input.Custom.GeometryAttributeFilter.BoundaryInnerLoop
all trimming edges are boundary edges

Rhino.Input.Custom.GeometryAttributeFilter.MatedInnerLoop
all trimming edges are mated

Rhino.Input.Custom.GeometryAttributeFilter.InnerLoop
any inner loop is acceptable

Rhino.Input.Custom.GeometryAttributeFilter.BoundaryOuterLoop
all trimming edges are boundary edges

Rhino.Input.Custom.GeometryAttributeFilter.MatedOuterLoop
all trimming edges are mated

Rhino.Input.Custom.GeometryAttributeFilter.OuterLoop
any outer loop is acceptable