Rhino.PlugIns.LicenseData
Zoo plugin license data

Rhino.PlugIns.LicenseData.#ctor
Public constructor

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String)
Public constructor

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,System.Int32)
Public constructor

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,System.Int32,System.Nullable{System.DateTime})
Public constructor

Rhino.PlugIns.LicenseData.IsValid
Public validator