Rhino.Geometry.PlaneSurface.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Constructs a PlaneSurface with x and y intervals
plane: The plane.
xExtents: The x interval of the plane that defines the rectangle.
The corresponding evaluation interval domain is set so that it matches the
extents interval
yExtents: The y interval of the plane that defines the rectangle.
The corresponding evaluation interval domain is set so that it matches the
extents interval

Rhino.Geometry.PlaneSurface.CreateThroughBox(Rhino.Geometry.Line,Rhino.Geometry.Vector3d,Rhino.Geometry.BoundingBox)
Make a plane that includes a line and a vector and goes through a bounding box
lineInPlane:
vectorInPlane:
box: box to cut through
Returns: new PlaneSurface on success, NULL on error

Rhino.Geometry.PlaneSurface.CreateThroughBox(Rhino.Geometry.Plane,Rhino.Geometry.BoundingBox)
Extend a plane so that is goes through a bounding box
plane:
box:
Returns: new PlaneSurface on success, NULL on error