Rhino.UI.OpenFileDialog
Similar to the System.Windows.Forms.OpenFileDialog, but with customized
Rhino user interface

Rhino.UI.OpenFileDialog.#ctor
Create a new open file dialog

Rhino.UI.OpenFileDialog.DefaultExt
The default file name extension. The returned string does not include the period

Rhino.UI.OpenFileDialog.Filter
Gets or sets the current file name filter string, which determines
the choices that appear in the "Save as file type" or "Files of type"
box in the dialog box. See System.Windows.Forms.FileDialog for details

Rhino.UI.OpenFileDialog.ShowDialog
Show the actual dialog to allow the user to select a file