Rhino.Input.Custom.OptionInteger.#ctor(System.Int32,System.Int32,System.Int32)
initialValue:
lowerLimit:
upperLimit:

Rhino.Input.Custom.OptionInteger.#ctor(System.Int32,System.Boolean,System.Int32)
initialValue:
setLowerLimit:
if true, limit sets the lower limit and upper limit is undefined
if false, limit sets the upper limit and lower limit is undefined
limit: