Rhino.DocObjects.InstanceObject.InstanceXform
transformation applied to an instance definition for this object

Rhino.DocObjects.InstanceObject.InsertionPoint
Basepoint coordinates of a block

Rhino.DocObjects.InstanceObject.InstanceDefinition
instance definition that this object uses