Rhino.Display.RhinoView
A RhinoView represents a single "window" display of a document. A view could
contain one or many RhinoViewports (many in the case of Layout views with detail viewports).
Standard Rhino modeling views have one viewport

Rhino.Display.RhinoView.EnableDrawing
Enables drawing. By default, drawing is enabled.  There are some rare
situations where scipts want to disable drawing for a while.

Rhino.Display.RhinoView.MainViewport
A RhinoView contains a "main viewport" that fills the entire view client window.
RhinoPageViews may also contain nested child RhinoViewports for implementing
detail viewports.
The MainViewport will always return this RhinoView's m_vp

Rhino.Display.RhinoView.TitleVisible
Visibility of the viewport title window

Rhino.Display.RhinoView.Redraw
Redraw this view
Remarks:
If you change something in "this" view like the projection, construction plane,
background bitmap, etc., then you need to call RhinoView.Redraw() to redraw
"this" view./ The other views will not be changed. If you change something in
the document (like adding new geometry to the model), then you need to call
RhinoDoc.Views.Redraw() to redraw all the views.

Rhino.Display.RhinoView.CreateWireframePreviewImage(System.String,System.Drawing.Size,System.Boolean,System.Boolean)
Creates a bitmap preview image of model.
imagePath:
[in] The name of the bitmap file to create.  The extension of the imagePath controls
the format of the bitmap file created (bmp, tga, jpg, pcx, png, tif).
size: [in] The width and height of the bitmap in pixels.
ignoreHighlights:
drawConstructionPlane:
Returns: true if successful

Rhino.Display.RhinoView.CreateShadedPreviewImage(System.String,System.Drawing.Size,System.Boolean,System.Boolean,System.Boolean)
Creates a bitmap preview image of model.
imagePath:
[in] The name of the bitmap file to create.  The extension of the imagePath controls
the format of the bitmap file created (bmp, tga, jpg, pcx, png, tif).
size: [in] The width and height of the bitmap in pixels.
ignoreHighlights:
drawConstructionPlane:
useGhostedShading:
Returns: true if successful

Rhino.Display.RhinoView.FloatRhinoView(System.Boolean)
Change floating state of RhinoView
floating:
if true, then the view will be in a floating frame window. Otherwise
the view will be embeded in the main frame
Returns: true on success