Rhino.UI.SaveFileDialog
Similar to the System.Windows.Forms.SaveFileDialog, but with customized
Rhino user interface

Rhino.UI.SaveFileDialog.DefaultExt
The default file name extension. The returned string does not include the period

Rhino.UI.SaveFileDialog.Filter
Gets or sets the current file name filter string, which determines
the choices that appear in the "Save as file type" or "Files of type"
box in the dialog box. See System.Windows.Forms.FileDialog for details