Rhino.Geometry.Collections.MeshVertexColorList.Clear
Clear the Vertex Color list on the mesh.

Rhino.Geometry.Collections.MeshVertexColorList.Add(System.Int32,System.Int32,System.Int32)
Adds a new vertex color to the end of the Color list.
red: Red component of color, must be in the 0~255 range.
green: Green component of color, must be in the 0~255 range.
blue: Blue component of color, must be in the 0~255 range.
Returns: The index of the newly added color.

Rhino.Geometry.Collections.MeshVertexColorList.Add(System.Drawing.Color)
Adds a new vertex color to the end of the Color list.
color: Color to append, Alpha channels will be ignored.
Returns: The index of the newly added color.

Rhino.Geometry.Collections.MeshVertexColorList.SetColor(System.Int32,System.Int32,System.Int32,System.Int32)
Sets or adds a vertex color to the Color List.
If [index] is less than [Count], the existing vertex at [index] will be modified.If [index] equals [Count], a new vertex is appended to the end of the vertex list.If [index] is larger than [Count], the function will return false.
index: Index of vertex color to set.
If index equals Count, then the color will be appended.
red: Red component of vertex color. Value must be in the 0~255 range.
green: Green component of vertex color. Value must be in the 0~255 range.
blue: Blue component of vertex color. Value must be in the 0~255 range.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexColorList.SetColor(System.Int32,System.Drawing.Color)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.If [index] equals [Count], a new vertex is appended to the end of the vertex list.If [index] is larger than [Count], the function will return false.
index: Index of vertex color to set.
If index equals Count, then the color will be appended.
color: Color to set, Alpha channels will be ignored.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexColorList.CreateMonotoneMesh(System.Drawing.Color)
Create a valid vertex color list consisting of a single color.
baseColor: Color to apply to every vertex.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexColorList.SetColors(System.Drawing.Color[])
Set all the vertex colors in one go. For the Mesh to be valid, the number
of colors must match the number of vertices.
colors: Colors to set.
Returns: True on success, False on failure.

Rhino.Geometry.Collections.MeshVertexColorList.AppendColors(System.Drawing.Color[])
Append a collection of colors to the Vertex Color list.
For the Mesh to be valid, the number of colors must match the number of vertices.
colors: Colors to append.
Returns: True on success, false on failure.