Rhino.Geometry.AreaMassProperties.WorldCoordinatesFirstMoments
Returns the world coordinate first moments if they were able to be calculated.
X is integral of "x dm" over the area
Y is integral of "y dm" over the area
Z is integral of "z dm" over the area

Rhino.Geometry.AreaMassProperties.WorldCoordinatesFirstMomentsError
Uncertainty in world coordinates first moments calculation

Rhino.Geometry.AreaMassProperties.WorldCoordinatesSecondMoments
Returns the world coordinate first moments if they were able to be calculated.
X is integral of "xx dm" over the area
Y is integral of "yy dm" over the area
Z is integral of "zz dm" over the area

Rhino.Geometry.AreaMassProperties.WorldCoordinatesSecondMomentsError
Uncertainty in world coordinates second moments calculation

Rhino.Geometry.AreaMassProperties.WorldCoordinatesProductMoments
Returns the world coordinate product moments if they were able to be calculated.
X is integral of "xy dm" over the area
Y is integral of "yz dm" over the area
Z is integral of "zx dm" over the area

Rhino.Geometry.AreaMassProperties.WorldCoordinatesProductMomentsError
Uncertainty in world coordinates second moments calculation

Rhino.Geometry.AreaMassProperties.WorldCoordinatesMomentsOfInertia
The moments of inertia about the world coordinate axes.
X = integral of (y^2 + z^2) dm
Y = integral of (z^2 + x^2) dm
Z = integral of (z^2 + y^2) dm
Remarks:
What is meant by "moments of intertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.

Rhino.Geometry.AreaMassProperties.WorldCoordinatesMomentsOfInertiaError
Uncertainty in world coordinates moments of inertia calculation

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesSecondMomentsError
Uncertainty in centroid coordinates second moments calculation

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesMomentsOfInertiaError
Uncertainty in centroid coordinates moments of inertia calculation

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Curve)
Compute an AreaMassProperties for a single closed planar curve.
closedPlanarCurve: Curve to measure.
Returns: The AreaMassProperties for the given curve or null on failure.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Hatch)
Compute an AreaMassProperties for a hatch
hatch: Hatch to measure
Returns: The AreaMassProperties for the given hatch or null on failure.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Mesh)
Compute an AreaMassProperties for a single mesh.
mesh: Mesh to measure.
Returns: The AreaMassProperties for the given Mesh or null on failure.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Brep)
Compute an AreaMassProperties for a single Brep.
brep: Brep to measure.
Returns: The AreaMassProperties for the given Brep or null on failure.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Surface)
Compute an AreaMassProperties for a single Surface.
surface: Surface to measure.
Returns: The AreaMassProperties for the given Surface or null on failure.