Rhino.RhinoApp
.NET RhinoApp is parallel to C++ CRhinoApp

Rhino.RhinoApp.SerialNumber
The product serial number, as seen in Rhino's ABOUT dialog box.

Rhino.RhinoApp.InstallationType
The product installation type, as seen in Rhino's ABOUT dialog box.

Rhino.RhinoApp.CommandHistoryWindowText
Text in Rhino's command history window

Rhino.RhinoApp.Write(System.String)
Print formatted text in the command window

Rhino.RhinoApp.Write(System.String,System.Object)
Print formatted text in the command window

Rhino.RhinoApp.Write(System.String,System.Object,System.Object)
Print formatted text in the command window

Rhino.RhinoApp.Write(System.String,System.Object,System.Object,System.Object)
Print formatted text in the command window

Rhino.RhinoApp.WriteLine
Print a newline in the command window

Rhino.RhinoApp.WriteLine(System.String)
Print text in the command window

Rhino.RhinoApp.WriteLine(System.String,System.Object)
Print formatted text with a newline in the command window

Rhino.RhinoApp.WriteLine(System.String,System.Object,System.Object)
Print formatted text with a newline in the command window

Rhino.RhinoApp.WriteLine(System.String,System.Object,System.Object,System.Object)
Print formatted text with a newline in the command window

Rhino.RhinoApp.SetCommandPrompt(System.String,System.String)
Set Rhino command prompt
prompt:
promptDefault:
text that appears in angle brackets and indicates what will happen if the user pressed ENTER.

Rhino.RhinoApp.SetCommandPrompt(System.String)
Set Rhino command prompt
prompt:

Rhino.RhinoApp.ClearCommandHistoryWindow
Clear the text in Rhino's command history window

Rhino.RhinoApp.RunScript(System.String,System.Boolean)
Run a Rhino command script.
script: [in] script to run
echo:
Controls how the script is echoed in the command output window.
false = silent - nothing is echoed
true = verbatim - the script is echoed literally
Remarks:
Rhino acts as if each character in the script string had been typed in the command prompt.
When RunScript is called from a "script runner" command, it completely runs the
script before returning. When RunScript is called outside of a command, it returns and the
script is run. This way menus and buttons can use RunScript to execute complicated functions.

Rhino.RhinoApp.Wait
Pause to keep Windows message pump alive so views will update
and windows will repaint

Rhino.RhinoApp.GetPlugInObject(System.Guid)
Get the object that is returned by PlugIn.GetPlugInObject for a given
plug-in. This function attempts to find and load a plug-in with a given Id.
When a plug-in is found, it's GetPlugInObject function is called and the
result is returned here.
Note the plug-in must have already been installed in Rhino or the plug-in manager
will not know where to look for a plug-in with a matching id.
pluginId: Guid for a given plug-in
Returns:
Result of PlugIn.GetPlugInObject for a given plug-in on success.

Rhino.RhinoApp.GetPlugInObject(System.String)
Get the object that is returned by PlugIn.GetPlugInObject for a given
plug-in. This function attempts to find and load a plug-in with a given name.
When a plug-in is found, it's GetPlugInObject function is called and the
result is returned here.
Note the plug-in must have already been installed in Rhino or the plug-in manager
will not know where to look for a plug-in with a matching name.
plugin: Name of a plug-in
Returns:
Result of PlugIn.GetPlugInObject for a given plug-in on success.