Rhino.Geometry.Light.IsEnabled
Turn light on or off

Rhino.Geometry.Light.CoordinateSystem
Determined by LightStyle

Rhino.Geometry.Light.SpotAngleRadians
ignored for non-spot lights
angle = 0 to pi/2  (0 to 90 degrees)

Rhino.Geometry.Light.Length
linear and rectangular light parameter
(ignored for non-linear/rectangular lights)

Rhino.Geometry.Light.Width
linear and rectangular light parameter
(ignored for non-linear/rectangular lights)

Rhino.Geometry.Light.SetAttenuation(System.Double,System.Double,System.Double)
attenuation settings (ignored for "directional" and "ambient" lights)
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light
a0:
a1:
a2:

Rhino.Geometry.Light.GetAttenuation(System.Double)
attenuation settings (ignored for "directional" and "ambient" lights)
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light
d:
Returns: 0 if a0 + d*a1 + d^2*a2 <= 0