Rhino.Geometry.SumSurface.Create(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Create a SumSurface by extruding a curve (CurveA) along a path (CurveB)
curveA:
curveB:
Returns: SumSurface on success, null on failure