Rhino.Input.Custom.CommandLineOption.IsValidOptionName(System.String)
Test a string to see if it can be used as an option name in any of the RhinoGet::AddCommandOption...() functions.
optionName:
Returns: true if string can be used as an option name

Rhino.Input.Custom.CommandLineOption.IsValidOptionValueName(System.String)
Test a string to see if it can be used as an option value in RhinoGet::AddCommandOption,
RhinoGet::AddCommandOptionToggle, or RhinoGet::AddCommandOptionList.
optionValue:
Returns: true if string can be used as an option value