Rhino.Collections.CurveList.Transform(Rhino.Geometry.Transform)
Transform all the curves in this list. If at least a single transform failed
this function returns False.
xform: Transformation to apply to all curves.