Rhino.ApplicationSettings.NeverRepeatList.CommandNames
Convert m_dont_repeat_list to space delimited string

Rhino.ApplicationSettings.NeverRepeatList.UseNeverRepeatList
Only use the m_dont_repeat_list if somebody modifies it via CRhinoAppSettings::SetDontRepeatCommands()
A return value of true means CRhinoCommand don't repeat flags will be ignored and the m_dont_repeat_list
will be used instead.  False means the individual CRhinoCommands will determine if they are repeatable.

Rhino.ApplicationSettings.NeverRepeatList.SetList(System.String[])
put command name tokens in m_dont_repeat_list.
Returns: Number of items added to m_dont_repeat_list.