Rhino.Display.DisplayMaterial.#ctor
Create a default material.

Rhino.Display.DisplayMaterial.#ctor(System.Drawing.Color)
Create a default material with a specific diffuse color.
diffuse: Diffuse color of material. The alpha component of the Diffuse color is ignored.

Rhino.Display.DisplayMaterial.#ctor(System.Drawing.Color,System.Double)
Create a default material with a specific diffuse color and transparency.
diffuse: Diffuse color of material. The alpha component of the Diffuse color is ignored.
transparency: Transparency factor (0.0 = opaque, 1.0 = transparent)

Rhino.Display.DisplayMaterial.#ctor(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Double,System.Double)
Create a material with custom properties.
diffuse: Diffuse color of material. The alpha component of the Diffuse color is ignored.
specular: Specular color of material. The alpha component of the Specular color is ignored.
ambient: Ambient color of material. The alpha component of the Ambient color is ignored.
emission: Emission color of material. The alpha component of the Emission color is ignored.
shine: Shine (highlight size) of material.
transparency: Transparency of material (0.0 = opaque, 1.0 = transparent)

Rhino.Display.DisplayMaterial.Shine
Gets or sets the shine factor of the material {0.0 to 1.0}

Rhino.Display.DisplayMaterial.Transparency
Gets or sets the transparency of the material {0.0 = opaque to 1.0 = transparent}