Rhino.Geometry.Collections.MeshFaceList
Provides access to the Faces and Face related functionality of a Mesh.

Rhino.Geometry.Collections.MeshFaceList.Clear
Clear the Face list on the mesh.

Rhino.Geometry.Collections.MeshFaceList.AddFace(Rhino.Geometry.MeshFace)
Append a new mesh face to the end of the mesh face list.
face: Face to add.
Returns: The index of the newly added face.

Rhino.Geometry.Collections.MeshFaceList.AddFace(System.Int32,System.Int32,System.Int32)
Append a new triangular face to the end of the mesh face list.
vertex1: Index of first face corner.
vertex2: Index of second face corner.
vertex3: Index of third face corner.
Returns: The index of the newly added triangle.

Rhino.Geometry.Collections.MeshFaceList.AddFace(System.Int32,System.Int32,System.Int32,System.Int32)
Append a new quadragular face to the end of the mesh face list.
vertex1: Index of first face corner.
vertex2: Index of second face corner.
vertex3: Index of third face corner.
vertex4: Index of fourth face corner.
Returns: The index of the newly added quad.

Rhino.Geometry.Collections.MeshFaceList.ConvertQuadsToTriangles
Splits all quads along the short diagonal.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshFaceList.ConvertTrianglesToQuads(System.Double,System.Double)
Joins adjacent triangles into quads if the resulting quad is 'nice'.
angleToleranceRadians:
Used to compare adjacent triangles' face normals. For two triangles
to be considered, the angle between their face normals has to
be <= angleToleranceRadians. When in doubt use RhinoMath.PI/90.0 (2 degrees).
minimumDiagonalLengthRatio:
( <= 1.0) For two triangles to be considered the ratio of the
resulting quad's diagonals
(length of the shortest diagonal)/(length of longest diagonal).
has to be >= minimumDiagonalLengthRatio. When in doubt us .875.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshFaceList.CullDegenerateFaces
Cull (delete) all degenerate faces from the mesh.
Returns: The number of degenerate faces that were removed.