Rhino.Display.ColorXYZ.#ctor(System.Drawing.Color)
Create a new instance of ColorXYZ that is equivalent to an RGB color.
rgb: RGB Color to mimic.
Remarks: Exact conversions between color spaces are often not possible.

Rhino.Display.ColorXYZ.#ctor(System.Double,System.Double,System.Double)
Create a new instance of ColorXYZ with custom channel values.
x: X channel value, channel will be limited to 0~1.
y: Y channel value, channel will be limited to 0~1.
z: Z channel value, channel will be limited to 0~1.

Rhino.Display.ColorXYZ.#ctor(System.Double,System.Double,System.Double,System.Double)
Create a new instance of ColorXYZ with custom channel values.
alpha: Alpha channel value, channel will be limited to 0~1.
x: X channel value, channel will be limited to 0~1.
y: Y channel value, channel will be limited to 0~1.
z: Z channel value, channel will be limited to 0~1.