Rhino.Display.RhinoViewport.Id
Unique id for this viewport

Rhino.Display.RhinoViewport.Name
name associated with this viewport

Rhino.Display.RhinoViewport.CameraTarget
Viewport target point

Rhino.Display.RhinoViewport.IsPlanView
true if construction plane z axis is parallel to camera direction

Rhino.Display.RhinoViewport.CameraX
unit to right vector

Rhino.Display.RhinoViewport.CameraY
unit up vector

Rhino.Display.RhinoViewport.CameraZ
unit vector in CameraDirection

Rhino.Display.RhinoViewport.FrustumAspect
frustum's width/height

Rhino.Display.RhinoViewport.ScreenPortAspect
screen port's width/height

Rhino.Display.RhinoViewport.IsVisible(Rhino.Geometry.BoundingBox)
returns true if some portion world coordinate bounding box is
potentially visible in the viewing frustum.
bbox:
Returns:

Rhino.Display.RhinoViewport.IsVisible(Rhino.Geometry.Point3d)
returns true if some portion world coordinate point is
potentially visible in the viewing frustum.
point:
Returns:

Rhino.Display.RhinoViewport.SetScreenSize(System.Int32,System.Int32)
Set the size of the RhinoViewport
width:
height:

Rhino.Display.RhinoViewport.SetClippingPlanes(Rhino.Geometry.BoundingBox)
Set optimal clipping planes to view objects in a world coordinate 3d bounding box
box:

Rhino.Display.RhinoViewport.SetCameraTarget(Rhino.Geometry.Point3d,System.Boolean)
Set viewport target point. By default the camera location
is translated so that the camera direction vector is parallel
to the vector from the camera location to the target location.
targetLocation: new target location
updateCameraLocation:
if true, the camera location is translated so that the camera direction
vector is parallel to the vector from the camera location to the target
location.
If false, the camera location is not changed.
Remarks:
In general, Rhino users expect to have the camera direction vector and
the vector from the camera location to the target location to be parallel.
If you use the RhinoViewport functions to set the camera location, camera
direction, and target point, then the relationship between these three
points and vectors is automatically maintained.  If you directly manipulate
the camera properties, then you should carefully set the target by calling
SetTarget() with updateCameraLocation=false.

Rhino.Display.RhinoViewport.SetCameraLocations(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Set viewport camera location and target location. The camera direction vector is
changed so that it is parallel to the vector from the camera location to
the target location.
targetLocation: new target location
cameraLocation: new camera location

Rhino.Display.RhinoViewport.SetCameraLocation(Rhino.Geometry.Point3d,System.Boolean)
Set viewport camera location. By default the target location is changed so that
the vector from the camera location to the target is parallel to the camera direction
vector.
cameraLocation: new camera location
updateTargetLocation:
if true, the target location is changed so that the vector from the camera
location to the target is parallel to the camera direction vector.
If false, the target location is not changed. See the remarks section of
RhinoViewport.SetTarget for important details.

Rhino.Display.RhinoViewport.SetCameraDirection(Rhino.Geometry.Vector3d,System.Boolean)
Set viewport camera direction. By default the target location is changed so that
the vector from the camera location to the target is parallel to the camera direction.
cameraDirection: new camera direction
updateTargetLocation:
if true, the target location is changed so that the vector from the camera
location to the target is parallel to the camera direction.
If false, the target location is not changed.
See the remarks section of RhinoViewport.SetTarget for important details.

Rhino.Display.RhinoViewport.ConstructionPlane


Rhino.Display.RhinoViewport.SetConstructionPlane(Rhino.DocObjects.ConstructionPlane)
Sets the construction plane to cplane.
cplane:

Rhino.Display.RhinoViewport.PushConstructionPlane(Rhino.DocObjects.ConstructionPlane)
Pushes the current construction plane on the viewport's
construction plane stack and sets the construction plane
to cplane.
cplane:

Rhino.Display.RhinoViewport.PopConstructionPlane
Sets the construction plane to the plane that was
active before the last call to PushConstructionPlane.
Returns: true if a construction plane was popped

Rhino.Display.RhinoViewport.NextConstructionPlane
Sets the construction plane to the plane that was
active before the last call to PreviousConstructionPlane.
Returns: true if successful

Rhino.Display.RhinoViewport.PreviousConstructionPlane
Sets the construction plane to the plane that was
active before the last call to NextConstructionPlane
or SetConstructionPlane.
Returns: true if successful

Rhino.Display.RhinoViewport.SetProjection(Rhino.Display.DefinedViewportProjection,System.String,System.Boolean)
Set viewport to a defined projection
projection:
viewName: if not null or empty, the name is set
updateConstructionPlane: if true, the construction plane is set to the viewport plane
Returns: true if successful

Rhino.Display.RhinoViewport.PopViewProjection
Sets the view projection and target to the settings at the top of
the view stack and removes those settings from the view stack.
Returns: true if there were settings that could be popped from the stack

Rhino.Display.RhinoViewport.NextViewProjection
Sets the view projection and target to the settings that
were active before the last call to PrevView.
Returns: true if the view stack was popped

Rhino.Display.RhinoViewport.PreviousViewProjection
Sets the view projection and target to the settings that
were active before the last call to NextViewProjection.
Returns: true if the view stack was popped

Rhino.Display.RhinoViewport.ZoomExtents
Dolly the camera location and so that the view frustum contains all of the
selected document objects that can be seen in view. If the projection is
perspective, the camera angle is not changed.
Returns: true if successful

Rhino.Display.RhinoViewport.ZoomExtentsSelected
Dolly the camera location and so that the view frustum contains all of the
selected document objects that can be seen in view. If the projection is
perspective, the camera angle is not changed.
Returns: true if successful

Rhino.Display.RhinoViewport.ZoomBoundingBox(Rhino.Geometry.BoundingBox)
Zooms the viewport to the given bounding box
box:
Returns: true if successful

Rhino.Display.RhinoViewport.MouseRotateAroundTarget(System.Drawing.Point,System.Drawing.Point)
Rotate viewport around target
mousePreviousPoint:
mouseCurrentPoint:

Rhino.Display.RhinoViewport.MouseRotateCamera(System.Drawing.Point,System.Drawing.Point)
Rotate view around camera location
mousePreviousPoint:
mouseCurrentPoint:

Rhino.Display.RhinoViewport.KeyboardRotate(System.Boolean,System.Double)
Keyboard arrow key interaction tool
leftRight: left/right rotate if true, up/down rotate if false
angleRadians:
If less than 0, rotation is to left or down.
If greater than 0, rotation is to right or up
Returns:

Rhino.Display.RhinoViewport.KeyboardDolly(System.Boolean,System.Double)
Keyboard arrow key interaction tool
leftRight: left/right dolly if true, up/down dolly if false
amount:
Returns:

Rhino.Display.RhinoViewport.KeyboardDollyInOut(System.Double)
Keyboard arrow key interaction tool
amount:
Returns:

Rhino.Display.RhinoViewport.Magnify(System.Double,System.Boolean)
magnificationFactor:
mode:
false = perform a "dolly" magnification by moving the camera towards/away from
the target so that the amount of the screen subtended by an object changes.
true = perform a "zoom" magnification by adjusting the "lens" angle
Returns:

Rhino.Display.RhinoViewport.Magnify(System.Double,System.Boolean,System.Drawing.Point)
magnificationFactor:
mode:
false = perform a "dolly" magnification by moving the camera towards/away from
the target so that the amount of the screen subtended by an object changes.
true = perform a "zoom" magnification by adjusting the "lens" angle
fixedScreenPoint:
Returns:

Rhino.Display.RhinoViewport.ClientToScreenPort(System.Drawing.Point@)
Convert a point in parent RhinoView client window coordinates to the Viewport screen port
client coordinates. The screen port of a RhinoViewport may not match the client area of
the parent RhinoView. This occurs in cases when the RhinoViewport is a nested child viewport
point:
point in client coordinates of parent RhinoView window as input. This is
converted to the screen port client coordinates of the viewport as output
Returns:
true if the point is inside of the RhinoViewport's screen port rectangle

Rhino.Display.RhinoViewport.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotates about the specified axis. A positive rotation angle results
in a counter-clockwise rotation about the axis (right hand rule).
angleRadians: angle of rotation in radians
rotationAxis: direction of the axis of rotation
rotationCenter: point on the axis of rotation
Returns: true if geometry successfully rotated

Rhino.Display.RhinoViewport.GetCameraFrame(Rhino.Geometry.Plane@)
Returns true if current camera orientation is valid
frame:
Returns:

Rhino.Display.RhinoViewport.GetFrustum(System.Double@,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
left: left < right
right: left < right
bottom: bottom < top
top: bottom < top
nearDistance: 0 < nearDistance < farDistance
farDistance: 0 < nearDistance < farDistance
Returns:

Rhino.Display.RhinoViewport.GetFrustumCenter(Rhino.Geometry.Point3d@)
Returns world coordinates of frustum's center
center:
Returns: true if the center was successfully computed

Rhino.Display.RhinoViewport.GetDepth(Rhino.Geometry.Point3d,System.Double@)
Get clipping distance of a point
point:
distance:
Returns:
True if the point is ing the view frustum and near_dist/far_dist were set.
False if the bounding box does not intesect the view frustum.

Rhino.Display.RhinoViewport.GetDepth(Rhino.Geometry.BoundingBox,System.Double@,System.Double@)
Get near and far clipping distances of a bounding box
bbox:
nearDistance:
farDistance:
Returns:
True if the bounding box intersects the view frustum and near_dist/far_dist were set.
False if the bounding box does not intesect the view frustum.

Rhino.Display.RhinoViewport.GetDepth(Rhino.Geometry.Sphere,System.Double@,System.Double@)
Get near and far clipping distances of a sphere
sphere:
nearDistance:
farDistance:
Returns:
True if the sphere intersects the view frustum and near_dist/far_dist were set.
False if the sphere does not intesect the view frustum.

Rhino.Display.RhinoViewport.GetFrustumNearPlane(Rhino.Geometry.Plane@)
Get near clipping plane
plane:
near clipping plane if camera and frustum are valid. The plane's
frame is the same as the camera's frame. The origin is located at
the intersection of the camera direction ray and the near clipping
plane.
Returns:
true if camera and frustum are valid

Rhino.Display.RhinoViewport.GetFrustumFarPlane(Rhino.Geometry.Plane@)
Get far clipping plane
plane:
far clipping plane if camera and frustum are valid. The plane's
frame is the same as the camera's frame. The origin is located at
the intersection of the camera direction ray and the far clipping
plane.
Returns:
true if camera and frustum are valid

Rhino.Display.RhinoViewport.GetFrustumLeftPlane(Rhino.Geometry.Plane@)
Get left world frustum clipping plane
plane:
frustum left side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin isthe point on the
plane that is closest to the camera location.
Returns: True if camera and frustum are valid and plane was set

Rhino.Display.RhinoViewport.GetFrustumRightPlane(Rhino.Geometry.Plane@)
Get right world frustum clipping plane
plane:
frustum right side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin isthe point on the
plane that is closest to the camera location.
Returns: True if camera and frustum are valid and plane was set

Rhino.Display.RhinoViewport.GetFrustumBottomPlane(Rhino.Geometry.Plane@)
Get bottom world frustum clipping plane
plane:
frustum bottom side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin isthe point on the
plane that is closest to the camera location.
Returns: True if camera and frustum are valid and plane was set

Rhino.Display.RhinoViewport.GetFrustumTopPlane(Rhino.Geometry.Plane@)
Get top world frustum clipping plane
plane:
frustum top side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin isthe point on the
plane that is closest to the camera location.
Returns: True if camera and frustum are valid and plane was set

Rhino.Display.RhinoViewport.GetNearRect
Get corners of near clipping plane rectangle
Returns:
[left_bottom, right_bottom, left_top, right_top] points on success
null on failure

Rhino.Display.RhinoViewport.GetFarRect
Get corners of far clipping plane rectangle
Returns:
[left_bottom, right_bottom, left_top, right_top] points on success
null on failure

Rhino.Display.RhinoViewport.GetScreenPort(System.Int32@,System.Int32@,System.Int32@,System.Int32@,System.Int32@,System.Int32@)
Location of viewport in pixels.  These are provided so you can set the port you are using
and get the appropriate transformations to and from screen space.
portLeft: portLeft != portRight
portRight: portLeft != portRight
portBottom: portTop != portBottom
portTop: portTop != portBottom
portNear:
portFar:
Returns:

Rhino.Display.RhinoViewport.GetTransform(Rhino.DocObjects.CoordinateSystem,Rhino.DocObjects.CoordinateSystem)
sourceSystem:
destinationSystem:
Returns:
4x4 transformation matrix (acts on the left)
Identity matrix is returned if this function fails

Rhino.Display.RhinoViewport.GetFrustumLine(System.Double,System.Double,Rhino.Geometry.Line@)
Get the world coordinate line in the view frustum that projects to a point on the screen.
screenX: (screenx,screeny) = screen location
screenY: (screenx,screeny) = screen location
worldLine:
3d world coordinate line segment starting on the near clipping
plane and ending on the far clipping plane.
Returns:
true if successful.
false if view projection or frustum is invalid.

Rhino.Display.RhinoViewport.GetWorldToScreenScale(Rhino.Geometry.Point3d,System.Double@)
pointInFrustum:
pixelsPerUnit:
scale = number of pixels per world unit at the 3d point
Returns:

Rhino.Display.RhinoViewport.ClearTraceImage
Remove trace image (background bitmap) for this viewport if one exists

Rhino.Display.RhinoViewport.SetTraceImage(System.String,Rhino.Geometry.Plane,System.Double,System.Double,System.Boolean,System.Boolean)
Set trace image (background bitmap) for this viewport
bitmapFileName:
plane:
width:
height:
grayscale:
filtered: true if image should be filtered (bilinear) before displayed
Returns: true if successful