Rhino.Geometry.LoftType
Enumerates all possible Loft types.

Rhino.Geometry.LoftType.Normal
Uses chord-length parameterization in the loft direction

Rhino.Geometry.LoftType.Tight
The surface sticks closely to the original curves. Uses square root of chord-length
parameterization in the loft direction

Rhino.Geometry.LoftType.Developable
Creates a separate developable surface or polysurface from each pair of curves.