Rhino.Geometry.MeshFace.#ctor(System.Int32,System.Int32,System.Int32)
Create a new triangular Mesh face.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.

Rhino.Geometry.MeshFace.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)
Create a new quadrangular Mesh face.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.
d: Index of fourth corner.

Rhino.Geometry.MeshFace.IsValid(System.Int32)
Gets a value indicating whether or not this mesh face
is considered to be valid. Unlike the simple IsValid function,
this function takes upper bound indices into account.
vertexCount: Number of vertices in the mesh that this face is a part of.
Returns: True if the face is considered valid, false if not.

Rhino.Geometry.MeshFace.Set(System.Int32,System.Int32,System.Int32)
Set all the corners for this face as a triangle.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.

Rhino.Geometry.MeshFace.Set(System.Int32,System.Int32,System.Int32,System.Int32)
Set all the corners for this face as a quad.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.
d: Index of fourth corner.