Rhino.PlugIns.LicenseUtils
License Manager Utilities

Rhino.PlugIns.LicenseUtils.Initialize
Initializes the license manager

Rhino.PlugIns.LicenseUtils.SetLanguage(System.Int32)
Sets the license manager's language id.

Rhino.PlugIns.LicenseUtils.GetLicense(System.Guid,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)
Verifies that the valid product license is available for use.
If the product is installed as a standalone node, the local
license will be validated. If the product is installed as a
network node, a loaner license will be requested by the
system's assigned Zoo server.
productId:
The Guid of the product whose license you want to verify
or request from a Zoo server.
productTitle:
A localized product title, such as "Rhinoceros 5.0", that can
be used in license request forms or message boxes, if needed.
validateDelegate:
Since the license client knows nothing about your product license,
you will need to valiate your product license by supplying a
callback function, or delegate, that can be called for valiation.
Returns:
True if the license was obtained and validated successful.
False if not successful or on error.

Rhino.PlugIns.LicenseUtils.ReturnLicense(System.Guid)
Returns a loaned out license to the Zoo server from which
it was borrowed.
productId:
The Guid of the product that you want to return.
Returns:
True if the license was returned successful.
False if not successful or on error.

Rhino.PlugIns.LicenseUtils.CheckOutLicense(System.Guid)
Checks out a license that is on loan from a Zoo server
on a permanent basis.
productId:
The Guid of the product that you want to check out.
Returns:
True if the license was checked out successful.
False if not successful or on error.

Rhino.PlugIns.LicenseUtils.CheckInLicense(System.Guid)
Checks in a previously checked out license to
the Zoo server from which it was checked out.
productId:
The Guid of the product that you want to check in.
Returns:
True if the license was checked in successful.
False if not successful or on error.

Rhino.PlugIns.LicenseUtils.ConvertLicense(System.Guid)
Converts a product license from a standalone node
to a network node.
productId:
The Guid of the product that you want to check in.
Returns:
True if the license was successfully converted.
False if not successful or on error.