Rhino.Geometry.Mesh.#ctor


Rhino.Geometry.Mesh.IsClosed
A mesh is considered to be closed when every mesh "edge" has
two or more faces.
Returns: True if the mesh is closed, false if it is not.

Rhino.Geometry.Mesh.Vertices
Gets access to the Vertices of this mesh.

Rhino.Geometry.Mesh.Normals
Gets access to the vertex normal vectors of this mesh.

Rhino.Geometry.Mesh.Faces
Gets access to the Faces of this mesh.

Rhino.Geometry.Mesh.FaceNormals
Gets access to the Face normals of this mesh.

Rhino.Geometry.Mesh.VertexColors
Gets access to the (optional) vertex colors of this mesh

Rhino.Geometry.Mesh.TextureCoordinates
Gets access to the Vertex texture coordinates of this mesh.

Rhino.Geometry.Mesh.CreateFromPlane(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Int32,System.Int32)
Create a planar mesh grid.
plane: Plane of mesh.
xInterval: Interval describing size and extends of mesh along plane x-direction.
yInterval: Interval describing size and extends of mesh along plane y-direction.
xCount: Number of faces in x-direction.
yCount: Number of faces in y-direction.
Throws System.ArgumentNullException: Thrown when plane is a null reference.
Throws System.ArgumentNullException: Thrown when xInterval is a null reference.
Throws System.ArgumentNullException: Thrown when yInterval is a null reference.
Throws System.ArgumentOutOfRangeException: Thrown when xCount is less than or equal to zero.
Throws System.ArgumentOutOfRangeException: Thrown when yCount is less than or equal to zero.

Rhino.Geometry.Mesh.CreateFromSphere(Rhino.Geometry.Sphere,System.Int32,System.Int32)
Create a mesh sphere.
sphere: Base sphere for mesh.
xCount: Number of faces in the around direction.
yCount: Number of faces in the top-to-bottom direction.
Throws System.ArgumentNullException: Thrown when sphere is invalid.
Throws System.ArgumentOutOfRangeException: Thrown when xCount is less than or equal to two.
Throws System.ArgumentOutOfRangeException: Thrown when yCount is less than or equal to two.

Rhino.Geometry.Mesh.CreateFromPlanarBoundary(Rhino.Geometry.Curve)
Attempt to create a mesh from a closed planar curve
boundary: must be a closed planar curve
Returns:
new Mesh on success
null on failure

Rhino.Geometry.Mesh.CreateFromPlanarBoundary(Rhino.Geometry.Curve,Rhino.Geometry.MeshingParameters)
Attempt to create a mesh from a closed planar curve
boundary: must be a closed planar curve
parameters: parameters used for creating the mesh
Returns:
new Mesh on success
null on failure

Rhino.Geometry.Mesh.CreateFromBrep(Rhino.Geometry.Brep)
Create a mesh from a Brep.
brep: Brep to approximate.
Returns: An array of meshes.

Rhino.Geometry.Mesh.CreateFromBrep(Rhino.Geometry.Brep,Rhino.Geometry.MeshParameters)
Create a mesh from a Brep.
brep: Brep to approximate.
meshParameters: Parameters to use during meshing.
Returns: An array of meshes.

Rhino.Geometry.Mesh.CreateFromBrep(Rhino.Geometry.Brep,Rhino.Geometry.MeshingParameters)
Create a mesh from a Brep.
brep: Brep to approximate.
meshingParameters: Parameters to use during meshing.
Returns: An array of meshes.

Rhino.Geometry.Mesh.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Compute the Solid Union of a set of Meshes.
meshes: Meshes to union.
Returns: An array of Mesh results or null on failure.

Rhino.Geometry.Mesh.CreateBooleanDifference(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Compute the Solid Difference of two sets of Meshes.
firstSet: First set of Meshes (the set to subtract from).
secondSet: Second set of Meshes (the set to subtract).
Returns: An array of Mesh results or null on failure.

Rhino.Geometry.Mesh.CreateBooleanIntersection(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Compute the Solid Intersection of two sets of Meshes.
firstSet: First set of Meshes.
secondSet: Second set of Meshes.
Returns: An array of Mesh results or null on failure.

Rhino.Geometry.Mesh.DuplicateMesh
Create an exact duplicate of this Mesh.

Rhino.Geometry.Mesh.IsManifold(System.Boolean,System.Boolean@,System.Boolean@)
Gets a value indicating whether or not the mesh is manifold.
A manifold mesh does not have any "edges" that are part of three or more faces.
topologicalTest:
If true, the query treats coincident vertices as the same.
isOriented:
isOriented will be set to True if the mesh is a manifold
and adjacent faces have compatible face normals.
hasBoundary:
hasBoundary will be set to True if the mesh is a manifold
and there is at least one "edge" with no more than one adjacent face.
Returns: True if every mesh "edge" has at most two adjacent faces.

Rhino.Geometry.Mesh.Compact
Removes any unreferenced objects from arrays, reindexes as needed
and shrinks arrays to minimum required size.
Returns: True on success, false on failure.

Rhino.Geometry.Mesh.Flip(System.Boolean,System.Boolean,System.Boolean)
Reverses the direction of the mesh.
vertexNormals: If True, vertex normals will be reversed.
faceNormals: If True, face normals will be reversed.
faceOrientation: If True, face orientations will be reversed.

Rhino.Geometry.Mesh.UnifyNormals
Attempts to fix inconsistencies in the directions of meshfaces for a mesh
Returns: number of faces that were modified

Rhino.Geometry.Mesh.SplitDisjointPieces
Splits up the mesh into its unconnected pieces
Returns: An array containing all the disjoint pieces that make up this Mesh.

Rhino.Geometry.Mesh.Split(Rhino.Geometry.Plane)
Split a mesh by an infinite plane
plane:
Returns:

Rhino.Geometry.Mesh.GetOutlines(Rhino.Geometry.Plane)
Create outlines of a mesh projected against a plane
plane:
Returns:

Rhino.Geometry.Mesh.GetOutlines(Rhino.Display.RhinoViewport)
Create outlines of a mesh. The projection information in the
viewport is used to determine how the outlines are projected
viewport:
Returns:

Rhino.Geometry.Mesh.GetNakedEdges
Returns all edges of a mesh that are considered "naked" in the
sense that the edge only has one face
Returns:

Rhino.Geometry.Mesh.GetClosestPoint(Rhino.Geometry.Point3d)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Mesh.ClosestPoint(Rhino.Geometry.Point3d)
Get the point on the mesh that is closest to a given test point.
testPoint: Point to seach for.
Returns: The point on the mesh closest to testPoint, or Point3d.Unset on failure.

Rhino.Geometry.Mesh.GetClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,System.Double)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Mesh.ClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,System.Double)
Get the point on the mesh that is closest to a given test point.
testPoint: Point to seach for.
pointOnMesh: Point on the mesh closest to testPoint.
maximumDistance:
Optional upper bound on the distance from test point to the mesh.
If you are only interested in finding a point Q on the mesh when
testPoint.DistanceTo(Q) < maximumDistance,
then set maximumDistance to that value.
This parameter is ignored if you pass 0.0 for a maximumDistance.
Returns:
Index of face that the closest point lies on if successful.
-1 if not successful; the value of pointOnMesh is undefined.

Rhino.Geometry.Mesh.GetClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,Rhino.Geometry.Vector3d@,System.Double)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Mesh.ClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,Rhino.Geometry.Vector3d@,System.Double)
Get the point on the mesh that is closest to a given test point.
testPoint: Point to seach for.
pointOnMesh: Point on the mesh closest to testPoint.
normalAtPoint: The normal vector of the mesh at the closest point.
maximumDistance:
Optional upper bound on the distance from test point to the mesh.
If you are only interested in finding a point Q on the mesh when
testPoint.DistanceTo(Q) < maximumDistance,
then set maximumDistance to that value.
This parameter is ignored if you pass 0.0 for a maximumDistance.
Returns:
Index of face that the closest point lies on if successful.
-1 if not successful; the value of pointOnMesh is undefined.

Rhino.Geometry.Mesh.PullPointsToMesh(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Pull a collection of points to a mesh.
points:
Returns:

Rhino.Geometry.Mesh.Offset(System.Double)
Make a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals.
distance:
Returns: new mesh on success, null on failure

Rhino.Geometry.Mesh.GetNakedEdgePointStatus
Returns an array of bool values equal in length to the number of vertices in this
mesh. Each value corresponds to a mesh vertex and is set to true if the vertex is
not completely surrounded by faces.
Returns: