Rhino.PlugIns.RenderPlugIn.Render(Rhino.RhinoDoc,Rhino.Commands.RunMode,System.Boolean)
Called by Render and RenderPreview commands if this plug-in is set as the default render engine.
doc:
mode:
fastPreview: If true, lower quality faster render expected
Returns: