Rhino.Geometry.Collections.NurbsCurvePointList.ControlPolygon
Create a polyline through all the control points.
Note that periodic curves generate a closed polyline with fewer
points than control-points.
Returns: A polyline connecting all control points.

Rhino.Geometry.Collections.NurbsCurvePointList.ChangeEndWeights(System.Double,System.Double)
Use a combination of scaling and reparameterization to change the end weights to the specified values.
w0: Weight for first control point.
w1: Weight for last control point.
Returns: True on success, false on failure.
Remarks:
The domain, euclidean locations of the control points, and locus of the curve
do not change, but the weights, homogeneous cv values and internal knot values
may change. If w0 and w1 are 1 and the curve is not rational, the curve is not changed.

Rhino.Geometry.Collections.NurbsCurvePointList.MakeRational
Turns the curve into a Rational nurbs curve.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.NurbsCurvePointList.MakeNonRational
Sets all the control points to 1.0
Returns: True on success, false on failure.

Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,System.Double,System.Double,System.Double,System.Double)
Set a specific control-point.
index: Index of control-point to set.
x: X coordinate of control-point.
y: Y coordinate of control-point.
z: Z coordinate of control-point.
weight: Weight of control-point.

Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,Rhino.Geometry.Point3d)
Set a specific control-point.
index: Index of control-point to set.
point: Coordinate of control-point.

Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,Rhino.Geometry.Point4d)
Set a specific weighted control-point.
index: Index of control-point to set.
point: Coordinate and weight of control-point.