Rhino.Geometry.Torus.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Create a new Torus from base pane and two radii.
basePlane: Base plane for major radius circle.
majorRadius: Radius of circle that lies at the heart of the torus.
minorRadius: Radius of torus section.

Rhino.Geometry.Torus.ToNurbsSurface
Convert this Torus to a NurbsSurface representation.
This is synonymous with calling NurbsSurface.CreateFromTorus().
Returns: A nurbs surface representation of this torus or null.

Rhino.Geometry.Torus.ToRevSurface
Convert this Torus to a RevSurface representation.
This is synonymous with calling RevSurface.CreateFromTorus().
Returns: A surface of revolution representation of this torus or null.