Rhino.DocObjects.Linetype.Name
The name of this linetype

Rhino.DocObjects.Linetype.PatternLength
Total length of one repeat of the pattern

Rhino.DocObjects.Linetype.SegmentCount
Number of segments in the pattern

Rhino.DocObjects.Linetype.Default
Set linetype to default settings

Rhino.DocObjects.Linetype.AppendSegment(System.Double,System.Boolean)
Adds a segment to the pattern
length:
isSolid:
If true, the length is interpreted as a line. If false,
the length is interpreted as a space
Returns: index of the added segment

Rhino.DocObjects.Linetype.RemoveSegment(System.Int32)
Removes a segment in the linetype
index: Zero based index of the segment to remove
Returns: True if the segment index was removed

Rhino.DocObjects.Linetype.SetSegment(System.Int32,System.Double,System.Boolean)
Sets the length and type of the segment at index
index: Zero based index of the segment
length:
isSolid:
Returns: True on success

Rhino.DocObjects.Linetype.GetSegment(System.Int32,System.Double@,System.Boolean@)
Get segment information at index
index:
length:
isSolid:
Throws System.IndexOutOfRangeException: