Rhino.DocObjects.Tables.NamedViewTable
All named views in a rhino document

Rhino.DocObjects.Tables.NamedViewTable.Item(System.Int32)
Conceptually, the named view table is an array of ViewInfo and their associated names.
The operator[] can be used to get individual ViewInfo items.
index: zero based array index
Returns:

Rhino.DocObjects.Tables.NamedViewTable.Document
Document that owns this table

Rhino.DocObjects.Tables.NamedViewTable.Count
Number of named views in the table

Rhino.DocObjects.Tables.NamedViewTable.Find(System.String)
Find a named view
name: name to search for
Returns:
>=0 index of the found named view
-1 no named view found

Rhino.DocObjects.Tables.NamedViewTable.Add(System.String,System.Guid)
Add named view to document which is based on an existing viewport
name:
If name is empty, a unique name is automatically created.
If there is already a named view with the same name, that view is replaced.
viewportId:
Id of an existing viewport in the document. View information is copied from this viewport
Returns:
0 based index of named view.
-1 on failure

Rhino.DocObjects.Tables.NamedViewTable.Delete(System.Int32)
Remove named view from the document
index: index of the named view in the named view table
Returns: true if successful

Rhino.DocObjects.Tables.NamedViewTable.Delete(System.String)
Remove named view from the document
name: name of the view
Returns: true if successful