Rhino.Geometry.Collections.NurbsCurveKnotList.InsertKnot(System.Double)
Insert a knot and update control point locations.
Does not change parameterization or locus of curve.
value: Knot value to insert.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.NurbsCurveKnotList.InsertKnot(System.Double,System.Int32)
Insert a knot and update control point locations.
Does not change parameterization or locus of curve.
value: Knot value to insert.
multiplicity: Multiplicity of knot to insert.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.NurbsCurveKnotList.KnotMultiplicity(System.Int32)
Get knot multiplicity
index: Index of knot to query.
Returns: The multiplicity (valence) of the knot.

Rhino.Geometry.Collections.NurbsCurveKnotList.CreateUniformKnots(System.Double)
Compute a clamped, uniform knot vector based on the current
degree and control point count. Does not change values of control
vertices.
knotSpacing: Spacing of subsequent knots.
Returns: True on success, False on failure.

Rhino.Geometry.Collections.NurbsCurveKnotList.CreatePeriodicKnots(System.Double)
Compute a clamped, uniform, periodic knot vector based on the current
degree and control point count. Does not change values of control
vertices.
knotSpacing: Spacing of subsequent knots.
Returns: True on success, False on failure.

Rhino.Geometry.Collections.NurbsCurveKnotList.ClampEnd(Rhino.Geometry.CurveEnd)
Clamp end knots. Does not modify control point locations.
end: Curve end to clamp.
Returns: True on success, false on failure.