Rhino.Geometry.Quaternion.IsValid
returns true if a, b, c, and d are valid finite IEEE doubles.

Rhino.Geometry.Quaternion.Conjugate
Returns the conjugate of the quaternion = (a,-b,-c,-d)

Rhino.Geometry.Quaternion.Inverse
Sets the quaternion to a/L2, -b/L2, -c/L2, -d/L2, where
L2 = length squared = (a*a + b*b + c*c + d*d). This is
the multiplicative inverse, i.e.,
(a,b,c,d)*(a/L2, -b/L2, -c/L2, -d/L2) = (1,0,0,0).
If "this" is the zero quaternion, then the zero quaternion is returned.

Rhino.Geometry.Quaternion.LengthSquared
Returns a*a + b*b + c*c + d*d

Rhino.Geometry.Quaternion.Vector
The "vector" or "imaginary" part of the quaternion = (b,c,d)

Rhino.Geometry.Quaternion.Scalar
The "real" or "scalar" part of the quaternion = a.

Rhino.Geometry.Quaternion.IsZero
True if a, b, c, and d are all zero.

Rhino.Geometry.Quaternion.IsScalar
True if b, c, and d are all zero.

Rhino.Geometry.Quaternion.IsVector
True if a = 0 and at least one of b, c, or d is not zero.

Rhino.Geometry.Quaternion.Invert
Sets the quaternion to a/L2, -b/L2, -c/L2, -d/L2, where
L2 = length squared = (a*a + b*b + c*c + d*d).  This is
the multiplicative inverse, i.e.,
(a,b,c,d)*(a/L2, -b/L2, -c/L2, -d/L2) = (1,0,0,0).
Returns:
True if successful.  False if the quaternion is zero and cannot be inverted.

Rhino.Geometry.Quaternion.MatrixForm
Returns 4x4 real valued matrix form of the quaternion
a  b  c  d
-b  a -d  c
-c  d  a -b
-d -c  b  a
which has the same arithmetic properties in as the quaternion.
Returns:
Remarks:
Do not confuse this with the rotation defined by the quaternion. This
function will only be interesting to math nerds and is not useful in
rendering or animation applications.

Rhino.Geometry.Quaternion.SetRotation(System.Double,Rhino.Geometry.Vector3d)
Sets the quaternion to cos(angle/2), sin(angle/2)*x, sin(angle/2)*y, sin(angle/2)*z
where (x,y,z) is the unit vector parallel to axis.  This is the unit quaternion
that represents the rotation of angle about axis.
angle: in radians
axisOfRotation:

Rhino.Geometry.Quaternion.Rotation(System.Double,Rhino.Geometry.Vector3d)
Returns the unit quaternion
cos(angle/2), sin(angle/2)*x, sin(angle/2)*y, sin(angle/2)*z
where (x,y,z) is the unit vector parallel to axis.  This is the
unit quaternion that represents the rotation of angle about axis.
angle: in radians
axisOfRotation:
Returns:

Rhino.Geometry.Quaternion.Product(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
The quaternion product of p and q.  This is the same value as p*q.
p:
q:
Returns:

Rhino.Geometry.Quaternion.CrossProduct(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
The vector cross product of p and q = (0,x,y,z) where
(x,y,z) = ON_CrossProduct(p.Vector(),q.Vector())
This is NOT the same as the quaternion product p*q.
p:
q:
Returns:

Rhino.Geometry.Quaternion.op_Multiply(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
quaternion multiplication is not commutative
a:
b:
Returns: