Rhino.RhinoMath.IsValidDouble(System.Double)
Tests a double value for validity. Since Rhino does not use Double.NaN by convention,
this test is more accurate that Double.IsNaN().
x: Number to test for validity.
Returns: True if the number if valid, False if the number is NaN, Infinity or Unset.

Rhino.RhinoMath.IsValidSingle(System.Single)
Tests a single (float) value for validity. Since Rhino does not use Single.NaN by convention,
this test is more accurate that Single.IsNaN().
x: Number to test for validity.
Returns: True if the number if valid, False if the number is NaN, Infinity or Unset.

Rhino.RhinoMath.UnitScale(Rhino.UnitSystem,Rhino.UnitSystem)
Scale factor for changing unit "standard" systems
from:
to:
Returns: