Rhino.Geometry.Arc
An Arc is a subcurve of 3d circle.
The curve is parameterized by an angle expressed in radians. For an IsValid arc
the total subtended angle AngleRadians() = Domain()(1) - Domain()(0) must satisfy
0 < AngleRadians() < 2*Pi
The parameterization of the Arc is inherited from the Circle it is derived from.
In particular
t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis
where xaxis and yaxis, (part of Circle.Plane) form an othonormal frame of the plane
containing the circle.

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Circle,System.Double)
Create a new arc from a base circle and an angle.
circle: Circle to base arc upon.
angleRadians: Sweep angle of arc (in radians)

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Circle,Rhino.Geometry.Interval)
Create a new arc from a base circle and an interval of angles.
circle: Circle to base arc upon.
angleIntervalRadians:
Increasing angle interval in radians with angleIntervalRadians.Length() <= 2.0*Math.PI

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Create a new arc from a base plane, a radius value and an angle.
plane: The plane of the arc (arc center will be located at plane origin)
radius: Radius of arc.
angleRadians: Sweep angle of arc (in radians)

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Point3d,System.Double,System.Double)
Create a new horizontal arc at the given center point, with a custom radius and angle.
center: Center point of arc.
radius: Radius of arc.
angleRadians: Sweep angle of arc (in radians)

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double,System.Double)
Create a new aligned arc at the given center point, with a custom radius and angle.
plane: Alignment plane for arc. The arc will be parallel to this plane.
center: Center point for arc.
radius: Radius of arc.
angleRadians: Sweep angle of arc (in radians)

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Create a new arc through three points. If the points are coincident
or colinear, this will result in an Invalid arc.
startPoint: Start point of arc.
pointOnInterior: Point on arc interior.
endPoint: End point of arc.

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Create a new arc from end points and a tangent vector.
If the tangent is parallel with the endpoints this will result in an Invalid arc.
pointA: Start point of arc.
tangentA: Tangent at start of arc.
pointB: End point of arc.

Rhino.Geometry.Arc.Invalid
Create an invalid arc.

Rhino.Geometry.Arc.IsValid
Gets a value indicating whether or not this arc is valid.
Detail:
Radius>0 and 0<AngleRadians()<=2*Math.Pi
Returns: True if the arc is valid.

Rhino.Geometry.Arc.Trim(Rhino.Geometry.Interval)
Set arc's angle domain (in radians) as a subdomain of the circle.
domain:
0 < domain[1] - domain[0] <= 2.0 * RhinoMath.Pi
Returns: True on success, false on failure.

Rhino.Geometry.Arc.BoundingBox
Compute the 3D axis aligned bounding box for this arc.
Returns: Bounding box of arc.

Rhino.Geometry.Arc.ClosestParameterTo(Rhino.Geometry.Point3d)
This method is Obsolete, use ClosestParameter() instead.

Rhino.Geometry.Arc.ClosestParameter(Rhino.Geometry.Point3d)
Get parameter on the arc closest to a test point.
testPoint: Point to get close to.
Returns: Parameter (in radians) of the point on the arc that
is closest to the test point. If testPoint is the center
of the arc, then the starting point of the arc is
(arc.Domain()[0]) returned. If no parameter could be found,
RhinoMath.UnsetValue is returned.

Rhino.Geometry.Arc.ClosestPointTo(Rhino.Geometry.Point3d)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Arc.ClosestPoint(Rhino.Geometry.Point3d)
Get the point on the arc that is closest to a test point.
testPoint: Point to get close to.
Returns:
The point on the arc that is closest to testPoint. If testPoint is
the center of the arc, then the starting point of the arc is returned.
UnsetPoint on failure.

Rhino.Geometry.Arc.Reverse
Reverse the orientation of the arc. Changes the domain from [a,b]
to [-b,-a].

Rhino.Geometry.Arc.Transform(Rhino.Geometry.Transform)
Transform the arc using a Transformation matrix.
xform: Transformations to apply.
Note that arcs cannot handle non-euclidian transformations.
Returns: True on success, False on failure.

Rhino.Geometry.Arc.ToNurbsCurve
Create a nurbs curve representation of this arc.
This amounts to the same as calling NurbsCurve.CreateFromArc().
Returns: A nurbs curve representation of this arc or null if no such representation could be made.