Rhino.Geometry.Collections.MeshVertexNormalList.Clear
Clear the Vertex Normal list on the mesh.

Rhino.Geometry.Collections.MeshVertexNormalList.Add(System.Single,System.Single,System.Single)
Adds a new vertex normal to the end of the list.
x: X component of new vertex normal.
y: Y component of new vertex normal.
z: Z component of new vertex normal.
Returns: The index of the newly added vertex normal.

Rhino.Geometry.Collections.MeshVertexNormalList.Add(System.Double,System.Double,System.Double)
Adds a new vertex normal to the end of the list.
x: X component of new vertex normal.
y: Y component of new vertex normal.
z: Z component of new vertex normal.
Returns: The index of the newly added vertex normal.

Rhino.Geometry.Collections.MeshVertexNormalList.Add(Rhino.Geometry.Vector3f)
Adds a new vertex normal to the end of the list.
normal: new vertex normal.
Returns: The index of the newly added vertex normal.

Rhino.Geometry.Collections.MeshVertexNormalList.Add(Rhino.Geometry.Vector3d)
Adds a new vertex normal to the end of the list.
normal: new vertex normal.
Returns: The index of the newly added vertex normal.

Rhino.Geometry.Collections.MeshVertexNormalList.AddRange(Rhino.Geometry.Vector3f[])
Append a collection of normal vectors.
normals: Normals to append.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,System.Single,System.Single,System.Single)
Sets or adds a normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.If [index] equals [Count], a new vertex normal is appended to the end of the list.If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
x: X component of vertex normal.
y: Y component of vertex normal.
z: Z component of vertex normal.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,System.Double,System.Double,System.Double)
Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.If [index] equals [Count], a new vertex normal is appended to the end of the list.If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
x: X component of vertex normal.
y: Y component of vertex normal.
z: Z component of vertex normal.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,Rhino.Geometry.Vector3f)
Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.If [index] equals [Count], a new vertex normal is appended to the end of the vertex list.If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
normal:
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,Rhino.Geometry.Vector3d)
Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.If [index] equals [Count], a new vertex normal is appended to the end of the list.If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
normal:
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormals(Rhino.Geometry.Vector3f[])
Set all normal vectors in one go. This method destroys the current normal array if it exists.
normals: Normals for the entire mesh.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexNormalList.ComputeNormals
Computes the vertex normals based on the physical shape of the mesh.
Returns: True on success, false on failure.

Rhino.Geometry.Collections.MeshVertexNormalList.UnitizeNormals
Unitize all vertex normals.
Returns: True on success, false on failure.