Rhino.Geometry.Point2f.#ctor(System.Single,System.Single)
Create a new two-dimensional vector from two components.
x: X component of vector.
y: Y component of vector.

Rhino.Geometry.Point2f.#ctor(System.Double,System.Double)
Create a new two-dimensional vector from two components.
x: X component of vector.
y: Y component of vector.

Rhino.Geometry.Point2f.Unset
Gets the standard Unset point.

Rhino.Geometry.Point2f.IsValid
Gets a value indicating whether or not this Point is considered valid.

Rhino.Geometry.Point2f.X
Gets or sets the X component of the vector.

Rhino.Geometry.Point2f.Y
Gets or sets the Y component of the vector.