Rhino.Geometry.Brep.IsSolid
Test Brep to see if it is a solid. (A "solid" is a closed oriented manifold.)

Rhino.Geometry.Brep.SolidOrientation
Gets the Solid orientation state of this Brep.

Rhino.Geometry.Brep.IsManifold
Gets a value indicating whether or not the Brep is Manifold.
Non-Manifold breps have at least one edge that is shared among three or more faces.

Rhino.Geometry.Brep.IsSurface
Returns true if the Brep has a single face and that face is geometrically the same
as the underlying surface.  I.e., the face has trivial trimming. In this case, the
surface is m_S[0]. The flag m_F[0].m_bRev records the correspondence between the
surface's natural parametric orientation and the orientation of the Brep.

Rhino.Geometry.Brep.CreateTrimmedSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Surface)
Create a Brep using the trimming information of a brep face and a surface.
Surface must be roughly the same shape and in the same location as the trimming brep face.
trimSource: BrepFace which contains trimmingSource brep.
surfaceSource: Surface that trims of BrepFace will be applied to.
Returns: A brep with the shape of surfaceSource and the trims of trimSource or null on failure.

Rhino.Geometry.Brep.CreateFromBox(Rhino.Geometry.BoundingBox)
Create new Brep that matches a bounding box
box:
Returns:

Rhino.Geometry.Brep.CreateFromBox(Rhino.Geometry.Box)
Create new Brep that matches an aligned box.
box: Box to match.
Returns: A Brep with 6 faces that is similar to the Box.

Rhino.Geometry.Brep.CreateFromBox(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Create new Brep from 8 corner points
corners:
8 points defining the box corners arranged as the vN lables indicate.
v7_______e6_____v6
|\             |\
| e7           | e5
|  \ ______e4_____\
e11 v4         |   v5
|   |        e10   |
|   |          |   |
v3--|---e2----v2   e9
\   e8         \   |
e3 |           e1 |
\ |            \ |
\v0_____e0_____\v1
Returns:

Rhino.Geometry.Brep.CreateFromCylinder(Rhino.Geometry.Cylinder,System.Boolean,System.Boolean)
Get a Brep definition of a cylinder
cylinder: cylinder.IsFinite() must be true
capBottom: if true end at cylinder.m_height[0] should be capped
capTop: if true end at cylinder.m_height[1] should be capped
Returns:
A Brep representation of the cylinder with a single face for the cylinder,
an edge along the cylinder seam, and vertices at the bottom and top ends of this
seam edge. The optional bottom/top caps are single faces with one circular edge
starting and ending at the bottom/top vertex.

Rhino.Geometry.Brep.CreateFromCone(Rhino.Geometry.Cone,System.Boolean)
Get a Brep representation of the cone with a single
face for the cone, an edge along the cone seam,
and vertices at the base and apex ends of this seam edge.
The optional cap is a single face with one circular edge
starting and ending at the base vertex.
cone:
capBottom: if true the base of the cone should be capped
Returns:

Rhino.Geometry.Brep.CreateFromRevSurface(Rhino.Geometry.RevSurface,System.Boolean,System.Boolean)
Get an Brep form of a surface of revolution.
surface:
capStart:
if true, the start of the revolute is not on the axis of revolution,
and the surface of revolution is closed, then a circular cap will be
added to close of the hole at the start of the revolute.
capEnd:
if true, the end of the revolute is not on the axis of revolution,
and the surface of revolution is closed, then a circular cap will be
added to close of the hole at the end of the revolute.
Returns:

Rhino.Geometry.Brep.CreateFromCornerPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
make a Brep with one face
corner1:
corner2:
corner3:
tolerance:
minimum edge length without collapsing to a singularity
Returns:

Rhino.Geometry.Brep.CreateFromCornerPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
make a Brep with one face
corner1:
corner2:
corner3:
corner4:
tolerance:
minimum edge length without collapsing to a singularity
Returns:

Rhino.Geometry.Brep.CreateEdgeSurface(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Creates a coons patch from 2, 3, or 4 curves
curves:
Returns: resulting brep or null on failure

Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Collections.CurveList)
Create a set of planar Breps as outlines by the loops.
inputLoops: Curve loops that delineate the planar boundaries.
Returns: An array of Planar Breps.

Rhino.Geometry.Brep.CreateFromSurface(Rhino.Geometry.Surface)
Create a Brep from a surface.  The resulting Brep has an outer boundary made
from four trims. The trims are ordered so that they run along the south, east,
north, and then west side of the surface's parameter space.
surface:
Returns: resulting brep or null on failure

Rhino.Geometry.Brep.CreateFromLoft(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean)
Creates one or more Breps by lofting through a set of curves.
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point
end:
Optional ending point of loft. Use Point3d.Unset if you do not want to include an end point
loftType: type of loft to perform
closed:
Returns:
Creates a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves

Rhino.Geometry.Brep.CreateFromLoftRebuild(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean,System.Int32)
Creates one or more Breps by lofting through a set of curves. Input for the loft is simplified by
rebuilding to a specified number of control points.
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point
end:
Optional ending point of lost. Use Point3d.Unset if you do not want to include an end point
loftType: type of loft to perform
closed:
rebuildPointCount:
Returns:
Creates a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves

Rhino.Geometry.Brep.CreateFromLoftRefit(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean,System.Double)
Creates one or more Breps by lofting through a set of curves. Input for the loft is simplified by
refitting to a specified tolerance
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point
end:
Optional ending point of lost. Use Point3d.Unset if you do not want to include an end point
loftType: type of loft to perform
closed:
refitTolerance:
Returns:
Creates a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves

Rhino.Geometry.Brep.JoinBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Joins the breps in the input array at any overlapping edges to form
as few as possible resulting breps. There may be more than one brep in the result array
brepsToJoin:
tolerance: 3d distance tolerance for detecting overlapping edges
Returns: new joined breps on success, null on failure

Rhino.Geometry.Brep.Duplicate
Creates copy of this Brep
Returns:

Rhino.Geometry.Brep.DuplicateBrep
Same as Duplicate() function, but performs the casting to a Brep for you.
Returns:

Rhino.Geometry.Brep.GetWireframe(System.Int32)
Create all the Wireframe curves for this Brep.
density: Wireframe density. Valid values range between -1 and 99.
Returns: An array of Wireframe curves or null on failure.

Rhino.Geometry.Brep.GetClosestPoint(Rhino.Geometry.Point3d)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Brep.GetClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,Rhino.Geometry.ComponentIndex@,System.Double@,System.Double@,System.Double,Rhino.Geometry.Vector3d@)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Brep.ClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,Rhino.Geometry.ComponentIndex@,System.Double@,System.Double@,System.Double,Rhino.Geometry.Vector3d@)
Finds a point on a brep that is closest to testPoint.
testPoint: base point to project to surface
closestPoint: location of the closest brep point
ci: Component index of the brep component that contains
the closest point. Possible types are brep_face, brep_edge or brep_vertex
s: If the ci type is brep_edge, then s is the parameter
of the closest edge point.
t: If the ci type is brep_face, then (s,t) is the parameter
of the closest edge point.
maximumDistance:
If maximumDistance > 0, then only points whose distance
is <= maximumDistance will be returned. Using a positive
value of maximumDistance can substantially speed up the search.
normal: The normal to the face if ci is a brep_face
and the tangent to the edge if ci is brep_edge.
Returns:

Rhino.Geometry.Brep.IsPointInside(Rhino.Geometry.Point3d,System.Double,System.Boolean)
Determine if a 3D point is inside of a brep. This
function only makes sense for closed manifold Breps.
point: 3d point to test
tolerance:
3d distance tolerance used for intersection and determining strict inclusion.
A good default is RhinoMath.SqrtEpsilon
strictlyIn:
if true, point is in if inside brep by at least tolerance.
if false, point is in if truly in or within tolerance of boundary.
Returns:
true if point is in, false if not

Rhino.Geometry.Brep.CapPlanarHoles(System.Double)
Return a new Brep that is equivalent to this Brep with all planar holes capped.
tolerance: Tolerance to use for capping.
Returns: New brep on success. null on error.

Rhino.Geometry.Brep.Join(Rhino.Geometry.Brep,System.Double,System.Boolean)
If any edges of this brep overlap edges of otherBrep, merge a copy of otherBrep into this
brep joining all edges that overlap within tolerance
otherBrep: Brep to be added to this brep
tolerance: 3d distance tolerance for detecting overlapping edges
compact: if true, set brep flags and tolerances, remove unused faces and edges
Returns: true if any edges were joined
Remarks:
if no edges overlap, this brep is unchanged.
otherBrep is copied if it is merged with this, and otherBrep is always unchanged
Use this to join a list of breps in a series.
When joining multiple breps in series, compact should be set to false.
Call compact on the last Join

Rhino.Geometry.Brep.Split(Rhino.Geometry.Brep,System.Double)
Splits a Brep into pieces
splitter:
intersectionTolerance:
Returns:

Rhino.Geometry.Brep.Split(Rhino.Geometry.Brep,System.Double,System.Boolean@)
Splits a Brep into pieces
splitter:
intersectionTolerance:
toleranceWasRaised:
set to true if the split failed at intersectionTolerance but succeeded
when the tolerance was increased to twice intersectionTolerance.
Returns: