Rhino.UI.Dialogs.KillSplash
Destroy the splash screen if it is being displayed

Rhino.UI.Dialogs.PushPickButton(System.Windows.Forms.Form,System.EventHandler{System.EventArgs})
Hides a form, calls a provided function, and then shows the form. This works for
modal forms. Useful for selecting objects or getting points while a modal dialog
is running
form:
pickFunction:

Rhino.UI.Dialogs.ShowTextDialog(System.String,System.String)
Display a text dialog similar to the dialog used for the "What" command
message: Text to display as the message content.
title: Test to display as the form title.
Returns: One of the System.Windows.Forms.DialogResult values.

Rhino.UI.Dialogs.ShowColorDialog(System.Drawing.Color@)
Display Rhino's color selection dialog.
color:
[in/out] Default color for dialog, and will receive new color if function returns true.
Returns: True if the color changed. False if the color has not changed or the user pressed cancel.

Rhino.UI.Dialogs.ShowColorDialog(System.Drawing.Color@,System.Boolean,System.String)
Display Rhino's color selection dialog.
color:
[in/out] Default color for dialog, and will receive new color if function returns true.
includeButtonColors:
Display button face and text options at top of named color list.
dialogTitle: The title of the dialog
Returns: True if the color changed. False if the color has not changed or the user pressed cancel

Rhino.UI.Dialogs.ShowComboListBox(System.String,System.String,System.Collections.IList)
title:
message:
items:
Returns:
selected item
null if the user canceled

Rhino.UI.Dialogs.ShowCheckListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.Boolean})
title:
message:
items:
checkState:
Returns: