Rhino.Geometry.Curve.PointAtStart
Evaluate point at the start of the curve.

Rhino.Geometry.Curve.PointAtEnd
Evaluate point at the end of the curve.

Rhino.Geometry.Curve.TangentAtStart
Evaluate unit tangent vector at the start of the curve.
Returns: Unit tangent vector of the curve at the start point.
Remarks: No error handling.

Rhino.Geometry.Curve.CreateInterpolatedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Interpolates a sequence of points. Used by InterpCurve Command
This routine works best when degree=3.
degree: The degree of the curve >=1.  Degree must be odd.
points:
Points to interpolate (Count must be >= 2)
Returns: interpolated curve on success. null on failure

Rhino.Geometry.Curve.CreateInterpolatedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,Rhino.Geometry.CurveKnotStyle)
Interpolates a sequence of points. Used by InterpCurve Command
This routine works best when degree=3.
degree: The degree of the curve >=1.  Degree must be odd.
points:
Points to interpolate. For periodic curves if the final point is a
duplicate of the initial point it is  ignored. (Count must be >=2)
knots:
Knot-style to use  and specifies if the curve should be periodic.
Returns: interpolated curve on success. null on failure

Rhino.Geometry.Curve.CreateInterpolatedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,Rhino.Geometry.CurveKnotStyle,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Interpolates a sequence of points. Used by InterpCurve Command
This routine works best when degree=3.
degree: The degree of the curve >=1.  Degree must be odd.
points:
Points to interpolate. For periodic curves if the final point is a
duplicate of the initial point it is  ignored. (Count must be >=2)
knots:
Knot-style to use  and specifies if the curve should be periodic.
startTangent:
endTangent:
Returns: interpolated curve on success. null on failure

Rhino.Geometry.Curve.CreateControlPointCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Create a curve from a set of control-point locations.
points: Control points.
degree: Degree of curve. The number of control points must be at least degree+1.

Rhino.Geometry.Curve.CreateControlPointCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Create a control-point of degree=3 (or less).
points: Control points of curve.

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Join a collection of curve segments together.
inputCurves: Curve segments to join.
Returns: An array of curves which contains

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Join a collection of curve segments together.
inputCurves: Curve segments to join.
joinTolerance: Joining tolerance,
i.e. the distance between segment end-points that is allowed.
Returns: An array of curves which contains

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double,System.Boolean)
Join a collection of curve segments together.
inputCurves: Curve segments to join.
joinTolerance: Joining tolerance,
i.e. the distance between segment end-points that is allowed.
preserveDirection:
If true, curve endpoints will be compared to curve startpoints.
If false, all start and endpoints will be compared and copies of input curves may be reversed in output.
Returns:

Rhino.Geometry.Curve.GetFilletPoints(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Double,System.Double@,System.Double@,Rhino.Geometry.Plane@)
Find points at which to cut a pair of curves so that a fillet of given radius can be inserted.
curve0: First curve to fillet.
curve1: Second curve to fillet.
radius: Fillet radius.
t0Base: Parameter value for base point on curve0.
t1Base: Parameter value for base point on curve1.
t0: Parameter value of fillet point on curve 0.
t1: Parameter value of fillet point on curve 1.
filletPlane:
The fillet is contained in this plane with the fillet center at the plane origin.
Returns: True on success, false on failure.
Remarks:
A fillet point is a pair of curve parameters (t0,t1) such that there is a circle
of radius point3 tangent to curve c0 at t0 and tangent to curve c1 at t1. Of all possible
fillet points this function returns the one which is the closest to the base point
t0Base, t1Base. Distance from the base point is measured by the sum of arc lengths
along the two curves.

Rhino.Geometry.Curve.CreateFillet(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)
Compute the fillet arc for a curve filleting operation.
curve0: First curve to fillet.
curve1: Second curve to fillet.
radius: Fillet radius.
t0Base: Parameter on curve0 where the fillet ought to start (approximately).
t1Base: Parameter on curve1 where the fillet ought to end (approximately).
Returns: The fillet arc on success, or Arc.Unset on failure.

Rhino.Geometry.Curve.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Calculates the boolean union of two or more closed, planar curves.
Note, curves must be co-planar.
curves: The co-planar curves to union.
Returns: Result curves on success, null if no union could be calculated.

Rhino.Geometry.Curve.CreateBooleanIntersection(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Calculates the boolean intersection of two closed, planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
curveB: The second closed, planar curve.
Returns: Result curves on success, null if no intersection could be calculated.

Rhino.Geometry.Curve.CreateBooleanDifference(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Calculates the boolean difference between two closed, planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
curveB: The second closed, planar curve.
Returns: Result curves on success, null if no difference could be calculated.

Rhino.Geometry.Curve.CreateBooleanDifference(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Calculates the boolean difference between a closed planar curve, and a list of closed planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
subtractors: curves to subtract from the first closed curve
Returns: Result curves on success, null if no difference could be calculated.

Rhino.Geometry.Curve.DoDirectionsMatch(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Compare two curves to see if they travel more or less in the same direction.
curveA: First curve to test.
curveB: Second curve to test.
Returns: True if both curves more or less point in the same direction,
false if they point in the opposite directions.

Rhino.Geometry.Curve.ProjectToBrep(Rhino.Geometry.Curve,Rhino.Geometry.Brep,Rhino.Geometry.Vector3d,System.Double)
Project a Curve onto a Brep along a given direction.
curve: Curve to project.
brep: Brep to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
Returns: An array of projected curves or null if the projection set is empty.

Rhino.Geometry.Curve.ProjectToBrep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double)
Project a Curve onto a collection of Breps along a given direction.
curve: Curve to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
Returns: An array of projected curves or null if the projection set is empty.

Rhino.Geometry.Curve.ProjectToBrep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double,System.Int32[]@)
Project a Curve onto a collection of Breps along a given direction.
curve: Curve to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
brepIndices: (out) Integers that identify for each resulting curve which Brep it was projected onto.
Returns: An array of projected curves or null if the projection set is empty.

Rhino.Geometry.Curve.ProjectToBrep(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double)
Project a collection of Curves onto a collection of Breps along a given direction.
curves: Curves to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
Returns: An array of projected curves or null if the projection set is empty.

Rhino.Geometry.Curve.ProjectToBrep(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double,System.Int32[]@,System.Int32[]@)
Project a collection of Curves onto a collection of Breps along a given direction.
curves: Curves to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
curveIndices: Index of which curve in the input list was the source for a curve in the return array.
brepIndices: Index of which brep was used to generate a curve in the return array.
Returns: An array of projected curves. Array is empty if the projection set is empty.

Rhino.Geometry.Curve.GetDistancesBetweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
curveA:
curveB:
tolerance:
maxDistance:
maxDistanceParameterA:
maxDistanceParameterB:
minDistance:
minDistanceParameterA:
minDistanceParameterB:
Returns:

Rhino.Geometry.Curve.Duplicate
Create an exact duplicate of this Curve.
Rhino.Geometry.Curve.DuplicateCurve

Rhino.Geometry.Curve.DuplicateCurve
Create an exact duplicate of this curve.
Returns: An exact copy of this curve.

Rhino.Geometry.Curve.IsLinear
Test a curve to see if it is linear to within RhinoMath.ZeroTolerance units (1e-12).
Returns: True if the curve is linear.

Rhino.Geometry.Curve.IsLinear(System.Double)
Test a curve to see if it is linear to within the custom tolerance.
tolerance: Tolerance to use when checking linearity.
Returns:
True if the ends of the curve are farther than tolerance apart
and the maximum distance from any point on the curve to
the line segment connecting the curve ends is <= tolerance.

Rhino.Geometry.Curve.IsPolyline
Several types of Curve can have the form of a polyline
including a degree 1 NurbsCurve, a PolylineCurve,
and a PolyCurve all of whose segments are some form of
polyline. IsPolyline tests a curve to see if it can be
represented as a polyline.
Returns:

Rhino.Geometry.Curve.TryGetPolyline(Rhino.Geometry.Polyline@)
Several types of Curve can have the form of a polyline
including a degree 1 NurbsCurve, a PolylineCurve,
and a PolyCurve all of whose segments are some form of
polyline. IsPolyline tests a curve to see if it can be
represented as a polyline.
polyline:
If true is returned, then the polyline form is returned here.
Returns: True if the curve can be represented as a polyline, false if not.

Rhino.Geometry.Curve.TryGetPolyline(Rhino.Geometry.Polyline@,System.Double[]@)
Several types of Curve can have the form of a polyline
including a degree 1 NurbsCurve, a PolylineCurve,
and a PolyCurve all of whose segments are some form of
polyline. IsPolyline tests a curve to see if it can be
represented as a polyline.
polyline:
If true is returned, then the polyline form is returned here.
parameters:
if true is returned, then the parameters of the polyline
points are returned here
Returns: True if the curve can be represented as a polyline, false if not.

Rhino.Geometry.Curve.IsArc
Test a curve to see if it can be represented by an arc or circle within RhinoMath.ZeroTolerance.
Returns:
True if the curve can be represented by an Arc or a Circle to within tolerance.

Rhino.Geometry.Curve.IsArc(System.Double)
Test a curve to see if it can be represented by an arc or circle within the given tolerance.
tolerance: Tolerance to use when checking.
Returns:
True if the curve can be represented by an Arc or a Circle to within tolerance.

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Arc@)
Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
arc: On success, the Arc will be filled in.
Returns: True if the curve could be converted into an Arc.

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Arc@,System.Double)
Try to convert this curve into an Arc using a custom tolerance.
arc: On success, the Arc will be filled in.
tolerance: Tolerance to use when checking.
Returns: True if the curve could be converted into an Arc.

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Plane,Rhino.Geometry.Arc@)
Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
plane: Plane in which the comparison is performed.
arc: On success, the Arc will be filled in.
Returns: True if the curve could be converted into an Arc within the given plane.

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Plane,Rhino.Geometry.Arc@,System.Double)
Try to convert this curve into an Arc using a custom tolerance.
plane: Plane in which the comparison is performed.
arc: On success, the Arc will be filled in.
tolerance: Tolerance to use when checking.
Returns: True if the curve could be converted into an Arc within the given plane.

Rhino.Geometry.Curve.IsCircle
Test a curve to see if it can be represented by a circle within RhinoMath.ZeroTolerance.
Returns:
True if the Curve can be represented by a circle within tolerance.

Rhino.Geometry.Curve.IsCircle(System.Double)
Test a curve to see if it can be represented by a circle within the given tolerance.
tolerance: Tolerance to use when checking.
Returns:
True if the curve can be represented by a Circle to within tolerance.

Rhino.Geometry.Curve.TryGetCircle(Rhino.Geometry.Circle@)
Try to convert this curve into a Circle using RhinoMath.ZeroTolerance.
circle: On success, the Circle will be filled in.
Returns: True if the curve could be converted into a Circle.

Rhino.Geometry.Curve.TryGetCircle(Rhino.Geometry.Circle@,System.Double)
Try to convert this curve into a Circle using a custom tolerance.
circle: On success, the Circle will be filled in.
tolerance: Tolerance to use when checking.
Returns: True if the curve could be converted into a Circle within tolerance.

Rhino.Geometry.Curve.IsEllipse
Test a curve to see if it can be represented by an ellipse within RhinoMath.ZeroTolerance.
Returns:
True if the Curve can be represented by an ellipse within tolerance.

Rhino.Geometry.Curve.IsEllipse(System.Double)
Test a curve to see if it can be represented by an ellipse within a given tolerance.
tolerance: Tolerance to use for checking.
Returns:
True if the Curve can be represented by an ellipse within tolerance.

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Ellipse@)
Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
ellipse: On success, the Ellipse will be filled in.
Returns: True if the curve could be converted into an Ellipse.

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Ellipse@,System.Double)
Try to convert this curve into an Ellipse using a custom tolerance.
ellipse: On success, the Ellipse will be filled in.
tolerance: Tolerance to use when checking.
Returns: True if the curve could be converted into an Ellipse.

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Plane,Rhino.Geometry.Ellipse@)
Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
plane: Plane in which the comparison is performed.
ellipse: On success, the Ellipse will be filled in.
Returns: True if the curve could be converted into an Ellipse within the given plane.

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Plane,Rhino.Geometry.Ellipse@,System.Double)
Try to convert this curve into an Ellipse using a custom tolerance.
plane: Plane in which the comparison is performed.
ellipse: On success, the Ellipse will be filled in.
tolerance: Tolerance to use when checking.
Returns: True if the curve could be converted into an Ellipse within the given plane.

Rhino.Geometry.Curve.IsPlanar
Test a curve for planarity.
Returns:
True if the curve is planar (flat) to within RhinoMath.ZeroTolerance units (1e-12).

Rhino.Geometry.Curve.IsPlanar(System.Double)
Test a curve for planarity.
tolerance: Tolerance to use when checking.
Returns:
True if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.

Rhino.Geometry.Curve.TryGetPlane(Rhino.Geometry.Plane@)
Test a curve for planarity and return the plane.
plane: On success, the plane parameters are filled in.
Returns:
True if there is a plane such that the maximum distance from the curve to the plane is <= RhinoMath.ZeroTolerance.

Rhino.Geometry.Curve.TryGetPlane(Rhino.Geometry.Plane@,System.Double)
Test a curve for planarity and return the plane.
plane: On success, the plane parameters are filled in.
tolerance: Tolerance to use when checking.
Returns:
True if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.

Rhino.Geometry.Curve.IsInPlane(Rhino.Geometry.Plane)
Test a curve to see if it lies in a specific plane.
testPlane: Plane to test for.
Returns:
True if the maximum distance from the curve to the testPlane is <= RhinoMath.ZeroTolerance.

Rhino.Geometry.Curve.IsInPlane(Rhino.Geometry.Plane,System.Double)
Test a curve to see if it lies in a specific plane.
testPlane: Plane to test for.
tolerance: Tolerance to use when checking.
Returns:
True if the maximum distance from the curve to the testPlane is <= tolerance.

Rhino.Geometry.Curve.ChangeClosedCurveSeam(System.Double)
If this curve is closed, then modify it so that the start/end point is at curve parameter t.
t:
Curve parameter of new start/end point. The returned curves domain will start at t.
Returns: True on success, false on failure.

Rhino.Geometry.Curve.IsClosable(System.Double)
Decide if it makes sense to close off this curve by moving the endpoint
to the start based on start-end gap size and length of curve as
approximated by chord defined by 6 points.
tolerance:
Maximum allowable distance between start and end.
If start - end gap is greater than tolerance, this function will return False.
Returns: True if start and end points are close enough based on above conditions.

Rhino.Geometry.Curve.IsClosable(System.Double,System.Double,System.Double)
Decide if it makes sense to close off this curve by moving the endpoint
to the start based on start-end gap size and length of curve as
approximated by chord defined by 6 points.
tolerance:
Maximum allowable distance between start and end.
If start - end gap is greater than tolerance, this function will return False.
minimumAbsoluteSize:
If greater than 0.0 and none of the interior sampled points are at
least minimumAbsoluteSize from start, this function will return False.
minimumRelativeSize:
If greater than 1.0 and chord length is less than
minimumRelativeSize*gap, this function will return False.
Returns: True if start and end points are close enough based on above conditions.

Rhino.Geometry.Curve.MakeClosed(System.Double)
If IsClosed, just return True. Otherwise, decide if curve can be closed as
follows: Linear curves polylinear curves with 2 segments, Nurbs with 3 or less
control points cannot be made closed. Also, if tolerance > 0 and the gap between
start and end is larger than tolerance, curve cannot be made closed.
Adjust the curve's endpoint to match its start point.
tolerance:
If nonzero, and the gap is more than tolerance, curve cannot be made closed.
Returns: True on success, false on failure.

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Vector3d)
Determine the orientation (counterclockwise or clockwise) of a closed planar curve in a given plane.
Only works with simple (no self intersections) closed planar curves.
upDirection:
Returns: The orientation of this curve with respect to a defined up direction.

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Plane)
Determine the orientation (counterclockwise or clockwise) of a closed planar curve in a given plane.
Only works with simple (no self intersections) closed planar curves.
plane:
The plane in which to solve the orientation.
Returns: The orientation of this curve in the given plane.

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Transform)
Determine the orientation (counterclockwise or clockwise) of a closed planar curve.
Only works with simple (no self intersections) closed planar curves.
xform:
Transformation to map the curve to the xy plane. If the curve is parallel
to the xy plane, you may pass Identity matrix.
Returns: The orientation of this curve in the world xy-plane.

Rhino.Geometry.Curve.Reverse
Reverse the direction of the curve.
Returns: True on success, false on failure.
Remarks: If reversed, the domain changes from [a,b] to [-b,-a]

Rhino.Geometry.Curve.GetClosestPoint(Rhino.Geometry.Point3d,System.Double@)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Curve.ClosestPoint(Rhino.Geometry.Point3d,System.Double@)
Find parameter of the point on a curve that is closest to testPoint.
If the maximumDistance parameter is > 0, then only points whose distance
to the given point is <= maximumDistance will be returned.  Using a
positive value of maximumDistance can substantially speed up the search.
testPoint: Point to search from.
t: Parameter of local closest point.
Returns: True on success, false on failure.

Rhino.Geometry.Curve.GetClosestPoint(Rhino.Geometry.Point3d,System.Double@,System.Double)
This method is Obsolete, use ClosestPoint() instead.

Rhino.Geometry.Curve.ClosestPoint(Rhino.Geometry.Point3d,System.Double@,System.Double)
Find parameter of the point on a curve that is closest to testPoint.
If the maximumDistance parameter is > 0, then only points whose distance
to the given point is <= maximumDistance will be returned.  Using a
positive value of maximumDistance can substantially speed up the search.
testPoint: Point to project.
t: parameter of local closest point returned here
maximumDistance:
Returns: True on success, false on failure.

Rhino.Geometry.Curve.Contains(Rhino.Geometry.Point3d)
Compute the relationship between a point and a closed curve region.
This curve must be closed or the return value will be Unset.
Both curve and point are projected to the World XY plane.
testPoint: Point to test.
Returns: Relationship between point and curve region.

Rhino.Geometry.Curve.Contains(Rhino.Geometry.Point3d,Rhino.Geometry.Plane)
Compute the relationship between a point and a closed curve region.
This curve must be closed or the return value will be Unset.
testPoint: Point to test.
plane: Plane in in which to compare point and region.
Returns: Relationship between point and curve region.

Rhino.Geometry.Curve.Contains(Rhino.Geometry.Point3d,Rhino.Geometry.Plane,System.Double)
Compute the relationship between a point and a closed curve region.
This curve must be closed or the return value will be Unset.
testPoint: Point to test.
plane: Plane in in which to compare point and region.
tolerance: Tolerance to use during comparison.
Returns: Relationship between point and curve region.

Rhino.Geometry.Curve.PointAt(System.Double)
Evaluate point at a curve parameter.
t: Evaluation parameter.
Returns: Point (location of curve at the parameter t).
Remarks: No error handling.

Rhino.Geometry.Curve.PointAtLength(System.Double)
Get a point at a certain length along the curve. The length must be
non-negative and less than or equal to the length of the curve.
Lengths will not be wrapped when the curve is closed or periodic.
length: Length along the curve between the start point and the returned point.
Returns: Point on the curve at the specified length from the start point or Poin3d.Unset on failure.

Rhino.Geometry.Curve.PointAtNormalizedLength(System.Double)
Get a point at a certain normalized length along the curve. The length must be
between or including 0.0 and 1.0, where 0.0 equals the start of the curve and
1.0 equals the end of the curve.
length: Normalized length along the curve between the start point and the returned point.
Returns: Point on the curve at the specified normalized length from the start point or Poin3d.Unset on failure.

Rhino.Geometry.Curve.SetStartPoint(Rhino.Geometry.Point3d)
Force the curve to start at a specified point.
Not all curve types support this operation.
point: New start point of curve.
Returns: True on success, false on failure.
Remarks: Some start points cannot be moved. Be sure to check return code.

Rhino.Geometry.Curve.SetEndPoint(Rhino.Geometry.Point3d)
Force the curve to end at a specified point.
Not all curve types support this operation.
point: New end point of curve.
Returns: True on success, false on failure.
Remarks: Some end points cannot be moved. Be sure to check return code

Rhino.Geometry.Curve.TangentAt(System.Double)
Evaluate unit tangent vector at a curve parameter.
t: Evaluation parameter.
Returns: Unit tangent vector of the curve at the parameter t.
Remarks: No error handling.

Rhino.Geometry.Curve.FrameAt(System.Double,Rhino.Geometry.Plane@)
Return a 3d frame at a parameter.
t: Evaluation parameter.
plane: The frame is returned here.
Returns: True on success, false on failure.

Rhino.Geometry.Curve.DerivativeAt(System.Double)
Evaluate the first derivative at a curve parameter.
t: Evaluation parameter.
Returns: First derivative of the curve at the parameter t.
Remarks: No error handling.

Rhino.Geometry.Curve.GetPerpendicularFrames(System.Collections.Generic.IEnumerable{System.Double})
Get a collection of perpendicular frames along the curve. Perpendicular frames
are also known as 'Zero-twisting frames' and they minimize rotation from one frame to the next.
parameters: A collection of strictly increasing curve parameters to place perpendicular frames on.
Returns: An array of perpendicular frames on success or null on failure.
Throws System.InvalidOperationException: Thrown when the curve parameters are not increasing.

Rhino.Geometry.Curve.IsContinuous(Rhino.Geometry.Continuity,System.Double)
Test continuity at a curve parameter value.
continuityType: Type of continuity to test for.
t: Parameter to test.
Returns:
True if the curve has at least the c type continuity at the parameter t.

Rhino.Geometry.Curve.GetNextDiscontinuity(Rhino.Geometry.Continuity,System.Double,System.Double,System.Double@)
Search for a derivative, tangent, or curvature discontinuity.
continuityType: Type of continuity to search for.
t0:
Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it
possible to repeatedly call GetNextDiscontinuity() and step through the discontinuities.
t1:
(t0 != t1)  If there is a discontinuity at t1 it will be ignored unless continuityType is
a locus discontinuity type and t1 is at the start or end of the curve.
t: If a discontinuity is found, then t reports the parameter at the discontinuity.
Returns:
Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
true if a parametric discontinuity was found strictly between t0 and t1. Note well that
all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
true if a locus discontinuity was found strictly between t0 and t1 or at t1 is the at the end
of a curve. Note well that all open curves (IsClosed()=false) are locus discontinuous at the
ends of their domains.  All closed curves (IsClosed()=true) are at least C0_locus_continuous at
the ends of their domains.

Rhino.Geometry.Curve.GetLength
Get the length of the curve with a fractional tolerance of 1.0e-8
Returns: The length of the curve on success, or zero on failure.

Rhino.Geometry.Curve.IsShort(System.Double)
Used to quickly find short curves.
tolerance: Length threshold value for "shortness".
Returns: True if the length of the curve is <= tolerance.
Remarks: Faster than calling Length() and testing the result.

Rhino.Geometry.Curve.IsShort(System.Double,Rhino.Geometry.Interval)
Used to quickly find short curves.
tolerance: Length threshold value for "shortness".
subdomain:
The test is performed on the interval that is the intersection of subdomain with Domain()
Returns: True if the length of the curve is <= tolerance.
Remarks: Faster than calling Length() and testing the result.

Rhino.Geometry.Curve.RemoveShortSegments(System.Double)
Looks for segments that are shorter than tolerance that can be removed.
Does not change the domain, but it will change the relative parameterization.
tolerance: Tolerance which defines "short" segments.
Returns:
True if removable short segments were found.
False if no removable short segments were found.

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@)
Get the parameter along the curve which coincides with a given length along the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the curve.
t:
Parameter such that the length of the curve from the curve start point to t equals length.
Returns: True on success, false on failure.

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@,System.Double)
Get the parameter along the curve which coincides with a given length along the curve.
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the curve.
t:
Parameter such that the length of the curve from the curve start point to t equals s.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance
Returns: True on success, false on failure.

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@,Rhino.Geometry.Interval)
Get the parameter along the curve which coincides with a given length along the curve.
A fractional tolerance of 1e-8 is used in this version of the function
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the subdomain.
t:
Parameter such that the length of the curve from the start of the subdomain to t is s.
subdomain:
The calculation is performed on the specified sub-domain of the curve rather than the whole curve.
Returns: True on success, false on failure.

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@,System.Double,Rhino.Geometry.Interval)
Get the parameter along the curve which coincides with a given length along the curve.
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the subdomain.
t:
Parameter such that the length of the curve from the start of the subdomain to t is s
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance
subdomain:
The calculation is performed on the specified sub-domain of the curve rather than the whole curve.
Returns: True on success, false on failure.

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length
Returns: True on success, false on failure.

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@,System.Double)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
Returns: True on success, false on failure.

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@,Rhino.Geometry.Interval)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length.
subdomain:
The calculation is performed on the specified sub-domain of the curve.
Returns: True on success, false on failure.

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@,System.Double,Rhino.Geometry.Interval)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
subdomain:
The calculation is performed on the specified sub-domain of the curve.
Returns: True on success, false on failure.

Rhino.Geometry.Curve.DivideByLength(System.Double,System.Boolean,Rhino.Geometry.Point3d[]@)
Divide the curve into specific length segments.
segmentLength: The length of each and every segment (except potentially the last one).
includeStart: If true, then the point at the start of the curve is included.
points: If function is successful, points at each parameter value are returned in points
Returns: Array containing division curve parameters if successful, null on failure.

Rhino.Geometry.Curve.DivideEquidistant(System.Double)
Calculates 3d points on a curve where the linear distance between the points is equal
distance: The distance betwen division points
Returns:

Rhino.Geometry.Curve.DivideAsContour(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Contour divide the curve by defining a contour line
contourStart:
contourEnd:
interval:
Returns:

Rhino.Geometry.Curve.GetCurveParameterFromNurbsFormParameter(System.Double,System.Double@)
Convert a NURBS curve parameter to a curve parameter.
nurbsParameter: Nurbs form parameter.
curveParameter: Curve parameter
Returns: True on success, false on failure.
Remarks:
If HasNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.

Rhino.Geometry.Curve.GetNurbsFormParameterFromCurveParameter(System.Double,System.Double@)
Convert a curve parameter to a NURBS curve parameter
curveParameter: Curve parameter
nurbsParameter: Nurbs form parameter
Returns: True on success, false on failure.
Remarks:
If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.

Rhino.Geometry.Curve.Extend(Rhino.Geometry.CurveEnd,System.Double,Rhino.Geometry.CurveExtensionStyle)
Extend a curve by a specific length.
side: Curve end to extend.
length: Length to add to the curve end.
style: Extension style.
Returns: A curve with extended ends or null on failure.

Rhino.Geometry.Curve.Extend(Rhino.Geometry.CurveEnd,Rhino.Geometry.CurveExtensionStyle,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Extend a curve until it intersects a collection of objects
side: The end of the curve to extend.
style:
geometry: A collection of objects. Allowable object types are Curve, Surface, Brep.
Returns: New extended curve result on success, null on failure.

Rhino.Geometry.Curve.Extend(Rhino.Geometry.CurveEnd,Rhino.Geometry.CurveExtensionStyle,Rhino.Geometry.Point3d)
Extend a curve to a point
side: The end of the curve to extend.
style:
endPoint:
Returns: New extended curve result on success, null on failure.

Rhino.Geometry.Curve.ExtendByLine(Rhino.Geometry.CurveEnd,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Extend a curve by a line until it intersects a collection of objects.
side: The end of the curve to extend.
geometry: A collection of objects. Allowable object types are Curve, Surface, Brep.
Returns: New extended curve result on success, null on failure.

Rhino.Geometry.Curve.ExtendByArc(Rhino.Geometry.CurveEnd,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Extend a curve by an Arc until it intersects a collection of objects.
side: The end of the curve to extend.
geometry: A collection of objects. Allowable object types are Curve, Surface, Brep.
Returns: New extended curve result on success, null on failure.

Rhino.Geometry.Curve.Simplify(Rhino.Geometry.CurveSimplifyOptions,System.Double,System.Double)
Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
2. The Nurbs Curves segments do not have fully multiple interior knots.
3. Rational Nurbs curves do not have constant weights.
4. Any segment for which IsLinear() or IsArc() is true is a Line,
Polyline segment, or an Arc.
5. Adjacent Colinear or Cocircular segments are combined.
6. Segments that meet with G1-continuity have there ends tuned up so
that they meet with G1-continuity to within machine precision.
options: Simplification options
distanceTolerance:
angleToleranceRadians:
Returns: New simplified curve on success, null on failure.

Rhino.Geometry.Curve.SimplifyEnd(Rhino.Geometry.CurveEnd,Rhino.Geometry.CurveSimplifyOptions,System.Double,System.Double)
Same as SimplifyCurve, but simplifies only the last two segments at "side" end.
end: If CurveEnd.Start the function simplifies the last two start
side segments, otherwise if CurveEnd.End the last two end side segments are simplified.
options: simplification options.
distanceTolerance:
angleToleranceRadians:
Returns: New simplified curve on success, null on failure.

Rhino.Geometry.Curve.Fair(System.Double,System.Double,System.Int32,System.Int32,System.Int32)
Fairs a curve object. Fair works best on degree 3 (cubic) curves. Attempts to
remove large curvature variations while limiting the geometry changes to be no
more than the specified tolerance.
distanceTolerance: Maximum allowed distance the faired curve is allowed to deviate from the input.
angleTolerance: (in radians) kinks with angles <= angleTolerance are smoothed out 0.05 is a good default.
clampStart: The number of (control vertices-1) to preserve at start.
0 = preserve start point1 = preserve start point and 1st derivative2 = preserve start point, 1st and 2nd derivative
clampEnd: Same as clampStart
iterations: The number of iteratoins to use in adjusting the curve.
Returns: Returns new faired Curve on success, null on failure.

Rhino.Geometry.Curve.HasNurbsForm
Does a NURBS curve representation of this curve exist?
Returns:
0   unable to create NURBS representation with desired accuracy.
1   success - NURBS parameterization matches the curve's to the desired accuracy
2   success - NURBS point locus matches the curve's and the domain of the NURBS
curve is correct. However, This curve's parameterization and the
NURBS curve parameterization may not match. This situation happens
when getting NURBS representations of curves that have a
transendental parameterization like circles

Rhino.Geometry.Curve.ToNurbsCurve
Create a NURBS curve representation of this curve.
Returns: NURBS representation of the curve on success, null on failure.

Rhino.Geometry.Curve.ToNurbsCurve(Rhino.Geometry.Interval)
Create a NURBS curve representation of this curve.
subdomain: The NURBS representation for this portion of the curve is returned.
Returns: NURBS representation of the curve on success, null on failure.

Rhino.Geometry.Curve.ToPolyline(System.Int32,System.Int32,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Boolean)
Get a polyline approximation of a curve.
mainSegmentCount:
If mainSegmentCount <= 0, then both subSegmentCount and mainSegmentCount are ignored.
If mainSegmentCount > 0, then subSegmentCount must be >= 1. In this
case the nurb will be broken into mainSegmentCount equally spaced
chords. If needed, each of these chords can be split into as many
subSegmentCount sub-parts if the subdivision is necessary for the
mesh to meet the other meshing constraints. In particular, if
subSegmentCount = 0, then the curve is broken into mainSegmentCount
pieces and no further testing is performed.
subSegmentCount:
maxAngleRadians:
( 0 to pi ) Maximum angle (in radians) between unit tangents at
adjacent vertices.
maxChordLengthRatio: Maximum permitted value of
(distance chord midpoint to curve) / (length of chord).
maxAspectRatio: If maxAspectRatio < 1.0, the parameter is ignored.
If 1 <= maxAspectRatio < sqrt(2), it is treated as if maxAspectRatio = sqrt(2).
This parameter controls the maximum permitted value of
(length of longest chord) / (length of shortest chord).
tolerance: If tolerance = 0, the parameter is ignored.
This parameter controls the maximum permitted value of the
distance from the curve to the polyline.
minEdgeLength:
maxEdgeLength: If maxEdgeLength = 0, the parameter
is ignored. This parameter controls the maximum permitted edge length.
keepStartPoint: If true the starting point of the curve
is added to the polyline. If false the starting point of the curve is
not added to the polyline.
Returns: PolylineCurve on success, null on error.

Rhino.Geometry.Curve.ToPolyline(System.Int32,System.Int32,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Boolean,Rhino.Geometry.Interval)
Get a polyline approximation of a curve.
mainSegmentCount:
If mainSegmentCount <= 0, then both subSegmentCount and mainSegmentCount are ignored.
If mainSegmentCount > 0, then subSegmentCount must be >= 1. In this
case the nurb will be broken into mainSegmentCount equally spaced
chords. If needed, each of these chords can be split into as many
subSegmentCount sub-parts if the subdivision is necessary for the
mesh to meet the other meshing constraints. In particular, if
subSegmentCount = 0, then the curve is broken into mainSegmentCount
pieces and no further testing is performed.
subSegmentCount:
maxAngleRadians:
( 0 to pi ) Maximum angle (in radians) between unit tangents at
adjacent vertices.
maxChordLengthRatio: Maximum permitted value of
(distance chord midpoint to curve) / (length of chord).
maxAspectRatio: If maxAspectRatio < 1.0, the parameter is ignored.
If 1 <= maxAspectRatio < sqrt(2), it is treated as if maxAspectRatio = sqrt(2).
This parameter controls the maximum permitted value of
(length of longest chord) / (length of shortest chord).
tolerance: If tolerance = 0, the parameter is ignored.
This parameter controls the maximum permitted value of the
distance from the curve to the polyline.
minEdgeLength:
maxEdgeLength: If maxEdgeLength = 0, the parameter
is ignored. This parameter controls the maximum permitted edge length.
keepStartPoint: If true the starting point of the curve
is added to the polyline. If false the starting point of the curve is
not added to the polyline.
curveDomain: This subdomain of the NURBS curve is approximated.
Returns: PolylineCurve on success, null on error.

Rhino.Geometry.Curve.Offset(Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,System.Double,System.Double,System.Double,Rhino.Geometry.CurveOffsetCornerStyle)
Offsets a curve. If you have a nice offset, then there will be one entry in
the array. If the original curve had kinks or the offset curve had self
intersections, you will get multiple segments in the offset_curves[] array.
normal: The normal to the offset plane.
origin: A point on offset plane.
distance: The positive or negative distance to offset.
tolerance: The offset or fitting tolerance.
angleTolerance: The angle tolerance (radians).
cornerStyle: Corner style for offset kinks.
Returns: Offset curves on success, null on failure.

Rhino.Geometry.Curve.Offset(Rhino.Geometry.Plane,System.Double,System.Double,Rhino.Geometry.CurveOffsetCornerStyle)
Offsets a curve. If you have a nice offset, then there will be one entry in
the array. If the original curve had kinks or the offset curve had self
intersections, you will get multiple segments in the offset_curves[] array.
plane: Offset solution plane.
distance: The positive or negative distance to offset.
tolerance: The offset or fitting tolerance.
cornerStyle: Corner style for offset kinks.
Returns: Offset curves on success, null on failure.

Rhino.Geometry.Curve.Offset(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double,System.Double,Rhino.Geometry.CurveOffsetCornerStyle)
Offsets a curve. If you have a nice offset, then there will be one entry in
the array. If the original curve had kinks or the offset curve had self
intersections, you will get multiple segments in the offset_curves[] array.
directionPoint: A point that indicates the direction of the offset.
normal: The normal to the offset plane.
distance: The positive or negative distance to offset.
tolerance: The offset or fitting tolerance.
cornerStyle: Corner style for offset kinks.
Returns: Offset curves on success, null on failure.

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.BrepFace,System.Double,System.Double)
Offset a curve on a surface. This curve must lie on the surface.
face:
distance: distance to offset (+)left, (-)right
fittingTolerance:
Returns:

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double)
Offset a curve on a surface. This curve must lie on the surface.
face:
throughPoint: 2d point on the brep face to offset through
fittingTolerance:
Returns:

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.BrepFace,System.Double[],System.Double[],System.Double)
Offset a curve on a surface. This curve must lie on the surface.
face:
curveParameters: curve parameters corresponding to the offset distances
offsetDistances: distances to offset (+)left, (-)right
fittingTolerance:
Returns:

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.Surface,System.Double,System.Double)
Offset a curve on a surface. This curve must lie on the surface.
surface:
distance: distance to offset (+)left, (-)right
fittingTolerance:
Returns:

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.Surface,Rhino.Geometry.Point2d,System.Double)
Offset a curve on a surface. This curve must lie on the surface.
surface:
throughPoint: 2d point on the brep face to offset through
fittingTolerance:
Returns:

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.Surface,System.Double[],System.Double[],System.Double)
Offset a curve on a surface. This curve must lie on the surface.
surface:
curveParameters: curve parameters corresponding to the offset distances
offsetDistances: distances to offset (+)left, (-)right
fittingTolerance:
Returns: