Rhino.Runtime.HostUtils.DebugString(System.String)
Print a debug message to the Rhino Command Line.
The messae will only appear if the SendDebugToCommandLine property is set to True.
msg: Message to print.

Rhino.Runtime.HostUtils.DebugString(System.String,System.Object[])
Print a debug message to the Rhino Command Line.
The messae will only appear if the SendDebugToCommandLine property is set to True.
format: Message to format and print.
args: An Object array containing zero or more objects to format.

Rhino.Runtime.HostUtils.CreateCommands(Rhino.PlugIns.PlugIn)
Parse a plugin and create all the commands defined therein.
plugin: Plugin to harvest for commands.
Returns: The number of newly created commands.

Rhino.Runtime.HostUtils.CreateCommands(System.IntPtr,System.Reflection.Assembly)
Parse a plugin and create all the commands defined therein.
pPlugIn: Plugin to harvest for commands.
pluginAssembly: Assembly associated with the plugin.
Returns: The number of newly created commands.

Rhino.Runtime.HostUtils.RegisterDynamicCommand(Rhino.PlugIns.PlugIn,Rhino.Commands.Command)
Add a new dynamic command to Rhino.
plugin: Plugin that owns the command.
cmd: Command to add.
Returns: True on success, false on failure.

Rhino.Runtime.HostUtils.DisplayOleAlerts(System.Boolean)
This function makes no sense on Mono
display: