Rhino.Geometry.Rectangle3d
Represents a 3d oriented rectangle.

Rhino.Geometry.Rectangle3d.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Create a new rectangle from width and height.
plane: Base plane for Rectangle.
width: Width (as measured along the base plane x-axis) of rectangle.
height: Height (as measured along the base plane y-axis) of rectangle.

Rhino.Geometry.Rectangle3d.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Create a new rectangle from dimensions.
plane: Base plane for Rectangle.
width: Dimension of rectangle along the base plane x-axis.
height: Dimension of rectangle along the base plane y-axis.

Rhino.Geometry.Rectangle3d.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Create a new rectangle from a base plane and two corner points.
plane: Base plane for Rectangle.
cornerA: First corner of Rectangle (will be projected onto plane).
cornerB: Second corner of Rectangle (will be projected onto plane).

Rhino.Geometry.Rectangle3d.CreateFromPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Try and create a Rectangle from a Polyline. In order for a polyline to qualify
as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
polyline: Polyline to parse.
Returns: A rectangle that is shaped similarly to the polyline or Rectangle3d.Unset
if the polyline does not represent a rectangle.

Rhino.Geometry.Rectangle3d.CreateFromPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double@,System.Double@)
Try and create a Rectangle from a Polyline. In order for a polyline to qualify
as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
polyline: Polyline to parse.
deviation: On success, the deviation will contain the largest deviation between the polyline and the rectangle.
angleDeviation: On success, the angleDeviation will contain the largest deviation (in radians) between the polyline edges and the rectangle edges.
Returns: A rectangle that is shaped similarly to the polyline or Rectangle3d.Unset
if the polyline does not represent a rectangle.

Rhino.Geometry.Rectangle3d.MakeIncreasing
Ensure the X and Y dimensions are increasing or singleton intervals.

Rhino.Geometry.Rectangle3d.Corner(System.Int32)
Get the corner at the given index.
index:
Index of corner, valid values are:
0 = lower left (min-x, min-y)1 = lower right (max-x, min-y)2 = upper right (max-x, max-y)3 = upper left (min-x, max-y)
Returns: The point at the given corner index.

Rhino.Geometry.Rectangle3d.RecenterPlane(System.Int32)
Recenter the base plane on one of the corners.
index:
Index of corner, valid values are:
0 = lower left (min-x, min-y)1 = lower right (max-x, min-y)2 = upper right (max-x, max-y)3 = upper left (min-x, max-y)

Rhino.Geometry.Rectangle3d.RecenterPlane(Rhino.Geometry.Point3d)
Recenter the base plane on a new origin.
origin: New origin for plane.

Rhino.Geometry.Rectangle3d.PointAt(System.Double,System.Double)
Get a point in Rectangle space.
x: Normalized parameter along Rectangle width.
y: Normalized parameter along Rectangle height.
Returns: The point at the given x,y parameter.

Rhino.Geometry.Rectangle3d.PointAt(System.Double)
Get a point along the rectangle boundary.
t: Parameter along rectangle boundary. Valid values range from 0.0 to 4.0,
where each integer domain represents a single boundary edge.
Returns: The point at the given boundary parameter.

Rhino.Geometry.Rectangle3d.ClosestPoint(Rhino.Geometry.Point3d)
Get the point on the rectangle that is closest to a test-point.
point: Point to project.
Returns: The point on or in the rectangle closest to the test point or Point3d.Unset on failure.

Rhino.Geometry.Rectangle3d.ClosestPoint(Rhino.Geometry.Point3d,System.Boolean)
Get the point on the rectangle that is closest to a test-point.
point: Point to project.
includeInterior: If False, the point is projected onto the boundary edge only,
otherwise the interior of the rectangle is also taken into consideration.
Returns: The point on the rectangle closest to the test point or Point3d.Unset on failure.

Rhino.Geometry.Rectangle3d.Contains(Rhino.Geometry.Point3d)
Test a point for inclusion.
pt: Point to test. The point will be projected onto the Rectangle plane before inclusion is determined.
Returns: Point Rectangle relationship.

Rhino.Geometry.Rectangle3d.Contains(System.Double,System.Double)
Test two plane parameters for inclusion.
x: Parameter along base plane X direction.
y: Parameter along base plane Y direction.
Returns: Parameter Rectangle relationship.

Rhino.Geometry.Rectangle3d.Transform(Rhino.Geometry.Transform)
Transform this rectangle. Note that rectangles cannot be skewed or tapered.
xform: Transformation to apply.

Rhino.Geometry.Rectangle3d.ToPolyline
Create a polyline from this rectangle.
Returns: A polyline with the same shape as this rectangle.

Rhino.Geometry.Rectangle3d.ToNurbsCurve
Create a nurbs curve representation of this rectangle.
Returns: A nurbs curve with the same shape as this rectangle.