Rhino.Geometry.Collections.NurbsSurfacePointList.CountU
Gets the number of control points in the 'U' direction of this surface.

Rhino.Geometry.Collections.NurbsSurfacePointList.CountV
Gets the number of control points in the 'V' direction of this surface.

Rhino.Geometry.Collections.NurbsSurfacePointList.GetGrevillePoint(System.Int32,System.Int32)
Get the Greville point (u, v) coordinates associated with the control point at the given indices.
u: Index of control-point along surface 'U' direction.
v: Index of control-point along surface 'U' direction.
Returns: A Surface UV coordinate on success, Point2d.Unset on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.GetControlPoint(System.Int32,System.Int32)
Gets the control point at the given (u, v) index.
u: Index of control-point along surface 'U' direction.
v: Index of control-point along surface 'U' direction.
Returns: The control point at the given (u, v) index.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetControlPoint(System.Int32,System.Int32,Rhino.Geometry.Point3d)
Sets the control point at the given (u, v) index.
u: Index of control-point along surface 'U' direction.
v: Index of control-point along surface 'U' direction.
cp: The control point location to set (weight is assumed to be 1.0).
Returns: True on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetControlPoint(System.Int32,System.Int32,Rhino.Geometry.ControlPoint)
Sets the control point at the given (u, v) index.
u: Index of control-point along surface 'U' direction.
v: Index of control-point along surface 'U' direction.
cp: The control point to set.
Returns: True on success, false on failure.