Rhino.Geometry.LightStyle.CameraDirectional
Light location and direction in camera coordinates.
+x points to right, +y points up, +z points towards camera

Rhino.Geometry.LightStyle.CameraPoint
Light location and direction in camera coordinates.
+x points to right, +y points up, +z points towards camera

Rhino.Geometry.LightStyle.CameraSpot
Light location and direction in camera coordinates.
+x points to right, +y points up, +z points towards camera

Rhino.Geometry.LightStyle.WorldDirectional
Light location and direction in world coordinates

Rhino.Geometry.LightStyle.WorldPoint
Light location and direction in world coordinates

Rhino.Geometry.LightStyle.WorldSpot
Light location and direction in world coordinates

Rhino.Geometry.LightStyle.Ambient
Pure ambient light