Rhino.UI.StackedDialogPage.OnApply
Called when stacked dialog OK button is pressed
Returns:
If return value is true then the dialog will be closed. A return of false means
there was an error and dialog remains open so page can be properly updated.