Rhino.Geometry.Cone.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Create a new Cone with a specified baseplane, height and radius.
plane: Base plane of cone.
height: Height of cone.
radius: Radius of cone.

Rhino.Geometry.Cone.Plane
Gets or sets the base plane of the Cone.

Rhino.Geometry.Cone.Height
Gets or sets the height of the cone.

Rhino.Geometry.Cone.Radius
Gets or sets the Radius of the cone.

Rhino.Geometry.Cone.IsValid
True is plane is valid, height is not zero and radius is not zero

Rhino.Geometry.Cone.BasePoint
Center of base circle

Rhino.Geometry.Cone.ApexPoint
Point at tip of the cone

Rhino.Geometry.Cone.Axis
Unit vector axis of cone

Rhino.Geometry.Cone.AngleInRadians
The angle (in radians) between the axis and the
side of the cone.
The angle and the height have the same sign.
Returns:

Rhino.Geometry.Cone.AngleInDegrees
The angle (in degrees) between the axis and the
side of the cone.
The angle and the height have the same sign.
Returns:

Rhino.Geometry.Cone.ToNurbsSurface
Create a Nurbs surface representation of this Cone.
This is synonymous with calling NurbsSurface.CreateFromCone().
Returns: A Nurbs surface representation of the cone or null.

Rhino.Geometry.Cone.ToRevSurface
Create a RevSurface representation of this Cone.
This is synonymous with calling RevSurface.CreateFromCone().
Returns: A RevSurface representation of the cone or null.

Rhino.Geometry.Cone.ToBrep(System.Boolean)
Get a Brep representation of the cone with a single
face for the cone, an edge along the cone seam,
and vertices at the base and apex ends of this seam edge.
The optional cap is a single face with one circular edge
starting and ending at the base vertex.
capBottom:
Returns: