Rhino.DocObjects.InstanceDefinitionUpdateType.Static
This instance definition is never updated. If m_source_archive is set,
it records the origin of the instance definition geometry, but
m_source_archive is never used to update the instance definition