Rhino.Geometry.MeshingParameters
Settings used for creating a Mesh representation of a Brep

Rhino.Geometry.MeshingParameters.#ctor
Initial values are same as "Default"

Rhino.Geometry.MeshingParameters.Minimal
Gets minimal meshing parameters

Rhino.Geometry.MeshingParameters.Default
Gets default meshing parameters

Rhino.Geometry.MeshingParameters.JaggedSeams
Gets or sets whether or not the mesh is allowed to have jagged seams.
When this flag is set to True, meshes on either side of a Brep Edge will not match up.

Rhino.Geometry.MeshingParameters.DocumentCurrentSetting(Rhino.RhinoDoc)
Gets the MeshingParameters that are currently set for a document.
These are the same settings that are shown in the DocumentProperties
Mesh settings user interface.
doc:
Returns: