Rhino.DocObjects.ObjectType.Grip
Selection filter value - not a real object type

Rhino.DocObjects.ObjectType.PolysrfFilter
Selection filter value - not a real object type

Rhino.DocObjects.ObjectType.EdgeFilter
Selection filter value - not a real object type

Rhino.DocObjects.ObjectType.PolyedgeFilter
Selection filter value - not a real object type