Rhino.Collections.RhinoList`1.#ctor
Create a new, empty list.

Rhino.Collections.RhinoList`1.#ctor(System.Int32)
Create an empty list with a certain capacity.
initialCapacity: Number of items this list can store without resizing.

Rhino.Collections.RhinoList`1.#ctor(System.Int32,`0)
Create a new List with a specified amount of values.
amount: Number of values to add to this list. Must be equal to or larger than zero.
defaultValue: Value to add, for reference types,
the same item will be added over and over again.

Rhino.Collections.RhinoList`1.#ctor(System.Collections.Generic.IEnumerable{`0})
Create a list that is a shallow duplicate of a collection.
collection: Collection of items to duplicate.

Rhino.Collections.RhinoList`1.#ctor(Rhino.Collections.RhinoList{`0})
Copy constructor. Create a shallow duplicate of another list.
list: List to mimic.

Rhino.Collections.RhinoList`1.System#Collections#Generic#ICollection&lt;T&gt;#IsReadOnly
When implemented by a class, gets a value indicating whether the IList is read-only.
RhinoList is never ReadOnly.

Rhino.Collections.RhinoList`1.NullCount
Gets the number of null references (Nothing in Visual Basic) in this list.
If T is a valuetype, this property always return zero.

Rhino.Collections.RhinoList`1.ListToString
Creates a multi-line string representation of all the items in this list.

Rhino.Collections.RhinoList`1.ToArray
Create a shallow copy of the items in this list.
Returns: An array containing all the items in this list.
Trailing items are not included.

Rhino.Collections.RhinoList`1.RemapIndex(System.Int32)
Remap an index in the infinite range onto the List index range.
index: Index to remap.
Returns: Remapped index

Rhino.Collections.RhinoList`1.GetRange(System.Int32,System.Int32)
Creates a shallow copy of a range of elements in the source List.
index: The zero-based List index at which the range starts.
count: The number of elements in the range.
Returns: A shallow copy of a range of elements in the source List.