Rhino.Geometry.Continuity.C0_locus_continuous
locus continuous function :
Continuity tests using the following enum values are identical to tests using the
preceding enum values on the INTERIOR of a curve's domain. At the END of a curve
a "locus" test is performed in place of a parametric test. In particular, at the
END of a domain, all open curves are locus discontinuous. At the END of a domain,
all closed curves are at least C0_locus_continuous. By convention all Curves
are considered locus continuous at the START of the evaluation domain. This
convention is not strictly correct, but it was adopted to make iterative kink
finding tools easier to use and so that locus discontinuities are reported once
at the end parameter of a curve rather than twice.

Rhino.Geometry.Continuity.C1_locus_continuous
locus continuous first derivative :
Continuity tests using the following enum values are identical to tests using the
preceding enum values on the INTERIOR of a curve's domain. At the END of a curve
a "locus" test is performed in place of a parametric test. In particular, at the
END of a domain, all open curves are locus discontinuous. At the END of a domain,
all closed curves are at least C0_locus_continuous. By convention all Curves
are considered locus continuous at the START of the evaluation domain. This
convention is not strictly correct, but it was adopted to make iterative kink
finding tools easier to use and so that locus discontinuities are reported once
at the end parameter of a curve rather than twice.

Rhino.Geometry.Continuity.C2_locus_continuous
locus continuous first and second derivative :
Continuity tests using the following enum values are identical to tests using the
preceding enum values on the INTERIOR of a curve's domain. At the END of a curve
a "locus" test is performed in place of a parametric test. In particular, at the
END of a domain, all open curves are locus discontinuous. At the END of a domain,
all closed curves are at least C0_locus_continuous. By convention all Curves
are considered locus continuous at the START of the evaluation domain. This
convention is not strictly correct, but it was adopted to make iterative kink
finding tools easier to use and so that locus discontinuities are reported once
at the end parameter of a curve rather than twice.

Rhino.Geometry.Continuity.G1_locus_continuous
locus continuous unit tangent :
Continuity tests using the following enum values are identical to tests using the
preceding enum values on the INTERIOR of a curve's domain. At the END of a curve
a "locus" test is performed in place of a parametric test. In particular, at the
END of a domain, all open curves are locus discontinuous. At the END of a domain,
all closed curves are at least C0_locus_continuous. By convention all Curves
are considered locus continuous at the START of the evaluation domain. This
convention is not strictly correct, but it was adopted to make iterative kink
finding tools easier to use and so that locus discontinuities are reported once
at the end parameter of a curve rather than twice.

Rhino.Geometry.Continuity.G2_locus_continuous
locus continuous unit tangent and curvature :
Continuity tests using the following enum values are identical to tests using the
preceding enum values on the INTERIOR of a curve's domain. At the END of a curve
a "locus" test is performed in place of a parametric test. In particular, at the
END of a domain, all open curves are locus discontinuous. At the END of a domain,
all closed curves are at least C0_locus_continuous. By convention all Curves
are considered locus continuous at the START of the evaluation domain. This
convention is not strictly correct, but it was adopted to make iterative kink
finding tools easier to use and so that locus discontinuities are reported once
at the end parameter of a curve rather than twice.

Rhino.Geometry.Continuity.Cinfinity_continuous
analytic discontinuity