Rhino.Input.Custom.GetNumber
used to get double precision numbers

Rhino.Input.Custom.GetNumber.#ctor
Create a new GetNumber

Rhino.Input.Custom.GetNumber.Get
Call to get a number
Returns:

Rhino.Input.Custom.GetNumber.SetLowerLimit(System.Double,System.Boolean)
Set a lower limit on the number that can be returned.
By default there is no lower limit.
lowerLimit: smallest acceptable number
strictlyGreaterThan:
If true, then the returned number will be > lower_limit

Rhino.Input.Custom.GetNumber.SetUpperLimit(System.Double,System.Boolean)
Set an upper limit on the number that can be returned.
By default there is no upper limit.
upperLimit: largest acceptable number
strictlyLessThan: If true, then the returned number will be < upper_limit