Rhino.Geometry.PolyCurve.#ctor
Create a new, empty PolyCurve.

Rhino.Geometry.PolyCurve.Duplicate
Duplicate this Polycurve.
Returns: An exact duplicate of this curve.

Rhino.Geometry.PolyCurve.DuplicatePolyCurve
Duplicate this Polycurve.
Returns: An exact duplicate of this curve.

Rhino.Geometry.PolyCurve.SegmentCurve(System.Int32)
Get the segment curve at the given index.
index: Index of segment to retrieve.
Returns: The segment at the given index or null on failure.

Rhino.Geometry.PolyCurve.RemoveNesting
Explodes nested polycurve segments and reconstructs this curve from the shattered remains.
The result will have not have any PolyCurves as segments but it will have identical
locus and parameterization.
Returns:
True if any nested PolyCurve was found and absorbed, false if no PolyCurve segments could be found.
Rhino.Geometry.PolyCurve.IsNested

Rhino.Geometry.PolyCurve.Explode
Explode this PolyCurve into a list of Curve segments. This will not explode nested PolyCurves.
Place a call to RemoveNesting() first if you want all individual segments.
Returns: An array of polycurve segments.

Rhino.Geometry.PolyCurve.Append(Rhino.Geometry.Line)
Append and match the start of the line to the end of polycurve.
This function will fail if the PolyCurve is closed.
line: Line segment to append.
Returns: True on success, false on failure.

Rhino.Geometry.PolyCurve.Append(Rhino.Geometry.Arc)
Append and match the start of the arc to the end of polycurve.
This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the arc is closed.
arc: Arc segment to append.
Returns: True on success, false on failure.

Rhino.Geometry.PolyCurve.Append(Rhino.Geometry.Curve)
Append and match the start of the curve to the end of polycurve.
This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the new segment is closed.
curve: Segment to append.
Returns: True on success, false on failure.

Rhino.Geometry.PolyCurve.SegmentIndex(System.Double)
Find the segment used for evaluation at polycurve_parameter.
polycurveParameter: Parameter on polycurve for segment lookup.
Returns:
Index of the segment used for evaluation at polycurve_parameter.
If polycurve_parameter < Domain.Min(), then 0 is returned.
If polycurve_parameter > Domain.Max(), then Count()-1 is returned.

Rhino.Geometry.PolyCurve.SegmentIndexes(Rhino.Geometry.Interval,System.Int32@,System.Int32@)
Find the segments that overlap the Polycurve sub domain.
subdomain: Domain on this PolyCurve.
segmentIndex0:
Index of first segment that overlaps the subdomain.
segmentIndex1:
Index of last segment that overlaps the subdomain. Note that segmentIndex0 <= i < segmentIndex1.
Returns: Number of segments that overlap the subdomain.