Rhino.PlugIns.PlugIn.Assembly
Source assembly for this plug-in

Rhino.PlugIns.PlugIn.GetLoadedPlugIn(System.Guid)
Only searches through list of RhinoCommon plug-ins
id:
Returns:

Rhino.PlugIns.PlugIn.Find(System.Reflection.Assembly)
Find the plug-in instance that was loaded from a given assembly
pluginAssembly:
Returns:

Rhino.PlugIns.PlugIn.GetCommands
All of the commands associated with this plug-in

Rhino.PlugIns.PlugIn.ShouldCallWriteDocument(Rhino.FileIO.FileWriteOptions)
Called whenever a Rhino is about to save a .3dm file.
If you want to save plug-in document data when a model is
saved in a version 5 .3dm file, then you must override this
function to return true and you must override WriteDocument().
options:
Returns:
True if the plug-in wants to save document user data in the
version 5 .3dm file.  The default returns false.

Rhino.PlugIns.PlugIn.WriteDocument(Rhino.RhinoDoc,Rhino.FileIO.BinaryArchiveWriter,Rhino.FileIO.FileWriteOptions)
Called when Rhino is saving a .3dm file to allow the plug-in
to save document user data.
doc:
archive:
OpenNURBS file archive object Rhino is using to write the file.
Use BinaryArchiveWriter.Write*() functions to write plug-in data.
OR use the ArchivableDictionary
If any BinaryArchiveWriter.Write*() functions throw an exception,
then archive.WriteErrorOccured will be true and you should immediately return.
Setting archive.WriteErrorOccured to true will cause Rhino to stop saving the file.
options:

Rhino.PlugIns.PlugIn.ReadDocument(Rhino.RhinoDoc,Rhino.FileIO.BinaryArchiveReader,Rhino.FileIO.FileReadOptions)
Called whenever a Rhino document is being loaded and plug-in user data was
encountered written by a plug-in with this plug-in's GUID.
doc:
archive:
OpenNURBS file archive object Rhino is using to read this file.
Use BinaryArchiveReader.Read*() functions to read plug-in data.
If any BinaryArchive.Read*() functions throws an exception then
archive.ReadErrorOccurve will be true and you should immediately return.
options: Describes what is being written

Rhino.PlugIns.PlugIn.OptionsDialogPages(System.Collections.Generic.List{Rhino.UI.OptionsDialogPage})
Override this function if you want to extend the options dialog. This function is
called whenever the user brings up the Options dialog.
pages: list of pages to add your custom options dialog page(s) to