Rhino.DocObjects.InstanceDefinition.Index
index of this instance definition in the index definition table.

Rhino.DocObjects.InstanceDefinition.Object(System.Int32)
returns an object used as part of this definition.
index: 0 <= index < ObjectCount
Returns:
Returns an object that is used to define the geometry.
Does NOT return an object that references this definition.count the number of references to this instance

Rhino.DocObjects.InstanceDefinition.GetObjects
Get a list of the objects that belong to this instance definition.
Returns:

Rhino.DocObjects.InstanceDefinition.GetReferences(System.Int32)
Get a list of the CRhinoInstanceObjects (inserts) that contains
a reference this instance definition.
wheretoLook:
0 = get top level references in active document
1 = get top level and nested references in active document
2 = check for references from other instance definitions
Returns:

Rhino.DocObjects.InstanceDefinition.GetContainers
Get a list of all the InstanceDefinitions that contain a reference this InstanceDefinition.
Returns:

Rhino.DocObjects.InstanceDefinition.UsesDefinition(System.Int32)
Determine if this instance definition contains a reference to another instance definition.
otherIdefIndex: index of another instance definition
Returns:
0      no
1      other_idef_index is the index of this instance definition
>1      This InstanceDefinition uses the instance definition
and the returned value is the nesting depth.

Rhino.DocObjects.InstanceDefinition.InUse(System.Int32)
Returns true if the instance definition is refereneced.
wheretoLook:
0 = check for top level references in active document
1 = check for top level and nested references in active document
2 = check for references in other instance definitions
Returns: